window.PRODUCT_INDEX={"2716":{"id":"2716","name":"【尊客】320g植萃香氛泡沫型洗手液高端酒店宾馆民宿洁净温和清洁桶装补充装","price":"8.20","sale":"已售2.6万件 好评99%","parent":"客房用品","cat":"一次性耗品","params":{"品牌":"尊客","箱规":"10瓶","支持定制":"是","质量保证期":"2年","最小起订量":"1瓶","支持试用":"是","发货周期":"24小时发货","适用酒店":"0-3星","香型":"草本/植物调"}},"4295":{"id":"4295","name":"300ML白茶一次性洗发水沐浴露护发素可添加","price":"5.88","sale":"已售5.5万件 好评100%","parent":"客房用品","cat":"一次性耗品","params":{"品牌":"HAOTO","箱规":"10/50","支持定制":"是","质量保证期":"3年","最小起订量":"10","支持试用":"是","发货周期":"48小时发货","适用酒店":"2-4星"}},"68165":{"id":"68165","name":"【悦诗兰庭】清雅8ml袋装一次性洗发水和沐浴露 洗头液膏酒店宾馆洗漱用品","price":"0.08","sale":"本月上新","parent":"客房用品","cat":"一次性耗品","params":{"品牌":"悦诗兰庭","箱规":"2000","支持定制":"否","质量保证期":"3年","最小起订量":"500","支持试用":"是","发货周期":"24小时发货","适用酒店":"0-2星"}},"3671":{"id":"3671","name":"【尊客】泡沫洗手液320g洗手液大桶装补充液泡沫家用酒店宾馆民宿公用","price":"8.80","sale":"已售4389件 好评100%","parent":"客房用品","cat":"一次性耗品","params":{"品牌":"悦诗兰庭","箱规":"40瓶","支持定制":"是","质量保证期":"3年","最小起订量":"1瓶","支持试用":"是","发货周期":"24小时发货","适用酒店":"0-3星","香型":"花香调"}},"60471":{"id":"60471","name":"【木质】酒店大瓶洗发水沐浴露护发素民宿宾馆使用","price":"6.8","sale":"已售11件","parent":"客房用品","cat":"一次性耗品"},"70323":{"id":"70323","name":"【白茶系列新品】一次性牙具梳子耗品六小件","price":"0.09","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"3968":{"id":"3968","name":"【尊客】全系列软管一次性洗发水沐浴露全系列酒店宾馆民宿专用","price":"0.24","sale":"已售14.4万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"5459":{"id":"5459","name":"连锁酒店同款珍珠棉一次性拖鞋","price":"1.38","sale":"已售10.6万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"70359":{"id":"70359","name":"【新品卷膜袋系列】经济型酒店透明袋耗品牙具梳子六小件","price":"0.09","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"541":{"id":"541","name":"【尊客】8-15g多规格一次性方形香皂酒店宾馆民宿专用小肥皂","price":"0.09","sale":"已售87.1万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"138":{"id":"138","name":"【尊客】香氛系列 290ml大瓶洗沐护酒店宾馆专用","price":"5.5","sale":"已售15.9万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"64113":{"id":"64113","name":"全新透明料一次性牙刷梳子星级酒店民宿软毛牙刷牙膏","price":"0.1","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"6099":{"id":"6099","name":"【大卫多夫】酒店一次性洗发水\\沐浴露\\护发素\\润肤乳500ML可添加","price":"8.8","sale":"已售3681件 好评100%","parent":"客房用品","cat":"一次性耗品"},"57715":{"id":"57715","name":"【荣凯】酒店专用薰衣草一次性洗衣液袋装10克便携方便","price":"0.11","sale":"已售2.4万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"69393":{"id":"69393","name":"华驿棉签","price":"0.1","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"21215":{"id":"21215","name":"【欧诗】5L洗发液补充装星级酒店宾馆大桶洗发水沐浴露民宿专桔子酒店同款","price":"12.4","sale":"已售223件 好评100%","parent":"客房用品","cat":"一次性耗品"},"62157":{"id":"62157","name":"【优梦妍】全季酒店同款质心天竺葵芳香洗发露500ml酒店一次性沐浴露大瓶","price":"8.0","sale":"已售871件","parent":"客房用品","cat":"一次性耗品"},"67479":{"id":"67479","name":"【荣凯】软膜洗漱套装一次性牙刷梳子香皂洗发水沐浴露酒店宾馆民宿专用","price":"0.1","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"45":{"id":"45","name":"【尊客】繁花三边封牙具梳子 酒店宾馆民宿专用","price":"0.29","sale":"已售30.7万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"9125":{"id":"9125","name":"【尊客】20公斤海蓝之谜/民宿风大桶洗发露沐浴露护发素","price":"165.0","sale":"已售396件 好评100%","parent":"客房用品","cat":"一次性耗品"},"67481":{"id":"67481","name":"【荣凯】牛皮纸洗漱套装一次性牙刷梳子香皂性价比酒店宾馆民宿专用","price":"0.1","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"4245":{"id":"4245","name":"【尊客】酒店儿童款拖鞋 多种款式 防滑加厚鞋底 亲子房","price":"0.9","sale":"已售19万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"2307":{"id":"2307","name":"【尊客】桔子400ml洗发水沐浴露酒店同款一次性专用小瓶大瓶装宾馆沐浴液","price":"4.6","sale":"已售30.9万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"69389":{"id":"69389","name":"华驿浴帽","price":"0.12","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"2136":{"id":"2136","name":"【尊客】牛皮纸10毫升袋装洗发水沐浴露酒店宾馆民宿专用","price":"0.1","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"4089":{"id":"4089","name":"【尊客】轻奢一次性梳子三边封包装圆弧梳齿酒店宾馆民宿专用头梳","price":"0.19","sale":"已售22.1万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"69419":{"id":"69419","name":"华驿香皂","price":"0.12","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"605":{"id":"605","name":"【草珊瑚】480g植萃香氛洗发露/沐浴露/护发素高品质液体酒店宾馆民宿专用","price":"6.9","sale":"已售7.7万件 好评99%","parent":"客房用品","cat":"一次性耗品"},"21125":{"id":"21125","name":"【派立客】酒店一次性儿童牙具拖鞋","price":"0.81","sale":"已售1.3万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"70121":{"id":"70121","name":"【红杉树】5星酒店白枫卡盒洗护牙具","price":"0.12","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"58":{"id":"58","name":"【尊客】一次性针线包 六线一针一别针两纽扣 酒店宾馆民宿专用","price":"0.18","sale":"已售4.2万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"63989":{"id":"63989","name":"威露士（Walch）沐浴露薄荷冰爽清凉1L大瓶 沐浴液滋润保湿持久留香 男女士同","price":"25.8","sale":"本月上新","parent":"客房用品","cat":"一次性耗品"},"6439":{"id":"6439","name":"【娇慕】Le petit prince 小王子 儿童用品套装【混搭2箱起订】","price":"2.05","sale":"已售1.2万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"18167":{"id":"18167","name":"【派立客】云沁系列 400毫升大瓶洗护","price":"4.5","sale":"已售2507件 好评100%","parent":"客房用品","cat":"一次性耗品"},"64":{"id":"64","name":"【尊客】银韵30g瓶装洗发水沐浴露300g大瓶酒店宾馆民宿专用泡沫丰富","price":"0.38","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"一次性耗品"},"9075":{"id":"9075","name":"【伊兰美】巴宝莉裸莎爱恋系列 35ml小瓶装洗沐护润 洗发水/沐浴露/护发素/润","price":"0.94","sale":"已售3万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"568":{"id":"568","name":"一次性软毛牙刷牙膏套装梳子防水袋","price":"0.17","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"一次性耗品"},"11247":{"id":"11247","name":"【尊客】白茶香氛5L 20L大桶洗发水沐浴露护发素","price":"33.0","sale":"已售3810件 好评99%","parent":"客房用品","cat":"一次性耗品"},"5290":{"id":"5290","name":"【花速】兰蔻香氛300ml洗发水沐浴露护发素润肤露便携装酒店民宿待客一次性洗护套","price":"5.8","sale":"已售3083件 好评100%","parent":"客房用品","cat":"一次性耗品"},"11163":{"id":"11163","name":"【红杉树】酒店儿童星级加厚款四季拖鞋","price":"1.18","sale":"已售1万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"4813":{"id":"4813","name":"【尊客】20公斤植萃香氛大桶洗沐护酒店宾馆民宿专用","price":"8.8","sale":"已售177件 好评100%","parent":"客房用品","cat":"一次性耗品"},"572":{"id":"572","name":"【尊客】简约20g锡封口白管洗发水沐浴露酒店宾馆民宿专用洗头膏泡沫丰富","price":"0.07","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"3647":{"id":"3647","name":"一次性牙刷带牙膏软毛牙具洗漱套装","price":"0.18","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"981":{"id":"981","name":"【尊客】整包一次性拖鞋酒店专用宾馆民宿防滑加厚底拖鞋","price":"0.25","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"一次性耗品"},"18081":{"id":"18081","name":"【力士】Lux300ml百合与佛手柑香氛酒店洗发水沐浴露","price":"11.8","sale":"已售592件 好评100%","parent":"客房用品","cat":"一次性耗品"},"2311":{"id":"2311","name":"【尊客】20公斤大桶装香氛洗发水沐浴露护发素补充液酒店宾馆民宿专用","price":"5.5","sale":"已售1.3万件 好评99%","parent":"客房用品","cat":"一次性耗品"},"9445":{"id":"9445","name":"【HAOTO】500ML星级大瓶洗发水沐浴露","price":"7.5","sale":"已售8.4万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"50":{"id":"50","name":"【新品上线】星级三边封一次性牙刷牙膏牙具套装","price":"0.26","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"一次性耗品"},"569":{"id":"569","name":"【尊客】儿童酒店宾馆专用一次性牙刷牙膏 亲子拖鞋软毛牙具民宿套装","price":"0.47","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"702":{"id":"702","name":"【尊客】一次性浴帽酒店宾馆专用防水放油加大加厚独立包装头戴浴帽","price":"0.1","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"4992":{"id":"4992","name":"20KG白茶香型大桶装洗发水/沐浴露补充液","price":"8.0","sale":"已售1822件 好评100%","parent":"客房用品","cat":"一次性耗品"},"4509":{"id":"4509","name":"【凯来】春村奈川洗护用品300ml（通货款）","price":"1.0","sale":"已售3.2万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"620":{"id":"620","name":"【尊客】白茶香氛300ml / 500ml 洗发水沐浴露护发素酒店宾馆民宿专用泡","price":"3.2","sale":"已售14万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"54":{"id":"54","name":"【尊客】四季享程一次性梳子秸秆长条梳酒店宾馆民宿专用","price":"0.14","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"一次性耗品"},"6097":{"id":"6097","name":"【大卫多夫】酒店一次性洗发水\\沐浴露\\护发素\\润肤乳400ML可添加","price":"7.99","sale":"已售1.1万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"3639":{"id":"3639","name":"【尊客】拉毛绒拖鞋酒店一次性拉毛绒拖鞋宾馆民宿防滑加大加厚","price":"0.57","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"2134":{"id":"2134","name":"轻奢一次性洗漱用品套装一次性牙刷牙膏牙具","price":"0.15","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"3298":{"id":"3298","name":"轻奢-粉黛摩黑新品牙刷梳子","price":"0.11","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"一次性耗品"},"3707":{"id":"3707","name":"【尊客】无异味拖鞋一次性大码拖鞋酒店专用无异味真丝棉宾馆防滑","price":"0.25","sale":"已售48.5万件 好评100%","parent":"客房用品","cat":"一次性耗品"},"53":{"id":"53","name":"【尊客】酒店宾馆一次性圆形小香皂 酒店宾馆民宿专用小肥皂","price":"0.11","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"一次性耗品"},"52657":{"id":"52657","name":"白色抽纸/二层/60抽/长方抽纸酒店客房专用软抽纸， 面巾纸","price":"0.62","sale":"已售1.3万件","parent":"客房用品","cat":"日用品","params":{"品牌":"港杰","箱规":"1","支持定制":"否","质量保证期":"36个月","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"2-4星","包装":"软袋装"}},"61193":{"id":"61193","name":"白士洁抽纸大小餐巾纸尺寸商用长方形纸巾整箱KTV面巾纸","price":"0.59","sale":"已售3290件","parent":"客房用品","cat":"日用品","params":{"品牌":"白士洁","箱规":"52*40*40","支持定制":"否","质量保证期":"3年","最小起订量":"1","支持试用":"是","发货周期":"48小时发货","适用酒店":"2-4星","包装":"软袋装"}},"69433":{"id":"69433","name":"华驿纸杯（套袋）","price":"0.15","sale":"本月上新","parent":"客房用品","cat":"日用品","params":{"品牌":"首信瑞程","箱规":"5000","支持定制":"是","质量保证期":"3","最小起订量":"5000","支持试用":"是","发货周期":"48小时发货","适用酒店":"0-3星","材质":"纸质"}},"6829":{"id":"6829","name":"抽纸 质美 无香型 4层36抽/包 100包/箱","price":"0.39","sale":"已售7.9万件 好评98%","parent":"客房用品","cat":"日用品","params":{"品牌":"质美","箱规":"39.5*31*27cm","支持定制":"是","质量保证期":"3年","最小起订量":"1箱","支持试用":"是","发货周期":"48小时发货","适用酒店":"3-5星","包装":"软袋装"}},"6087":{"id":"6087","name":"酒店一次性小垃圾袋45*45","price":"0.03","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"日用品"},"68161":{"id":"68161","name":"【悦诗兰庭】酒店宾馆加大加厚垃圾袋 纯新料不易破结实耐用","price":"0.24","sale":"本月上新","parent":"客房用品","cat":"日用品"},"6991":{"id":"6991","name":"酒店一次性小垃圾袋45*45","price":"0.03","sale":"已售98.8万件 好评100%","parent":"客房用品","cat":"日用品"},"27049":{"id":"27049","name":"植护抽纸 气垫纸巾4层360张*20大包整箱 餐巾纸抽 面巾擦手用纸","price":"29.4","sale":"已售41件 好评100%","parent":"客房用品","cat":"日用品"},"67327":{"id":"67327","name":"如漫/有芯/4层/40g/印花/空芯小卷纸","price":"0.37","sale":"本月上新","parent":"客房用品","cat":"日用品","params":{"品牌":"如漫","箱规":"108","支持定制":"是","质量保证期":"三年","最小起订量":"1080","支持试用":"是","发货周期":"48小时发货","适用酒店":"2-4星","包装":"大袋包装"}},"7353":{"id":"7353","name":"抽纸 质美 无香型 3层66抽/包 100包/箱","price":"0.73","sale":"已售7万件 好评100%","parent":"客房用品","cat":"日用品"},"125":{"id":"125","name":"【尊客】一次性纸杯 最低仅需0.088元/只 酒店宾馆民宿专用","price":"92.0","sale":"已售66万件 好评100%","parent":"客房用品","cat":"日用品"},"69421":{"id":"69421","name":"40 克卷纸","price":"0.4","sale":"本月上新","parent":"客房用品","cat":"日用品"},"17789":{"id":"17789","name":"兆丽/酒店/民宿/一次性纸杯产品 (1000只装)","price":"0.07","sale":"已售13.1万件 好评100%","parent":"客房用品","cat":"日用品"},"10871":{"id":"10871","name":"无纺布一次性马桶套马桶坐垫","price":"0.18","sale":"已售24.4万件 好评100%","parent":"客房用品","cat":"日用品"},"67395":{"id":"67395","name":"如漫/有芯/4层/50g/印花/空芯小卷纸","price":"0.46","sale":"本月上新","parent":"客房用品","cat":"日用品","params":{"品牌":"如漫","箱规":"96","支持定制":"是","质量保证期":"三年","最小起订量":"960","支持试用":"是","发货周期":"48小时发货","适用酒店":"2-4星","包装":"大袋包装"}},"6813":{"id":"6813","name":"散装抽纸 质美 无香型带印花 4层 五斤/包","price":"26.5","sale":"已售1376件 好评100%","parent":"客房用品","cat":"日用品"},"3682":{"id":"3682","name":"【尊客】一次性马桶套坐垫坐便套垫无纺布酒店宾馆民宿专用品防水加厚旅行旅游","price":"0.24","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"日用品"},"69423":{"id":"69423","name":"50克卷纸","price":"0.5","sale":"本月上新","parent":"客房用品","cat":"日用品"},"3667":{"id":"3667","name":"【红杉树】酒店黑色大号加厚垃圾袋","price":"0.06","sale":"已售2.8万件 好评100%","parent":"客房用品","cat":"日用品"},"3144":{"id":"3144","name":"【红杉树】星级酒店同款进口原料香薰补充液","price":"39.0","sale":"已售1120件 好评100%","parent":"客房用品","cat":"日用品"},"69425":{"id":"69425","name":"80克卷纸","price":"0.8","sale":"本月上新","parent":"客房用品","cat":"日用品"},"1812":{"id":"1812","name":"泽市/160长款/2层/50抽/抽纸","price":"0.67","sale":"已售36.2万件 好评100%","parent":"客房用品","cat":"日用品"},"8061":{"id":"8061","name":"【信诚】酒店90x110黑色大垃圾袋 含税包邮","price":"0.4","sale":"已售13.3万件 好评100%","parent":"客房用品","cat":"日用品"},"69541":{"id":"69541","name":"遥控盒-卡其色","price":"14.0","sale":"本月上新","parent":"客房用品","cat":"日用品"},"3661":{"id":"3661","name":"【红杉树】民宿本色一次性杯子加厚茶水杯","price":"0.08","sale":"已售61.8万件 好评100%","parent":"客房用品","cat":"日用品"},"3164":{"id":"3164","name":"【红杉树】酒店民宿实木荷木衣架","price":"2.9","sale":"已售1699件 好评100%","parent":"客房用品","cat":"日用品"},"69535":{"id":"69535","name":"长方形抽纸盒-卡其色","price":"23.0","sale":"本月上新","parent":"客房用品","cat":"日用品"},"7293":{"id":"7293","name":"【红杉树】酒店镂空加厚浴室拖鞋","price":"9.5","sale":"已售1300件 好评100%","parent":"客房用品","cat":"日用品"},"8317":{"id":"8317","name":"【红杉树】酒店客房75%消毒卫生湿巾","price":"0.12","sale":"已售9.7万件 好评100%","parent":"客房用品","cat":"日用品"},"68159":{"id":"68159","name":"【悦诗兰庭】酒店客房专用小垃圾袋宾馆民宿卫生间加厚不易破","price":"26.0","sale":"本月上新","parent":"客房用品","cat":"日用品"},"4838":{"id":"4838","name":"80*100大垃圾袋","price":"0.44","sale":"已售29.9万件 好评100%","parent":"客房用品","cat":"日用品"},"583":{"id":"583","name":"泽市/短款/4层/50抽/65抽/简装抽纸","price":"0.8","sale":"已售63.7万件 好评100%","parent":"客房用品","cat":"日用品"},"1536":{"id":"1536","name":"【尊客】酒店卫生纸宾馆客房小卷纸商用筒纸厕所卷纸卫生间纸整箱","price":"0.36","sale":"已售11.4万件 好评100%","parent":"客房用品","cat":"日用品"},"21041":{"id":"21041","name":"45*45黑色小垃圾袋客房专用","price":"0.03","sale":"已售7.8万件 好评100%","parent":"客房用品","cat":"日用品"},"3143":{"id":"3143","name":"【红杉树】酒店北欧款大容量无火香薰精油","price":"5.5","sale":"已售1334件 好评100%","parent":"客房用品","cat":"日用品"},"2026":{"id":"2026","name":"泽市/有芯/4层/30g/40g/50g/非独立包装卷纸","price":"0.32","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"日用品"},"3662":{"id":"3662","name":"【红杉树】250ml9司加厚加大一次性纸杯加厚加硬茶纸杯","price":"0.08","sale":"已售59万件 好评100%","parent":"客房用品","cat":"日用品"},"36289":{"id":"36289","name":"【恒创】一次性垃圾袋加厚特厚客房平口塑料袋","price":"18.0","sale":"已售53件 好评100%","parent":"客房用品","cat":"日用品"},"6611":{"id":"6611","name":"【信诚 】酒店大黑垃圾袋 含税包邮","price":"0.34","sale":"已售4.8万件 好评94%","parent":"客房用品","cat":"日用品"},"4292":{"id":"4292","name":"【尊客】大垃圾袋-加大加厚-黑色纯新料生产结实不易破","price":"0.24","sale":"已售14.1万件 好评100%","parent":"客房用品","cat":"日用品"},"6075":{"id":"6075","name":"30g/40g/50g/80g/90g/100g有芯5层白色卷纸","price":"0.34","sale":"已售18.5万件 好评99%","parent":"客房用品","cat":"日用品"},"1413":{"id":"1413","name":"【红杉树】酒店减震静音凉拖鞋","price":"6.9","sale":"已售7554件 好评100%","parent":"客房用品","cat":"日用品"},"61537":{"id":"61537","name":"如漫 长款抽纸160mm/180mm 50抽/80抽/独立包装抽纸","price":"0.6","sale":"已售1.1万件","parent":"客房用品","cat":"日用品"},"6803":{"id":"6803","name":"【红杉树】 酒店一次性泡澡袋加厚浴缸套","price":"0.85","sale":"已售7.3万件 好评100%","parent":"客房用品","cat":"日用品"},"61269":{"id":"61269","name":"如漫/有芯/4层/50g/印花/非独立包装小卷纸","price":"0.28","sale":"已售9.1万件 好评100%","parent":"客房用品","cat":"日用品"},"6805":{"id":"6805","name":"卷纸 质美 有芯4层 30g/40g/50g/60g/80g每卷 4提/箱","price":"0.35","sale":"已售12.4万件 好评100%","parent":"客房用品","cat":"日用品"},"578":{"id":"578","name":"【含税包邮】 杭洁牌 黑色平口大垃圾袋 90*110cm 32克 500装","price":"0.5","sale":"已售90.3万件 好评100%","parent":"客房用品","cat":"日用品"},"7133":{"id":"7133","name":"抽纸 质美 无香型 3层66抽 100包/箱","price":"0.52","sale":"已售15.6万件 好评99%","parent":"客房用品","cat":"日用品"},"126":{"id":"126","name":"【尊客】酒店客房专用小垃圾袋宾馆民宿卫生间加厚不易破","price":"0.02","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"日用品"},"6207":{"id":"6207","name":"100抽*2层白色抽纸（超值款）","price":"130.5","sale":"已售8.7万件 好评100%","parent":"客房用品","cat":"日用品"},"978":{"id":"978","name":"鹏达/长款/2层/60抽/80抽/100抽简装软抽","price":"0.61","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"日用品"},"384":{"id":"384","name":"鹏达/有芯/3层/50g/80g/100g/卷纸","price":"0.48","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"日用品"},"3704":{"id":"3704","name":"【尊客】100抽80抽50抽抽纸酒店宾馆民宿专用独立包装","price":"0.56","sale":"已售81.3万件 好评99%","parent":"客房用品","cat":"日用品"},"325":{"id":"325","name":"鹏达/有芯/3层/700克/12卷/箱大卷纸","price":"7.25","sale":"已售4423件 好评100%","parent":"客房用品","cat":"日用品"},"8771":{"id":"8771","name":"【欧诗】一次性马桶坐垫独立包装","price":"0.21","sale":"已售3.9万件 好评100%","parent":"客房用品","cat":"日用品"},"10907":{"id":"10907","name":"蚊香液驱蚊液电蚊香","price":"1.1","sale":"已售3.1万件 好评100%","parent":"客房用品","cat":"日用品"},"124":{"id":"124","name":"加大加厚垃圾袋纯新料不易破结实耐用","price":"0.24","sale":"已售100万+件 好评99%","parent":"客房用品","cat":"日用品"},"56813":{"id":"56813","name":"【恒创】100*120大号32g加厚特厚垃圾袋塑料袋","price":"0.38","sale":"已售2902件","parent":"客房用品","cat":"日用品"},"61265":{"id":"61265","name":"如漫/有芯/4层/40g/印花/非独立包装小卷纸","price":"0.37","sale":"已售1.8万件","parent":"客房用品","cat":"日用品"},"3703":{"id":"3703","name":"【尊客】30g/40g/50g/80g/100g白色卷纸酒店卫生纸宾馆客房用纸厕","price":"0.3","sale":"已售100万+件 好评100%","parent":"客房用品","cat":"日用品"},"52971":{"id":"52971","name":"伊利金典鲜活纯牛奶整箱 3.8g乳蛋白 礼盒装 双重活性营养10*250ml","price":"55.00","sale":"已售41件 好评100%","parent":"客房用品","cat":"食品饮料","params":{"品牌":"伊利","箱规":"10*250ml","支持定制":"否","质量保证期":"90天","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"68155":{"id":"68155","name":"康师傅方便面一倍半红烧牛肉面桶装泡面12桶装【仅广西可售】","price":"44.80","sale":"本月上新","parent":"客房用品","cat":"食品饮料","params":{"品牌":"康师傅","箱规":"12","支持定制":"否","质量保证期":"6个月","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-5星"}},"67933":{"id":"67933","name":"Cafebreak 布蕾克金奖甜系列挂耳咖啡","price":"24.00","sale":"本月上新","parent":"客房用品","cat":"食品饮料","params":{"品牌":"Cafebreak 布蕾克","箱规":"12","支持定制":"否","质量保证期":"十八个月","最小起订量":"12","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"7691":{"id":"7691","name":"【全国包邮】农夫山泉l天然水 500ml*24瓶/箱酒店版 100箱","price":"1752.00","sale":"已售335件 好评100%","parent":"客房用品","cat":"食品饮料","params":{"品牌":"农夫山泉","箱规":"24","支持定制":"否","质量保证期":"3年","最小起订量":"1","支持试用":"否","发货周期":"7天内发货","适用酒店":"2-4星"}},"6713":{"id":"6713","name":"伊利 利乐冠安慕希常温酸奶草莓燕麦味 1*10*200g","price":"53.5","sale":"已售396件 好评100%","parent":"客房用品","cat":"食品饮料"},"67929":{"id":"67929","name":"Cafebreak 布蕾克甜系列金奖咖啡豆","price":"34.0","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"4666":{"id":"4666","name":"【全国包邮】今麦郎蓝标纯净水550ml/24瓶/件（全国大部分地区均可配送，下单","price":"10.5","sale":"已售26.3万件 好评100%","parent":"客房用品","cat":"食品饮料"},"63019":{"id":"63019","name":"【赵子笼】正宗嵊州老面手工小笼包酒店早餐点心","price":"0.56","sale":"已售2007件","parent":"客房用品","cat":"食品饮料"},"54883":{"id":"54883","name":"特浮森优选G3咖啡豆","price":"39.5","sale":"已售104件","parent":"客房用品","cat":"食品饮料"},"56875":{"id":"56875","name":"福临门 五常大米 5kg","price":"54.0","sale":"已售29件","parent":"客房用品","cat":"食品饮料"},"6707":{"id":"6707","name":"伊利 3.6g蛋白质金典纯牛奶(苗条砖) 1*250ml*12盒","price":"44.5","sale":"已售947件 好评100%","parent":"客房用品","cat":"食品饮料"},"67931":{"id":"67931","name":"Cafebreak 布蕾克单一产地SOE咖啡豆","price":"42.0","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"68115":{"id":"68115","name":"今麦郎-蓝标饮用水550ml*24瓶/箱","price":"10.1","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"7403":{"id":"7403","name":"【全国包邮】农夫山泉l天然水 500ml酒店版 24瓶/箱","price":"17.52","sale":"已售12.8万件 好评100%","parent":"客房用品","cat":"食品饮料"},"54283":{"id":"54283","name":"统一汤达人方便面桶装整箱12桶","price":"52.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"4289":{"id":"4289","name":"立顿一次性袋泡茶红茶包绿茶包","price":"0.58","sale":"已售18.9万件 好评100%","parent":"客房用品","cat":"食品饮料"},"4773":{"id":"4773","name":"【尊客】简装2克宾馆专用独立袋泡茶包酒店宾馆专用","price":"0.1","sale":"已售81.8万件 好评100%","parent":"客房用品","cat":"食品饮料"},"69205":{"id":"69205","name":"良品铺子中秋月饼5味10枚（预售中~9.11日开始发货）","price":"55.0","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"57765":{"id":"57765","name":"白象桶装方便面香辣红烧牛肉面泡面口味可随意搭配整箱12桶","price":"39.9","sale":"已售22件 好评100%","parent":"客房用品","cat":"食品饮料"},"10705":{"id":"10705","name":"CHALI茶里茶包","price":"38.5","sale":"已售552件 好评100%","parent":"客房用品","cat":"食品饮料"},"69295":{"id":"69295","name":"良品铺子中秋月饼月桂庭芳640g/提（9味10枚）【预售中~9.11日开始发货）","price":"79.0","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"4290":{"id":"4290","name":"速溶咖啡","price":"0.25","sale":"已售10.8万件 好评100%","parent":"客房用品","cat":"食品饮料"},"7999":{"id":"7999","name":"【全国包邮】怡宝 饮用水 24瓶/箱 0.74元/瓶（全国大部分地区均可配送，下","price":"17.5","sale":"已售1.8万件 好评100%","parent":"客房用品","cat":"食品饮料"},"67935":{"id":"67935","name":"Cafebreak 布蕾克单一产地SOE挂耳咖啡","price":"33.0","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"54273":{"id":"54273","name":"洽洽小蓝袋每日坚果30日装750g （25g*30袋）","price":"139.5","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"6537":{"id":"6537","name":"（仅供全国部分城市，50件起订）景田饮用纯净水0.79元/瓶（下单前请务必先咨询","price":"18.56","sale":"已售6670件 好评100%","parent":"客房用品","cat":"食品饮料"},"52203":{"id":"52203","name":"中粮福临门食用油非转基因纯香菜籽油5L（新疆、西藏、海南以及港澳台地区不发货，请","price":"69.0","sale":"已售12件 好评100%","parent":"客房用品","cat":"食品饮料"},"56951":{"id":"56951","name":"福临门 非转基因 纯香菜籽油 5L","price":"68.5","sale":"已售30件","parent":"客房用品","cat":"食品饮料"},"4667":{"id":"4667","name":"【全国包邮】今麦郎凉白开饮用水0.66元/瓶 24瓶/件（下单前请先咨询）","price":"15.9","sale":"已售5328件 好评100%","parent":"客房用品","cat":"食品饮料"},"63771":{"id":"63771","name":"正宗嵊州手工老面小笼包","price":"0.56","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"52189":{"id":"52189","name":"福临门食用油 非转基因一级大豆油5L","price":"69.0","sale":"已售20件","parent":"客房用品","cat":"食品饮料"},"6841":{"id":"6841","name":"小种红茶袋泡茶 原叶袋泡茶","price":"0.55","sale":"已售5.4万件","parent":"客房用品","cat":"食品饮料"},"52975":{"id":"52975","name":"【特价】认养一头牛全脂纯牛奶200ml*12盒 牛奶整箱","price":"32.0","sale":"已售40件","parent":"客房用品","cat":"食品饮料"},"22377":{"id":"22377","name":"味全100%好喝椰10瓶礼盒装","price":"60.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"52183":{"id":"52183","name":"福临门自然香五常香米5kg（新疆、西藏、海南以及港澳台地区不发货，请勿拍）","price":"79.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"22371":{"id":"22371","name":"味全6瓶尝鲜装 2瓶橙汁+2瓶好喝耶+2瓶葡萄汁 常温款果汁 [300mL-6瓶","price":"35.0","sale":"90天已售<10件 好评100%","parent":"客房用品","cat":"食品饮料"},"51829":{"id":"51829","name":"嗨可妹兰州牛肉面桶装速食清真","price":"25.6","sale":"已售13件","parent":"客房用品","cat":"食品饮料"},"53939":{"id":"53939","name":"福临门家宴小麦粉2.5kg/5kg","price":"21.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"52179":{"id":"52179","name":"福临门 食用油 浓香压榨一级 花生油5L（新疆、西藏、海南以及港澳台地区不发货，","price":"89.0","sale":"已售13件 好评100%","parent":"客房用品","cat":"食品饮料"},"51741":{"id":"51741","name":"鲁花 香味家族系列5S压榨一级花生油 5L（新疆、西藏、甘肃、宁夏、青海、内蒙古","price":"182.9","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"22373":{"id":"22373","name":"味全100%橙汁10瓶礼盒装","price":"60.0","sale":"90天已售<10件 好评100%","parent":"客房用品","cat":"食品饮料"},"6711":{"id":"6711","name":"伊利 利乐冠安慕希常温酸奶黄桃燕麦味 1*10*200g","price":"53.5","sale":"已售717件 好评100%","parent":"客房用品","cat":"食品饮料"},"4581":{"id":"4581","name":"2克邗八怪一次性袋泡茶叶绿茶红茶花茶铁观音","price":"0.18","sale":"已售12.3万件 好评100%","parent":"客房用品","cat":"食品饮料"},"53851":{"id":"53851","name":"金沙河真味多用途小麦粉2.5kg/5kg","price":"21.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"52523":{"id":"52523","name":"中粮五湖优选珍珠米4kg","price":"24.9","sale":"90天已售<10件 好评100%","parent":"客房用品","cat":"食品饮料"},"21033":{"id":"21033","name":"【组合茶包】CHALI茶里 客房茶包","price":"400.0","sale":"已售54件 好评100%","parent":"客房用品","cat":"食品饮料"},"69287":{"id":"69287","name":"杏花楼月饼礼盒","price":"83.3","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"53943":{"id":"53943","name":"金沙河鸡蛋麦芯挂面1500g","price":"20.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"52181":{"id":"52181","name":"福临门东北优质大米5kg两面真空包装","price":"49.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"51525":{"id":"51525","name":"金龙鱼特选东北大米5kg（新疆、西藏、甘肃、宁夏、青海、内蒙古、海南、港澳台不发","price":"49.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"51517":{"id":"51517","name":"裕道府 五常生态大米（双层袋真空装）2.5kg新疆、西藏、甘肃、宁夏、青海、内蒙","price":"41.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"57073":{"id":"57073","name":"福临门 米面油组合[米7.5KG+油5L+挂面1.6KG]","price":"166.0","sale":"已售28件","parent":"客房用品","cat":"食品饮料"},"56899":{"id":"56899","name":"福临门 葵花籽油 4L","price":"59.0","sale":"已售19件","parent":"客房用品","cat":"食品饮料"},"17849":{"id":"17849","name":"特浓原味速溶咖啡15g/包","price":"0.59","sale":"已售1.2万件","parent":"客房用品","cat":"食品饮料"},"6839":{"id":"6839","name":"白茶原叶袋泡茶","price":"0.55","sale":"已售4万件","parent":"客房用品","cat":"食品饮料"},"53807":{"id":"53807","name":"【金龙鱼】御品稻花香5kg","price":"67.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"23319":{"id":"23319","name":"（一箱起发）今麦郎麻辣香锅方便面桶装速食面（非偏远地区均可包邮）","price":"45.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"5475":{"id":"5475","name":"娃哈哈桂圆莲子八宝粥360g*12罐","price":"45.0","sale":"已售2899件 好评100%","parent":"客房用品","cat":"食品饮料"},"69197":{"id":"69197","name":"今麦郎-蓝标","price":"10.9","sale":"本月上新","parent":"客房用品","cat":"食品饮料"},"57001":{"id":"57001","name":"福临门 亚麻籽油400ml*3","price":"28.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"57751":{"id":"57751","name":"白象汤好喝方便面老母鸡汤高汤泡面整箱24袋","price":"66.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"23323":{"id":"23323","name":"（一箱起发）今麦郎一桶半方便面桶装整箱发泡面（非偏远地区均可包邮）","price":"45.5","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"23321":{"id":"23321","name":"（一箱起发）今麦郎安徽板面桶装方便面泡面（非偏远地区均可包邮）","price":"52.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"53237":{"id":"53237","name":"【UPPER STAR】上星品牌碧螺春/金骏眉/茉莉/普洱2克袋泡茶","price":"0.39","sale":"已售4504件","parent":"客房用品","cat":"食品饮料"},"56953":{"id":"56953","name":"福临门 非转基因 一级大豆油 5L","price":"62.9","sale":"已售16件","parent":"客房用品","cat":"食品饮料"},"53295":{"id":"53295","name":"康师傅无糖茉莉花茶500ml*15瓶整箱装","price":"65.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"51835":{"id":"51835","name":"四小姐自热米饭煲仔饭大分量快餐方便速食多种口味","price":"35.6","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"53753":{"id":"53753","name":"加多宝 310ML*24罐","price":"54.0","sale":"已售14件","parent":"客房用品","cat":"食品饮料"},"51743":{"id":"51743","name":"鲁花香味家族低芥酸浓香菜籽油5L(新疆、西藏、甘肃、宁夏、青海、内蒙古、海南、港","price":"110.0","sale":"已售20件","parent":"客房用品","cat":"食品饮料"},"52413":{"id":"52413","name":"上蔬永辉头道原浆特级老酱油570g","price":"9.9","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"8791":{"id":"8791","name":"【中粮集团】中国茶叶酒店客房茶包一次性袋泡茶2g/袋（红茶、绿茶、乌龙茶、普洱茶","price":"0.49","sale":"已售5.1万件 好评100%","parent":"客房用品","cat":"食品饮料"},"57945":{"id":"57945","name":"DL胖东来小磨芝麻酱300g/小磨芝麻香油218ml/448ml","price":"36.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"57689":{"id":"57689","name":"脆司令干吃面干脆面整箱40包多种口味","price":"43.5","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"52693":{"id":"52693","name":"认养一头牛全脂常温纯牛奶礼盒装 纯牛奶200ml*12盒*1提","price":"49.0","sale":"已售13件","parent":"客房用品","cat":"食品饮料"},"53259":{"id":"53259","name":"魔爪 黑魔爪原味 330ML*12罐","price":"57.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"56897":{"id":"56897","name":"福临门 葵花籽油 1.8L","price":"32.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"53251":{"id":"53251","name":"雀巢咖啡 丝滑拿铁 268ml*15瓶整箱装","price":"84.0","sale":"90天已售<10件","parent":"客房用品","cat":"食品饮料"},"6843":{"id":"6843","name":"浓香型铁观音袋泡茶 原叶铁观音袋泡茶","price":"0.55","sale":"已售1.6万件","parent":"客房用品","cat":"食品饮料"},"6771":{"id":"6771","name":"【洽洽-每日坚果】洽洽每日坚果小黄袋16g*300袋 /箱","price":"2.25","sale":"已售4200件 好评100%","parent":"客房用品","cat":"食品饮料"},"1568":{"id":"1568","name":"【红杉树】60*60s中高端全棉加密贡缎床单舒适光泽触感佳","price":"62.00","sale":"已售2.8万件 好评100%","parent":"酒店布草","cat":"床上用品","params":{"品牌":"红杉树","箱规":"10","支持定制":"是","质量保证期":"1","最小起订量":"5","支持试用":"是","发货周期":"3天内发货","适用酒店":"0-3星"}},"1553":{"id":"1553","name":"【红杉树】星级酒店枕套全棉加密纯白枕芯套","price":"11.50","sale":"已售11.9万件 好评100%","parent":"酒店布草","cat":"床上用品","params":{"品牌":"红杉树","箱规":"100","支持定制":"是","质量保证期":"1年","最小起订量":"5","支持试用":"是","发货周期":"7天内发货","适用酒店":"0-3星"}},"68485":{"id":"68485","name":"【瑶莱】酒店枕套/贡缎6040全棉新疆长绒棉酒店枕套","price":"10.67","sale":"本月上新","parent":"酒店布草","cat":"床上用品","params":{"品牌":"YAOLAI瑶莱","箱规":"30*50","支持定制":"是","质量保证期":"1年","最小起订量":"1","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"2429":{"id":"2429","name":"【红杉树】酒店全棉防羽布羽丝绒被芯（全棉防羽布）","price":"109.00","sale":"已售5127件 好评100%","parent":"酒店布草","cat":"床上用品","params":{"品牌":"红杉树","箱规":"1","支持定制":"是","质量保证期":"1","最小起订量":"2","支持试用":"是","发货周期":"3天内发货","适用酒店":"0-3星"}},"2642":{"id":"2642","name":"【红杉树】 酒店零压舒睡记忆棉枕芯","price":"10.0","sale":"已售5348件 好评100%","parent":"酒店布草","cat":"床上用品"},"68487":{"id":"68487","name":"【瑶莱】酒店枕套/双喷贡缎6060全棉新疆长绒棉酒店枕套","price":"1.0","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"2412":{"id":"2412","name":"【红杉树】80*80支五星级全棉加密贡缎星级酒店全棉舒适床单","price":"10.0","sale":"已售5847件 好评100%","parent":"酒店布草","cat":"床上用品"},"2455":{"id":"2455","name":"【红杉树】磨毛布舒适经济床护垫","price":"35.0","sale":"已售3989件 好评100%","parent":"酒店布草","cat":"床上用品"},"68489":{"id":"68489","name":"【瑶莱】酒店枕套/6060单喷贡缎/6080双喷贡缎全棉新疆长绒棉酒店枕套","price":"1.0","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"3115":{"id":"3115","name":"【红杉树】60支中高端纯白全棉加密贡缎床笠","price":"10.0","sale":"已售1473件 好评100%","parent":"酒店布草","cat":"床上用品"},"1563":{"id":"1563","name":"【红杉树】60支被套高支高密贡缎被套","price":"63.0","sale":"已售1.8万件 好评100%","parent":"酒店布草","cat":"床上用品"},"68491":{"id":"68491","name":"【瑶莱】酒店枕套/双喷贡缎8080全棉新疆长绒棉酒店枕套","price":"1.0","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"672":{"id":"672","name":"【红杉树】五星级酒店舒适羽丝绒枕芯【单只】","price":"18.8","sale":"已售1.6万件 好评99%","parent":"酒店布草","cat":"床上用品"},"11159":{"id":"11159","name":"【红杉树】酒店民宿全棉加密加大枕套","price":"10.0","sale":"已售7519件 好评100%","parent":"酒店布草","cat":"床上用品"},"68493":{"id":"68493","name":"【瑶莱】酒店枕套/8080单喷贡缎全棉新疆长绒棉酒店枕套","price":"1.0","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"2644":{"id":"2644","name":"【红杉树】酒店夏季薄款羽丝棉夏凉被芯","price":"49.0","sale":"已售2497件 好评99%","parent":"酒店布草","cat":"床上用品"},"55943":{"id":"55943","name":"【公正纺织】全棉酒店枕套","price":"7.9","sale":"已售820件 好评100%","parent":"酒店布草","cat":"床上用品"},"57353":{"id":"57353","name":"【叠发纺织】酒店民宿缓冲立体全棉舒适垫","price":"5.0","sale":"已售295件","parent":"酒店布草","cat":"床上用品"},"2631":{"id":"2631","name":"【红杉树】星级酒店立体纯棉羽丝绒枕芯","price":"25.0","sale":"已售9136件 好评100%","parent":"酒店布草","cat":"床上用品"},"2419":{"id":"2419","name":"【红杉树】80*80s七星级高支高密全棉贡缎被套","price":"10.0","sale":"已售5879件 好评100%","parent":"酒店布草","cat":"床上用品"},"69983":{"id":"69983","name":"【茗正】星级酒店全棉枕套","price":"7.9","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"2186":{"id":"2186","name":"【红杉树】定制补差价专拍","price":"1.0","sale":"已售139件 好评100%","parent":"酒店布草","cat":"床上用品"},"9083":{"id":"9083","name":"【红杉树】60支加大尺寸全棉贡缎纯白被套","price":"10.0","sale":"已售4755件 好评100%","parent":"酒店布草","cat":"床上用品"},"675":{"id":"675","name":"【红杉树】60支高密星级布草客房套件","price":"10.0","sale":"已售3227件 好评99%","parent":"酒店布草","cat":"床上用品"},"7747":{"id":"7747","name":"【红杉树】酒店床笠式磨毛布保洁垫床护垫","price":"1.0","sale":"已售6344件 好评100%","parent":"酒店布草","cat":"床上用品"},"3116":{"id":"3116","name":"【红杉树】80支五星级全棉加密贡缎床笠","price":"62.0","sale":"已售1279件 好评100%","parent":"酒店布草","cat":"床上用品"},"69435":{"id":"69435","name":"【瑶莱】酒店保护垫/磨毛柔软斜纹布酒店保护垫","price":"26.73","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"3442":{"id":"3442","name":"【红杉树】五星级酒店羽丝绒枕芯","price":"150.0","sale":"已售2732件 好评100%","parent":"酒店布草","cat":"床上用品"},"6269":{"id":"6269","name":"【HOTEL HOME 韩亿布草】60*60贡缎纤维涤棉枕套纯棉枕套支持定制","price":"8.5","sale":"已售129件 好评100%","parent":"酒店布草","cat":"床上用品"},"69153":{"id":"69153","name":"【江苏家棉】纯白加密保护垫 酒店专用耐磨防滑保护垫 贴身透气不变形商用布草垫","price":"26.9","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"61863":{"id":"61863","name":"【叠发纺织】凉感水洗冰丝夏凉被","price":"52.0","sale":"已售21件","parent":"酒店布草","cat":"床上用品"},"674":{"id":"674","name":"【红杉树】6040s酒店全棉条纹舒适四件套耐洗耐用","price":"128.0","sale":"已售334件 好评100%","parent":"酒店布草","cat":"床上用品"},"2422":{"id":"2422","name":"【红杉树】80*80s五星级高支高密全棉舒适套件","price":"158.0","sale":"已售1654件 好评99%","parent":"酒店布草","cat":"床上用品"},"68519":{"id":"68519","name":"【瑶莱】酒店羽丝绒枕芯/全棉新疆长绒棉酒店枕芯","price":"22.77","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"4058":{"id":"4058","name":"【红杉树】一次性床单被罩枕套双人四件套酒店用品","price":"3.6","sale":"已售1918件 好评100%","parent":"酒店布草","cat":"床上用品"},"2428":{"id":"2428","name":"【红杉树】磨毛布四季款客房羽丝棉舒适被芯","price":"69.0","sale":"已售2377件 好评100%","parent":"酒店布草","cat":"床上用品"},"4208":{"id":"4208","name":"【红杉树】一次性酒店床笠款无纺布三件套四件套","price":"4.8","sale":"已售3220件 好评100%","parent":"酒店布草","cat":"床上用品"},"8901":{"id":"8901","name":"【红杉树】60支加大尺寸全棉加密贡缎床单","price":"52.0","sale":"已售5830件 好评100%","parent":"酒店布草","cat":"床上用品"},"8667":{"id":"8667","name":"【红杉树】酒店全棉护颈硬枕","price":"35.8","sale":"已售342件 好评100%","parent":"酒店布草","cat":"床上用品"},"68517":{"id":"68517","name":"【瑶莱】酒店春秋被芯/全棉新疆长绒棉酒店被芯","price":"97.3","sale":"本月上新","parent":"酒店布草","cat":"床上用品"},"56297":{"id":"56297","name":"【公正纺织】酒店专用荞麦枕芯","price":"29.0","sale":"已售35件","parent":"酒店布草","cat":"床上用品"},"35821":{"id":"35821","name":"洁丽雅（Grace）纤维枕星级酒店枕头枕芯46*72cm一对装（2只装）","price":"42.0","sale":"已售86件 好评100%","parent":"酒店布草","cat":"床上用品"},"6267":{"id":"6267","name":"【HOTEL HOME 韩亿布草】60*80贡缎纤维涤棉被套纯棉被套支持定制","price":"55.8","sale":"已售71件 好评100%","parent":"酒店布草","cat":"床上用品"},"6279":{"id":"6279","name":"【HOTEL HOME 韩亿布草】60*60贡缎纤维涤棉四件套纯棉四件套支持定制","price":"98.4","sale":"已售38件 好评100%","parent":"酒店布草","cat":"床上用品"},"2456":{"id":"2456","name":"【红杉树】酒店舒适立体床垫","price":"79.0","sale":"已售495件 好评100%","parent":"酒店布草","cat":"床上用品"},"2423":{"id":"2423","name":"【红杉树】40支全棉加密贡缎套件 舒适经济","price":"118.0","sale":"已售464件 好评100%","parent":"酒店布草","cat":"床上用品"},"17417":{"id":"17417","name":"全棉贡缎5CM飞边枕皮枕套4040S/6040S/6060S/6080s/808","price":"0.74","sale":"已售1482件","parent":"酒店布草","cat":"床上用品"},"35819":{"id":"35819","name":"洁丽雅（Grace）A类深睡枕头枕芯星级酒店枕羽丝绒枕芯纤维软枕芯单只装","price":"23.1","sale":"已售25件 好评100%","parent":"酒店布草","cat":"床上用品"},"2630":{"id":"2630","name":"【红杉树】酒店慢回弹经济型记忆枕","price":"39.8","sale":"已售2713件 好评100%","parent":"酒店布草","cat":"床上用品"},"6281":{"id":"6281","name":"【HOTEL HOME 韩亿布草】磨毛可水洗保护垫支持定制","price":"29.0","sale":"已售53件 好评100%","parent":"酒店布草","cat":"床上用品"},"55951":{"id":"55951","name":"【公正纺织】纯棉酒店用被套","price":"60.0","sale":"已售245件","parent":"酒店布草","cat":"床上用品"},"4216":{"id":"4216","name":"【红杉树】一次性白色床上套装酒店隔脏睡袋四件套被套","price":"4.9","sale":"已售453件 好评100%","parent":"酒店布草","cat":"床上用品"},"2643":{"id":"2643","name":"【红杉树】酒店加大尺寸全棉羽丝棉四季秋冬被芯","price":"92.0","sale":"已售1207件 好评100%","parent":"酒店布草","cat":"床上用品"},"55705":{"id":"55705","name":"【公正纺织】酒店专用枕芯","price":"18.0","sale":"已售24件","parent":"酒店布草","cat":"床上用品"},"61847":{"id":"61847","name":"【叠发纺织】酒店布草床笠式保护垫纯白床笠式隔脏垫","price":"44.0","sale":"已售81件","parent":"酒店布草","cat":"床上用品"},"2420":{"id":"2420","name":"【 红杉树】40支经济型全棉加厚纯白贡缎被套 经济舒适","price":"62.0","sale":"已售1921件 好评100%","parent":"酒店布草","cat":"床上用品"},"55709":{"id":"55709","name":"【公正纺织】高端全棉防鹅绒被芯","price":"69.0","sale":"已售16件","parent":"酒店布草","cat":"床上用品"},"9757":{"id":"9757","name":"【红杉树】酒店民宿全棉条纹提花枕套","price":"10.9","sale":"已售1.5万件 好评100%","parent":"酒店布草","cat":"床上用品"},"2558":{"id":"2558","name":"【红杉树】60s民宿全棉高支高密灰色贡缎床单（可定制）","price":"59.0","sale":"已售19件 好评100%","parent":"酒店布草","cat":"床上用品"},"11205":{"id":"11205","name":"一次性床品四件套","price":"3.8","sale":"已售1653件","parent":"酒店布草","cat":"床上用品"},"2650":{"id":"2650","name":"【红杉树】16支铂金缎全棉长毛舒适毛巾","price":"8.20","sale":"已售2万件 好评100%","parent":"酒店布草","cat":"巾垫类","params":{"品牌":"红杉树","箱规":"50","支持定制":"是","质量保证期":"1年","最小起订量":"50","支持试用":"是","发货周期":"7天内发货","适用酒店":"0-3星"}},"1419":{"id":"1419","name":"【柚青春】高星级加厚一次性木浆毛巾浴巾","price":"1.59","sale":"已售9.7万件 好评100%","parent":"酒店布草","cat":"巾垫类","params":{"品牌":"柚青春","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"是","发货周期":"48小时发货","适用酒店":"0-3星","材质":"木棉","包装":"独立包装"}},"7511":{"id":"7511","name":"【红杉树】26年新品一次性毛巾浴巾民宿酒店独立包装","price":"0.26","sale":"已售17.4万件 好评100%","parent":"酒店布草","cat":"巾垫类","params":{"品牌":"红杉树","箱规":"1000","支持定制":"是","质量保证期":"1","最小起订量":"100","支持试用":"是","发货周期":"48小时发货","适用酒店":"0-3星","材质":"珍珠棉","包装":"独立包装"}},"6833":{"id":"6833","name":"【康之源】酒店民宿木浆纤维一次性浴巾毛巾","price":"1.28","sale":"已售17.4万件 好评100%","parent":"酒店布草","cat":"巾垫类","params":{"品牌":"康之源","箱规":"500","支持定制":"是","质量保证期":"1年","最小起订量":"200","支持试用":"是","发货周期":"3天内发货","适用酒店":"0-3星","材质":"木棉","包装":"独立包装"}},"667":{"id":"667","name":"【红杉树】32/16支酒店全棉毛巾舒适耐洗面巾0成本试样","price":"6.9","sale":"已售3.7万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"63397":{"id":"63397","name":"【薄荷联盟】星级酒店一次性毛巾浴巾独立包装","price":"0.24","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"6849":{"id":"6849","name":"【白洁雅】经济型酒店一次性珍珠纹毛巾洗脸巾","price":"0.27","sale":"已售66.1万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"2051":{"id":"2051","name":"【红杉树】星级酒店同款32支全棉加厚地巾","price":"15.8","sale":"已售6407件 好评100%","parent":"酒店布草","cat":"巾垫类"},"69209":{"id":"69209","name":"纯净客房一次性面巾 浴巾","price":"0.26","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"7445":{"id":"7445","name":"纯净客房一次性面巾 浴巾","price":"258.0","sale":"已售69.7万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"3244":{"id":"3244","name":"【洁适康】标准款一次性面巾、毛巾、洗脸巾60g/80g/75g-升级新品","price":"330.0","sale":"已售100万+件 好评100%","parent":"酒店布草","cat":"巾垫类"},"69269":{"id":"69269","name":"环保面巾浴巾套装加厚加大","price":"0.26","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"2369":{"id":"2369","name":"【白洁雅】一次性舒适型毛巾浴巾套装 独立包装","price":"0.52","sale":"已售21.6万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"1547":{"id":"1547","name":"【红杉树】21支宾馆民宿经济型方巾","price":"2.85","sale":"已售299件","parent":"酒店布草","cat":"巾垫类"},"69439":{"id":"69439","name":"一次性面巾","price":"0.34","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"2368":{"id":"2368","name":"【白洁雅】高品质珍珠棉高星级一次性毛巾浴巾独立包装","price":"0.68","sale":"已售19.9万件 好评99%","parent":"酒店布草","cat":"巾垫类"},"671":{"id":"671","name":"【红杉树】16/32s星级酒店纯棉加厚浴巾","price":"26.8","sale":"已售2万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"3118":{"id":"3118","name":"【白洁雅】70g一次性舒适型浴巾毛巾面巾无纺布独立包装酒店","price":"0.01","sale":"已售16.6万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"51431":{"id":"51431","name":"加大一次性浴巾酒店旅行独立包装","price":"0.27","sale":"已售3007件","parent":"酒店布草","cat":"巾垫类"},"17751":{"id":"17751","name":"【恒创】加厚无纺布一次性面巾洗脸毛巾","price":"0.28","sale":"已售13万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"69267":{"id":"69267","name":"环保面巾浴巾套装加大","price":"1.15","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"6459":{"id":"6459","name":"一次性面巾毛巾浴巾洗脸巾/50g","price":"0.27","sale":"已售4.7万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"8821":{"id":"8821","name":"洁生一次性面巾","price":"0.27","sale":"已售100万+件 好评99%","parent":"酒店布草","cat":"巾垫类"},"68879":{"id":"68879","name":"16支酒店全棉毛巾舒适耐洗面巾0成本试样","price":"5.0","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"6513":{"id":"6513","name":"穗宝 HTPS01X 22cm厚 床垫","price":"621.0","sale":"已售93件","parent":"酒店布草","cat":"巾垫类"},"51089":{"id":"51089","name":"【红杉树】一次性浴巾一次性毛巾洗脸巾组合套装独立包装","price":"0.26","sale":"已售12.1万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"68889":{"id":"68889","name":"16s支铂金缎全棉长毛舒适酒店长毛毛巾","price":"7.5","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"2367":{"id":"2367","name":"高星级民宿酒店一次性毛巾浴巾独立包装","price":"0.25","sale":"已售42.6万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"2668":{"id":"2668","name":"【康之源】客房一次性洗脸面巾浴巾独立包装","price":"0.29","sale":"已售16.7万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"69309":{"id":"69309","name":"【茗正】五星级酒店专用脚垫地巾","price":"14.9","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"18189":{"id":"18189","name":"【促销中】酒店民宿一次性面巾、浴巾60g/70g独立包装","price":"0.01","sale":"已售4.3万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"2058":{"id":"2058","name":"【洁柔】一次性毛巾浴巾木浆纤维独立包装","price":"0.28","sale":"已售100万+件 好评100%","parent":"酒店布草","cat":"巾垫类"},"669":{"id":"669","name":"【红杉树】经济款21支宾馆毛巾浴巾方巾","price":"4.5","sale":"已售7242件 好评99%","parent":"酒店布草","cat":"巾垫类"},"3158":{"id":"3158","name":"【柚青春】酒店一次性毛巾浴巾加厚吸水面巾独立包装","price":"0.29","sale":"已售7.1万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"9471":{"id":"9471","name":"酒店民宿一次性面巾、洗脸巾60g/70g（升级大尺寸）","price":"0.24","sale":"已售10.4万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"3608":{"id":"3608","name":"【尊客】高品质一次性全棉毛巾浴巾独立包装酒店宾馆民宿专用","price":"0.33","sale":"已售32万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"4192":{"id":"4192","name":"【红杉树】 浴室防滑垫卫生间洗澡带吸盘地垫","price":"13.6","sale":"已售817件 好评100%","parent":"酒店布草","cat":"巾垫类"},"11569":{"id":"11569","name":"酒店涤棉毛巾（更耐洗/更耐用）","price":"5.0","sale":"已售2911件 好评100%","parent":"酒店布草","cat":"巾垫类"},"8009":{"id":"8009","name":"【红杉树】TPE浴室淋浴防滑垫","price":"25.8","sale":"已售330件","parent":"酒店布草","cat":"巾垫类"},"8023":{"id":"8023","name":"【红杉树】酒店TPE环保浴室防滑垫","price":"20.5","sale":"已售163件","parent":"酒店布草","cat":"巾垫类"},"3152":{"id":"3152","name":"【红杉树】酒店地巾民宿平织加厚耐洗地巾","price":"15.8","sale":"已售900件 好评100%","parent":"酒店布草","cat":"巾垫类"},"670":{"id":"670","name":"【红杉树】甄选品质酒店全棉方巾","price":"2.8","sale":"已售6680件 好评100%","parent":"酒店布草","cat":"巾垫类"},"17757":{"id":"17757","name":"【恒创】加厚无纺布一次性浴巾洗澡毛巾","price":"1.32","sale":"已售30.7万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"4310":{"id":"4310","name":"【替代系列】升级新品-环保面巾浴巾套装加厚90g/加大70g/","price":"1.35","sale":"已售34.6万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"4191":{"id":"4191","name":"【红杉树】酒店卫生间吸盘淋浴防摔pvc地垫","price":"16.5","sale":"已售659件 好评100%","parent":"酒店布草","cat":"巾垫类"},"2658":{"id":"2658","name":"【红杉树】16支全棉铂金缎浴巾 星级品质","price":"29.0","sale":"已售1万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"2356":{"id":"2356","name":"【红杉树】温泉会所洗浴舒适浴巾","price":"1.0","sale":"已售3872件 好评100%","parent":"酒店布草","cat":"巾垫类"},"488":{"id":"488","name":"【康乃馨】四星五星方巾33*33/60g","price":"5.0","sale":"已售2463件","parent":"酒店布草","cat":"巾垫类"},"8223":{"id":"8223","name":"【康之源】70g酒店环保浴巾毛巾套装加厚吸水独立包装","price":"0.35","sale":"已售6.3万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"2475":{"id":"2475","name":"【红杉树】0-5星高品质舒适浴袍","price":"52.8","sale":"已售306件 好评100%","parent":"酒店布草","cat":"巾垫类"},"9437":{"id":"9437","name":"【柚青春】酒店一次性加大加厚强吸水毛巾浴巾","price":"0.29","sale":"已售2.8万件 好评100%","parent":"酒店布草","cat":"巾垫类"},"4950":{"id":"4950","name":"【金可儿】轻奢乳胶护脊睡眠床垫30cm（样板间）","price":"1875.0","sale":"已售3570件","parent":"酒店布草","cat":"巾垫类"},"2660":{"id":"2660","name":"【红杉树】21支宾馆民宿经济型舒适浴巾","price":"19.8","sale":"已售984件 好评100%","parent":"酒店布草","cat":"巾垫类"},"55949":{"id":"55949","name":"【叠发纺织】星级酒店轻奢浴袍","price":"77.0","sale":"已售56件","parent":"酒店布草","cat":"巾垫类"},"2378":{"id":"2378","name":"【红杉树】酒店一次性沐浴吸水浴袍","price":"3.5","sale":"已售951件 好评100%","parent":"酒店布草","cat":"巾垫类"},"40697":{"id":"40697","name":"大江Ag+银离子 抗菌浴室地垫卫生间门口吸水垫厕所脚垫纯色40x60cm","price":"27.5","sale":"90天已售<10件","parent":"酒店布草","cat":"巾垫类"},"2566":{"id":"2566","name":"【红杉树】星级酒店全棉割绒浴袍","price":"65.0","sale":"已售217件","parent":"酒店布草","cat":"巾垫类"},"58671":{"id":"58671","name":"【邦亿客】一次性浴巾洗脸毛巾独立包装加厚加大","price":"0.52","sale":"已售13件","parent":"酒店布草","cat":"巾垫类"},"68651":{"id":"68651","name":"【红杉树】酒店儿童房儿童全棉割绒浴袍","price":"79.0","sale":"本月上新","parent":"酒店布草","cat":"巾垫类"},"6461":{"id":"6461","name":"一次性经济型无纺布毛巾浴巾套装 独立包装","price":"0.3","sale":"已售3243件 好评100%","parent":"酒店布草","cat":"巾垫类"},"3088":{"id":"3088","name":"【红杉树】古色古香系列床尾巾","price":"45.00","sale":"已售488件 好评100%","parent":"酒店布草","cat":"装饰布草","params":{"品牌":"红杉树","箱规":"-","支持定制":"是","质量保证期":"-","最小起订量":"1","支持试用":"是","发货周期":"3天内发货","适用酒店":"0-3星","材质":"化纤材质"}},"3106":{"id":"3106","name":"【红杉树】2024款轻奢时尚床尾巾床旗抱枕","price":"38.00","sale":"已售177件 好评100%","parent":"酒店布草","cat":"装饰布草","params":{"品牌":"红杉树","箱规":"-","支持定制":"是","质量保证期":"-","最小起订量":"1","支持试用":"是","发货周期":"3天内发货","适用酒店":"2-4星","材质":"化纤材质"}},"3090":{"id":"3090","name":"【红杉树】彩麻系列床尾巾","price":"39.00","sale":"已售731件 好评100%","parent":"酒店布草","cat":"装饰布草","params":{"品牌":"红杉树","箱规":"-","支持定制":"是","质量保证期":"-","最小起订量":"1","支持试用":"是","发货周期":"3天内发货","适用酒店":"0-3星","材质":"化纤材质"}},"7893":{"id":"7893","name":"【红杉树】酒店纯色华夫格床尾巾盖毯","price":"49.50","sale":"已售126件","parent":"酒店布草","cat":"装饰布草","params":{"品牌":"红杉树","箱规":"-","支持定制":"是","质量保证期":"-","最小起订量":"1","支持试用":"是","发货周期":"48小时发货","适用酒店":"0-3星","材质":"化纤材质"}},"7907":{"id":"7907","name":"【红杉树】酒店北欧轻奢床尾巾","price":"32.0","sale":"已售56件","parent":"酒店布草","cat":"装饰布草"},"8021":{"id":"8021","name":"酒店墙布定制","price":"0.01","sale":"已售<10件","parent":"酒店布草","cat":"装饰布草"},"62089":{"id":"62089","name":"【叠发纺织】酒店简约英伦麻拼色床尾巾","price":"20.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"62093":{"id":"62093","name":"【叠发纺织】高支高密色织提花床尾床上床旗","price":"50.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"3091":{"id":"3091","name":"【红杉树】质感空间系列床尾巾","price":"25.0","sale":"已售293件 好评100%","parent":"酒店布草","cat":"装饰布草"},"62085":{"id":"62085","name":"【叠发纺织】酒店民族风波纹雪尼尔色织床尾巾","price":"22.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"62073":{"id":"62073","name":"【叠发纺织】酒店轻奢高级感雪尼尔色织提花床旗","price":"20.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"62071":{"id":"62071","name":"【叠发纺织】酒店床上用品床旗轻奢高级感床尾巾","price":"18.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"62083":{"id":"62083","name":"【叠发纺织】酒店简约风撞色拼接床尾巾","price":"18.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"63445":{"id":"63445","name":"全棉纯棉席巾餐巾布折花餐垫布加厚西餐中餐摆台","price":"15.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"62091":{"id":"62091","name":"【叠发纺织】酒店高档金丝线高精密床尾巾","price":"28.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"3099":{"id":"3099","name":"【红杉树】酒店时尚活力型床尾巾抱枕","price":"35.0","sale":"已售62件","parent":"酒店布草","cat":"装饰布草"},"62079":{"id":"62079","name":"【叠发纺织】酒店高级感雪尼尔色织床尾巾","price":"24.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"62075":{"id":"62075","name":"【叠发纺织】酒店轻奢高级感床尾垫床旗","price":"23.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"63497":{"id":"63497","name":"酒店西餐厅餐巾布口布白色擦杯布加厚折席巾口布缎面餐桌垫布色丁","price":"11.5","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"3105":{"id":"3105","name":"【红杉树】酒店高端奢华简约床旗抱枕","price":"38.0","sale":"已售125件 好评100%","parent":"酒店布草","cat":"装饰布草"},"63439":{"id":"63439","name":"酒店椅套弹力椅套加厚空气层连体椅套宴会椅套包脚套脚椅套","price":"23.9","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"10407":{"id":"10407","name":"【红杉树】民宿北欧风轻奢流苏款床盖巾","price":"39.0","sale":"已售159件","parent":"酒店布草","cat":"装饰布草"},"63441":{"id":"63441","name":"弹力椅套婚庆酒店椅套宴会加厚通用连体婚礼椅子罩椅子套","price":"19.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"7909":{"id":"7909","name":"【红杉树】酒店简约拼色床尾巾","price":"31.0","sale":"已售129件","parent":"酒店布草","cat":"装饰布草"},"7885":{"id":"7885","name":"【红杉树】酒店民宿特色针织盖毯","price":"48.5","sale":"已售110件","parent":"酒店布草","cat":"装饰布草"},"3089":{"id":"3089","name":"【红杉树】 纯色简约针织盖毯民宿高端床尾巾","price":"45.0","sale":"已售<10件","parent":"酒店布草","cat":"装饰布草"},"62097":{"id":"62097","name":"【叠发纺织】星级酒店宾馆民宿床尾巾轻奢高级感床尾垫","price":"40.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"63451":{"id":"63451","name":"婚礼婚庆酒店用品道具免系蝴蝶结弹力椅背扣花椅子套装饰","price":"6.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"63495":{"id":"63495","name":"餐垫西餐垫杯垫加厚装饰垫子酒店餐垫西餐垫桌子垫","price":"12.5","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"10405":{"id":"10405","name":"【红杉树】民宿高端波西米风格床盖床尾巾","price":"49.0","sale":"已售68件","parent":"酒店布草","cat":"装饰布草"},"62095":{"id":"62095","name":"【叠发纺织】简约风仿麻面料 色织提花床尾巾床旗抱枕","price":"40.0","sale":"90天已售<10件","parent":"酒店布草","cat":"装饰布草"},"63447":{"id":"63447","name":"【红杉树】酒店桌布防水棉麻台布","price":"65.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"63525":{"id":"63525","name":"【红杉树】酒店大圆桌布台简约防水桌布","price":"65.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"7887":{"id":"7887","name":"【红杉树】酒店轻奢波西米亚系列床尾巾","price":"51.0","sale":"已售56件","parent":"酒店布草","cat":"装饰布草"},"63443":{"id":"63443","name":"【红杉树】酒店裙桌裙棉麻大圆桌桌布","price":"152.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"63437":{"id":"63437","name":"【红杉树】酒店加厚高档桌布台布","price":"152.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"63435":{"id":"63435","name":"【红杉树】酒店圆形桌布双层台布","price":"152.0","sale":"本月上新","parent":"酒店布草","cat":"装饰布草"},"15863":{"id":"15863","name":"小米REDMI 智能电视 A75 75英寸 144Hz高刷 2+32GB L75","price":"2842.00","sale":"已售37件 好评100%","parent":"酒店设施","cat":"电器设备","params":{"品牌":"小米（MI）","箱规":"台","支持定制":"否","质量保证期":"1年质保","最小起订量":"1","支持试用":"否","发货周期":"7天内发货","适用酒店":"0-3星"}},"3706":{"id":"3706","name":"华科尚影酒店影院软件系统","price":"5.00","sale":"已售172件","parent":"酒店设施","cat":"电器设备","params":{"品牌":"华科尚影","箱规":"305*275*295MM","支持定制":"否","质量保证期":"3年","最小起订量":"1","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"718":{"id":"718","name":"【科瑞德】五星级同款高速负离子高转速吹风机","price":"268.00","sale":"已售1574件 好评100%","parent":"酒店设施","cat":"电器设备","params":{"品牌":"科瑞德","箱规":"10","支持定制":"否","质量保证期":"1年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-5星"}},"52001":{"id":"52001","name":"哈曼卡顿蓝牙桌面影院音响-琉璃5代-黑色","price":"2290.00","sale":"已售40件 好评100%","parent":"酒店设施","cat":"电器设备","params":{"品牌":"哈曼卡顿","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"666":{"id":"666","name":"【科瑞德】高星级酒店客房防干烧电热水壶","price":"60.0","sale":"已售5251件 好评100%","parent":"酒店设施","cat":"电器设备"},"69089":{"id":"69089","name":"【泊为】泊为FB-630酒店大功率强风速干直筒吹风机","price":"74.0","sale":"本月上新","parent":"酒店设施","cat":"电器设备"},"3171":{"id":"3171","name":"酒店大风力负离子恒温速干吹风机","price":"69.0","sale":"已售937件 好评97%","parent":"酒店设施","cat":"电器设备"},"11139":{"id":"11139","name":"【零声】零声高速迷你款酒店吹风机","price":"95.0","sale":"已售498件 好评100%","parent":"酒店设施","cat":"电器设备"},"69083":{"id":"69083","name":"【泊为】泊为B01负离子护发风筒大风力速干高速吹风机","price":"108.0","sale":"本月上新","parent":"酒店设施","cat":"电器设备"},"8273":{"id":"8273","name":"徕芬高速吹风机SE","price":"280.0","sale":"已售158件 好评100%","parent":"酒店设施","cat":"电器设备"},"717":{"id":"717","name":"【红杉树】酒店民宿客房电吹风机折叠款","price":"46.0","sale":"已售1113件 好评100%","parent":"酒店设施","cat":"电器设备"},"8231":{"id":"8231","name":"徕芬高速吹风机SElite","price":"185.0","sale":"已售3536件 好评100%","parent":"酒店设施","cat":"电器设备"},"805":{"id":"805","name":"【科瑞德】五星级酒店客房高档吹风机大风力","price":"60.0","sale":"已售3311件 好评100%","parent":"酒店设施","cat":"电器设备"},"4709":{"id":"4709","name":"创维（SKYWORTH）全高清酒店功能无界智慧屏网络电视机","price":"93.0","sale":"已售226件 好评100%","parent":"酒店设施","cat":"电器设备"},"63355":{"id":"63355","name":"TCL 6.5KG波轮洗衣机 XQB65-D01 灰色","price":"540.0","sale":"本月上新","parent":"酒店设施","cat":"电器设备"},"4643":{"id":"4643","name":"美的 FSA25UB 电风扇","price":"127.0","sale":"已售69件 好评100%","parent":"酒店设施","cat":"电器设备"},"14125":{"id":"14125","name":"米家小米电吹风负离子静音护发速干吹风机H300家用学生宿舍送女友生日礼物过节自营","price":"103.0","sale":"已售180件 好评100%","parent":"酒店设施","cat":"电器设备"},"63357":{"id":"63357","name":"TCL 高洗净L2R波轮7KG洗衣机 B70L2R","price":"602.0","sale":"本月上新","parent":"酒店设施","cat":"电器设备"},"4206":{"id":"4206","name":"【QMDQ】酒店壁挂防盗吹风机","price":"50.0","sale":"已售2082件 好评100%","parent":"酒店设施","cat":"电器设备"},"10963":{"id":"10963","name":"Xiaomi无线键鼠套装2","price":"99.0","sale":"已售337件 好评100%","parent":"酒店设施","cat":"电器设备"},"63363":{"id":"63363","name":"TCL抗菌V2W波轮8KG洗衣机 B80V2W","price":"649.0","sale":"本月上新","parent":"酒店设施","cat":"电器设备"},"664":{"id":"664","name":"【科瑞德】1.2L科瑞德星级酒店热水壶","price":"47.0","sale":"已售747件 好评100%","parent":"酒店设施","cat":"电器设备"},"11587":{"id":"11587","name":"小米米家智能空气净化器","price":"599.0","sale":"已售23件 好评100%","parent":"酒店设施","cat":"电器设备"},"63359":{"id":"63359","name":"TCL洁净护衣L2W波轮9KG洗衣机B90L2W","price":"722.0","sale":"本月上新","parent":"酒店设施","cat":"电器设备"},"4602":{"id":"4602","name":"美的 EP2C35 新国标插座插线板","price":"25.0","sale":"已售4983件 好评100%","parent":"酒店设施","cat":"电器设备"},"10729":{"id":"10729","name":"TCL10公斤洗烘一体机","price":"1599.0","sale":"已售16件","parent":"酒店设施","cat":"电器设备"},"21153":{"id":"21153","name":"瑞艾尔等离子体空气净化器、明净系列净化灯（快速除异味、消毒杀菌）","price":"1100.0","sale":"已售<10件","parent":"酒店设施","cat":"电器设备"},"3169":{"id":"3169","name":"【奥泊美】双层防烫烧水壶自动断电电水壶","price":"48.0","sale":"已售975件 好评97%","parent":"酒店设施","cat":"电器设备"},"8735":{"id":"8735","name":"志高（CHIGO）58L小型迷你小冰箱冰吧","price":"525.0","sale":"已售95件 好评100%","parent":"酒店设施","cat":"电器设备"},"59857":{"id":"59857","name":"小米（MI）REDMI电视 MAX 100英寸 2026【送装一体服务】 288","price":"1568.0","sale":"90天已售<10件","parent":"酒店设施","cat":"电器设备"},"1607":{"id":"1607","name":"【红杉树】酒店连锁同款高速大风力吹风机","price":"118.0","sale":"已售2427件 好评98%","parent":"酒店设施","cat":"电器设备"},"36381":{"id":"36381","name":"米家小米波轮洗衣机全自动小型家用出租房宿舍脱水机 8公斤一级能效羊毛洗以旧换新X","price":"684.0","sale":"90天已售<10件 好评100%","parent":"酒店设施","cat":"电器设备"},"25635":{"id":"25635","name":"超霸（GP）7号电池10粒七号碳性干电池适用于低耗电玩具/耳温枪/血氧仪/血压计","price":"9.1","sale":"已售45件 好评100%","parent":"酒店设施","cat":"电器设备"},"6373":{"id":"6373","name":"艾美特 落地扇 LPF07","price":"142.0","sale":"已售10件","parent":"酒店设施","cat":"电器设备"},"8811":{"id":"8811","name":"海尔体重秤QHU9","price":"45.0","sale":"已售96件 好评100%","parent":"酒店设施","cat":"电器设备"},"11263":{"id":"11263","name":"润本（RUNBEN）电蚊香 驱蚊液120晚大容量45ml×4瓶+1器防蚊定时无香","price":"32.6","sale":"已售56件","parent":"酒店设施","cat":"电器设备"},"15479":{"id":"15479","name":"TCL空调京东联名真省电大1.5匹新一级能效 外机单排纯铜管 变频挂机冷暖KFR","price":"1661.0","sale":"已售25件 好评100%","parent":"酒店设施","cat":"电器设备"},"715":{"id":"715","name":"GMDQ宾馆客房专用1300w壁挂式电吹风","price":"50.0","sale":"已售1485件 好评100%","parent":"酒店设施","cat":"电器设备"},"14297":{"id":"14297","name":"格力（GREE）【负离子清新空气】小凉神易拆洗遥控电风扇塔扇节能轻音低噪家用塔式","price":"199.0","sale":"已售21件","parent":"酒店设施","cat":"电器设备"},"11589":{"id":"11589","name":"小米米家电风扇 一级能效","price":"219.0","sale":"已售32件","parent":"酒店设施","cat":"电器设备"},"59157":{"id":"59157","name":"小米 巨省电大风口 26款 3匹柜机 一级能效 外机双排纯铜管 72LW-PL3","price":"1999.0","sale":"90天已售<10件","parent":"酒店设施","cat":"电器设备"},"5607":{"id":"5607","name":"美菱电热水壶MH-K68A保温（珠光白）","price":"56.0","sale":"已售1197件 好评100%","parent":"酒店设施","cat":"电器设备"},"57943":{"id":"57943","name":"向物-制冷高速风扇-引擎ice Z","price":"109.0","sale":"已售15件 好评100%","parent":"酒店设施","cat":"电器设备"},"14259":{"id":"14259","name":"米家小米电热水壶N1烧水壶煮水壶家用 食品级304不锈钢 1500W快速加热 自","price":"72.7","sale":"已售66件 好评100%","parent":"酒店设施","cat":"电器设备"},"25613":{"id":"25613","name":"南孚爱掌门智能门锁专用电池5号8粒 适用于小米鹿客凯迪仕TCL德施曼鹿客华为等电","price":"12.2","sale":"已售125件 好评100%","parent":"酒店设施","cat":"电器设备"},"26007":{"id":"26007","name":"奥克斯（AUX）取暖器/电暖器/电暖气家用/取暖电器/电暖气暖风机电暖风热风机电","price":"92.0","sale":"90天已售<10件","parent":"酒店设施","cat":"电器设备"},"57523":{"id":"57523","name":"向物（SOTHING）制冷手持风扇-ice 09 【冰敷制冷丨5档调节】3000","price":"79.0","sale":"90天已售<10件","parent":"酒店设施","cat":"电器设备"},"14293":{"id":"14293","name":"美的（Midea）【变频轻音】空气循环扇家用遥控电风扇四季净化扇静音落地扇99%","price":"107.0","sale":"已售14件","parent":"酒店设施","cat":"电器设备"},"2377":{"id":"2377","name":"【红杉树】连锁同款高速吹风机大功率风机","price":"118.0","sale":"已售4万件 好评100%","parent":"酒店设施","cat":"电器设备"},"11557":{"id":"11557","name":"小米空调巨省电/睡眠系列1P/1.5P/2P/3P","price":"2099.0","sale":"已售21件","parent":"酒店设施","cat":"电器设备"},"663":{"id":"663","name":"【红杉树】酒店民宿高端鹅颈嘴电热水壶","price":"88.0","sale":"已售797件 好评100%","parent":"酒店设施","cat":"电器设备"},"4655":{"id":"4655","name":"美的 OXD-WD12G 灭蚊灯","price":"89.0","sale":"已售125件 好评97%","parent":"酒店设施","cat":"电器设备"},"53095":{"id":"53095","name":"韶音（SHOKZ）舒适圈OpenFit2+开放式蓝牙耳机T921","price":"1051.0","sale":"90天已售<10件","parent":"酒店设施","cat":"电器设备"},"8549":{"id":"8549","name":"小米对讲机2S","price":"269.0","sale":"已售77件 好评100%","parent":"酒店设施","cat":"电器设备"},"23835":{"id":"23835","name":"奥克斯（AUX）高速护发吹风机50亿等离子家用负离子大功率不伤发电吹风机大风力中","price":"143.0","sale":"已售12件","parent":"酒店设施","cat":"电器设备"},"18435":{"id":"18435","name":"容声【京·东风系列】电风扇家用落地扇台地两用七叶机械大风量摇头风扇卧室节能柔风扇","price":"61.8","sale":"已售18件","parent":"酒店设施","cat":"电器设备"},"4758":{"id":"4758","name":"海尔（Haier）抽湿机/除湿器 12L/天 轻音防霉","price":"580.0","sale":"已售62件 好评100%","parent":"酒店设施","cat":"电器设备"},"5401":{"id":"5401","name":"Midea美的微波炉20L","price":"340.0","sale":"已售630件 好评100%","parent":"酒店设施","cat":"电器设备"},"8325":{"id":"8325","name":"小米 米家智能除湿机13L","price":"749.0","sale":"已售17件","parent":"酒店设施","cat":"电器设备"},"7389":{"id":"7389","name":"【零声】零声酒店客房高速吹风机大功率","price":"105.0","sale":"已售1746件 好评100%","parent":"酒店设施","cat":"电器设备"},"4805":{"id":"4805","name":"毕亚兹 QJ-150 拖把","price":"40.00","sale":"已售4286件 好评100%","parent":"酒店设施","cat":"保洁用品","params":{"品牌":"毕亚兹","箱规":"1","支持定制":"否","质量保证期":"0","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-5星"}},"4223":{"id":"4223","name":"超宝特效洁厕剂 洁厕灵大桶装马桶杀菌除臭","price":"14.00","sale":"已售4462件 好评100%","parent":"酒店设施","cat":"保洁用品","params":{"品牌":"超宝","箱规":"1桶","支持定制":"否","质量保证期":"2年","最小起订量":"1桶","支持试用":"否","发货周期":"3天内发货","适用酒店":"2-4星"}},"67621":{"id":"67621","name":"酒店清洁剂专用大压力手枪喷头手压大流量3毫升消毒清洁喷雾器4oz","price":"9.00","sale":"本月上新","parent":"酒店设施","cat":"保洁用品","params":{"品牌":"无","箱规":"1","支持定制":"否","质量保证期":"3","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-4星"}},"915":{"id":"915","name":"赫斯顿 细纤维抹布 35*70cm毛巾抹布","price":"4.50","sale":"已售1457件 好评100%","parent":"酒店设施","cat":"保洁用品","params":{"品牌":"赫斯顿","箱规":"1","支持定制":"否","质量保证期":"1年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"2-4星"}},"4225":{"id":"4225","name":"超宝洗手液大桶装 酒店宾馆办公洗手补充液","price":"16.5","sale":"已售607件 好评100%","parent":"酒店设施","cat":"保洁用品"},"68585":{"id":"68585","name":"康星厨房除油剂油烟机清洗剂厨房去油污神器","price":"19.0","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"31099":{"id":"31099","name":"净佰俐空气清新剂3瓶装（柠檬+茉莉+栀子花香型）空气清新喷雾剂套装","price":"29.0","sale":"已售79件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4878":{"id":"4878","name":"蓝月亮茉莉清香洁净洗衣液3kg*1桶","price":"45.99","sale":"已售276件 好评100%","parent":"酒店设施","cat":"保洁用品"},"67713":{"id":"67713","name":"乐柏美酒店宾馆商用手柄刷硬毛刷地板刷排刷熨斗刷清洁刷","price":"22.8","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"4488":{"id":"4488","name":"强力洁厕剂","price":"50.0","sale":"已售255件 好评100%","parent":"酒店设施","cat":"保洁用品"},"9547":{"id":"9547","name":"【红杉树】酒店多功能手推布草车","price":"310.0","sale":"已售29件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4434":{"id":"4434","name":"乐康八四消毒液次氯酸钠消毒液","price":"28.0","sale":"已售<10件","parent":"酒店设施","cat":"保洁用品"},"33661":{"id":"33661","name":"斧头牌（AXE）地板清洁剂2L 茉莉清香 瓷砖实木地板通用","price":"21.6","sale":"已售34件 好评100%","parent":"酒店设施","cat":"保洁用品"},"44617":{"id":"44617","name":"超宝（CHAOBAO）C-084 塑料刻度喷壶 消毒清洁酒精喷雾壶浇花 颜色随机","price":"6.5","sale":"已售110件 好评100%","parent":"酒店设施","cat":"保洁用品"},"67393":{"id":"67393","name":"华住同款康星全能清洁剂去污清洁全能水","price":"36.0","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"4762":{"id":"4762","name":"超宝挤水型马桶刷 厕刷恭刷贡刷酒店宾馆软毛马桶刷","price":"4.0","sale":"已售975件 好评100%","parent":"酒店设施","cat":"保洁用品"},"44627":{"id":"44627","name":"超宝全能清洁剂中性3.8升大瓶装 地板地面瓷砖多用途清洗液全能水","price":"24.3","sale":"已售19件 好评100%","parent":"酒店设施","cat":"保洁用品"},"67397":{"id":"67397","name":"华住同款康星澄净多功能清洁除油剂酒店餐厅地面浓缩免过水桌面清洁去油污","price":"49.0","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"4227":{"id":"4227","name":"超宝玻璃清洁剂 大桶装玻璃专用强力清洁玻璃水","price":"16.0","sale":"已售674件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4260":{"id":"4260","name":"超宝A字形告示牌 塑料警示牌 不准泊车 小心地滑等","price":"12.0","sale":"已售2063件 好评100%","parent":"酒店设施","cat":"保洁用品"},"69557":{"id":"69557","name":"【洁仕】玻璃清洁剂（小包装）","price":"63.0","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"9745":{"id":"9745","name":"乐柏美微纤拖把 平板拖把 客房拖把18英寸","price":"38.0","sale":"已售342件 好评100%","parent":"酒店设施","cat":"保洁用品"},"33931":{"id":"33931","name":"利得白色垃圾袋平口宾馆酒店客房一次性透明加厚小号45*50cm3.2g500只垃","price":"29.2","sale":"已售98件 好评100%","parent":"酒店设施","cat":"保洁用品"},"69603":{"id":"69603","name":"【洁仕】84消毒液（小包装）","price":"70.0","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"4916":{"id":"4916","name":"南洋乳胶手套黄色1双","price":"4.39","sale":"已售581件 好评100%","parent":"酒店设施","cat":"保洁用品"},"33649":{"id":"33649","name":"净佰俐 84消毒液5L漂白大桶装家用商用八四环境消毒水衣物含氯清洁剂","price":"28.4","sale":"已售43件 好评100%","parent":"酒店设施","cat":"保洁用品"},"69585":{"id":"69585","name":"【洁仕】皎洁王（小包装）","price":"79.0","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"6601":{"id":"6601","name":"超宝全能清洁剂(中性配方)","price":"15.0","sale":"已售972件 好评100%","parent":"酒店设施","cat":"保洁用品"},"854":{"id":"854","name":"美国进口 威莱克斯 EXODOR安舒 植物液空气除臭剂 喷瓶直喷装","price":"118.0","sale":"已售253件 好评100%","parent":"酒店设施","cat":"保洁用品"},"70229":{"id":"70229","name":"【洁仕】JaeSve®抗菌洗手液","price":"94.5","sale":"本月上新","parent":"酒店设施","cat":"保洁用品"},"4230":{"id":"4230","name":"超宝静电吸尘埃剂 尘推油 地板干拖静电吸附剂","price":"50.0","sale":"已售30件","parent":"酒店设施","cat":"保洁用品"},"4487":{"id":"4487","name":"消毒辟味剂","price":"220.0","sale":"已售26件 好评100%","parent":"酒店设施","cat":"保洁用品"},"42375":{"id":"42375","name":"立白小白白衣领净顽渍喷雾300g去油去渍不伤衣衣物渗透剂见效迅速","price":"18.6","sale":"已售12件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4523":{"id":"4523","name":"全能清洁剂","price":"200.0","sale":"已售62件 好评100%","parent":"酒店设施","cat":"保洁用品"},"2636":{"id":"2636","name":"地毯除渍剂","price":"65.0","sale":"已售79件 好评100%","parent":"酒店设施","cat":"保洁用品"},"9543":{"id":"9543","name":"【红杉树】加厚不锈钢客房布草收纳车","price":"195.0","sale":"已售35件 好评100%","parent":"酒店设施","cat":"保洁用品"},"42003":{"id":"42003","name":"武洁 84消毒液4kg大桶含氯消毒剂漂白水消毒水卫生间房间马桶消毒","price":"18.5","sale":"已售12件","parent":"酒店设施","cat":"保洁用品"},"7845":{"id":"7845","name":"蓝月亮 洗衣液10斤套装 机洗2kg*1+1kg*2+500g*2+80g*2 ","price":"99.0","sale":"已售24件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4226":{"id":"4226","name":"超宝浴室清洁剂 水盆瓷砖淋浴房浴缸马桶专用清洁剂","price":"23.0","sale":"已售859件 好评100%","parent":"酒店设施","cat":"保洁用品"},"7249":{"id":"7249","name":"雅成 抹布35cm*60cm蓝色","price":"3.69","sale":"已售151件","parent":"酒店设施","cat":"保洁用品"},"7241":{"id":"7241","name":"雅成 抹布35cm*60cm红色","price":"3.69","sale":"已售181件","parent":"酒店设施","cat":"保洁用品"},"2622":{"id":"2622","name":"玻璃清洁剂1加仑","price":"62.0","sale":"已售134件 好评100%","parent":"酒店设施","cat":"保洁用品"},"7977":{"id":"7977","name":"赛莫诗 一次性多用途丁晴手套","price":"0.3","sale":"已售8000件","parent":"酒店设施","cat":"保洁用品"},"842":{"id":"842","name":"超宝 玻璃刮","price":"8.0","sale":"已售401件 好评100%","parent":"酒店设施","cat":"保洁用品"},"858":{"id":"858","name":"超宝 长柄扫把","price":"9.5","sale":"已售152件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4262":{"id":"4262","name":"超宝标准型尘推 大堂除尘平板拖把代替扫帚 多尺寸选择","price":"22.5","sale":"已售159件 好评100%","parent":"酒店设施","cat":"保洁用品"},"913":{"id":"913","name":"赫斯顿 细纤维抹布 35*35cm抹布 毛巾","price":"3.5","sale":"已售726件 好评100%","parent":"酒店设施","cat":"保洁用品"},"34347":{"id":"34347","name":"宏达批发宏达消毒粉学校医院酒店饭堂公共场所灭菌400克宏达消毒粉","price":"190.0","sale":"90天已售<10件","parent":"酒店设施","cat":"保洁用品"},"42019":{"id":"42019","name":"威猛先生（Mr Muscle） 甲流感防范 尼帕病毒防范 84消毒液500g 除","price":"5.6","sale":"已售84件","parent":"酒店设施","cat":"保洁用品"},"857":{"id":"857","name":"威莱克斯 EXODOR 异味源除臭剂 源头除臭","price":"380.0","sale":"已售18件 好评100%","parent":"酒店设施","cat":"保洁用品"},"61943":{"id":"61943","name":"Ecolab/艺康优易低泡地毯清洁剂","price":"100.1","sale":"90天已售<10件","parent":"酒店设施","cat":"保洁用品"},"34299":{"id":"34299","name":"威露士空调清洗消毒液500ml 清洗剂喷雾杀菌除螨【特惠优选】","price":"30.5","sale":"已售30件","parent":"酒店设施","cat":"保洁用品"},"35005":{"id":"35005","name":"汰渍全效洁净洗衣皂柠檬116g*4块温和去渍不伤手肥皂透明皂无磷配方","price":"8.4","sale":"90天已售<10件","parent":"酒店设施","cat":"保洁用品"},"1491":{"id":"1491","name":"豪华型超静音吸尘机","price":"998.0","sale":"已售159件 好评97%","parent":"酒店设施","cat":"保洁用品"},"4233":{"id":"4233","name":"超宝宝而亮特强清洁乳 洁而亮 水龙头陶瓷砖玻璃强力去污剂","price":"6.0","sale":"已售129件 好评100%","parent":"酒店设施","cat":"保洁用品"},"867":{"id":"867","name":"3M 42#红色加厚型清洁用百洁布","price":"28.0","sale":"已售110件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4232":{"id":"4232","name":"超宝泡沫洗手液 大瓶补充装 宾馆酒店商用补充液","price":"18.0","sale":"已售254件 好评100%","parent":"酒店设施","cat":"保洁用品"},"4234":{"id":"4234","name":"超宝全能清洁剂(碱性配方) 多功能清洁剂 地面台面有效去污","price":"15.0","sale":"已售753件 好评100%","parent":"酒店设施","cat":"保洁用品"},"865":{"id":"865","name":"超宝 浴缸刷","price":"2.7","sale":"已售718件 好评100%","parent":"酒店设施","cat":"保洁用品"},"34947":{"id":"34947","name":"Little seal日本魔术扫把刮水拖地两用硅胶卫生间浴室大号地板刮拖把扫水神","price":"46.3","sale":"90天已售<10件","parent":"酒店设施","cat":"保洁用品"},"31879":{"id":"31879","name":"京东京造 户外折叠椅便携月亮椅露营椅子沙滩椅钓鱼椅折叠凳子中号沙色","price":"57.00","sale":"90天已售<10件 好评100%","parent":"酒店设施","cat":"公区设施","params":{"品牌":"京东京造","箱规":"张","质量保证期":"3个月质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"3329":{"id":"3329","name":"凯玛仕抗菌洗手液（泡沫）","price":"19.00","sale":"已售120件","parent":"酒店设施","cat":"公区设施","params":{"品牌":"凯玛仕","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"24397":{"id":"24397","name":"尚烤佳（Suncojia）无烟烧烤碳果木炭烧烤炭火锅围炉煮茶取暖烤肉苹果木炭原木","price":"27.90","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施","params":{"品牌":"尚烤佳（Suncojia）","箱规":"盒","质量保证期":"1个月质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"27129":{"id":"27129","name":"楚戎 野餐用品A5密胺白色碗汤碗饭碗粥碗塑料斜纹碗 6英寸斜纹碗","price":"9.50","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施","params":{"品牌":"楚戎","箱规":"个","质量保证期":"1个月质保","最小起订量":"10","发货周期":"7天内发货","适用酒店":"0-3星"}},"54197":{"id":"54197","name":"特步（XTEP）哑铃男女杠铃健身器材组合可调节拆卸家用举重训练套装亚玲10KG*","price":"99.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54159":{"id":"54159","name":"匹克（PEAK）筋膜枪按摩器肩颈腰背按摩仪肌颈膜枪专业级迷你便携式健身肌肉放松父","price":"84.2","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53425":{"id":"53425","name":"宏太护腰坐垫腰靠垫座椅靠背垫腰一体式人体工学支撑矫姿腰托靠背 029折叠款坐姿垫","price":"99.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"35001":{"id":"35001","name":"乐往户外露营烧烤炉野炊木碳烤炉野营烤肉架携折叠烧烤架中号","price":"49.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54171":{"id":"54171","name":"yottoy哑铃 男女健身家用小哑铃可调节重量器材儿童练臂肌哑铃","price":"60.4","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53447":{"id":"53447","name":"西屋炭围炉 户外铸铁煮茶壶","price":"199.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53419":{"id":"53419","name":"宏太（HongTai）六角女士哑铃家用健身瑜伽浸塑包胶瘦手臂实心铸铁男士哑铃","price":"59.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"43197":{"id":"43197","name":"曼迪卡威（Mdikawe）蹦蹦床室内家用婴幼儿童玩耍1-2-3-6-10岁宝宝跳","price":"347.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"66323":{"id":"66323","name":"晟凯旋工地施工线透明尼龙线工程施工线捆扎线打包线白色大柱鱼线0.6mm","price":"4.8","sale":"本月上新","parent":"酒店设施","cat":"公区设施"},"54151":{"id":"54151","name":"Keep哑铃女男健身家用彩色浸塑环保手铃亚铃全身塑形水蓝2kg*2","price":"69.4","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54149":{"id":"54149","name":"李宁（LI-NING）计数握力器练手力男士可调节康复腕力球儿童训练手臂锻炼健身器","price":"36.9","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54169":{"id":"54169","name":"Keep跳绳成年人燃脂减肥专用精钢轴承小学生考试专用健身-黑色","price":"19.9","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"34987":{"id":"34987","name":"尚烤佳（Suncojia）304不锈钢烤网烧烤炉便携家用烧烤架户外木炭烧烤网碳烤","price":"71.6","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54157":{"id":"54157","name":"京东京造 俯卧撑训练板 便携俯卧撑支架家用健身器材 肌肉训练辅助器","price":"72.2","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"31891":{"id":"31891","name":"京东京造 烧烤竹签260支 一次性烧烤签子羊肉串烤串穿肉签子25cm","price":"10.4","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24209":{"id":"24209","name":"京东京造 户外双人吊床 露营便携收纳防侧翻降落伞布结实高承重成人秋千","price":"72.2","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"35125":{"id":"35125","name":"京东京造 户外露营收纳箱 可折叠衣服玩具整理箱车载储物箱 木盖款大号48L","price":"75.2","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"10333":{"id":"10333","name":"趣游帮 折叠款100L野营营地推车YB01 PLUS","price":"125.0","sale":"已售<10件","parent":"酒店设施","cat":"公区设施"},"27107":{"id":"27107","name":"Aoran不锈钢烤鱼炉木炭酒精碳烤炉商用餐厅家用烤鱼盘 40*30","price":"73.7","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"65795":{"id":"65795","name":"NHZHIW皮手套 长度60厘米防咬手套宠物防猫狗防抓","price":"26.4","sale":"本月上新","parent":"酒店设施","cat":"公区设施"},"54201":{"id":"54201","name":"诚悦彩色浸塑哑铃男女士家庭用健身塑型器材组合套装4kg*2浅蓝CY-529","price":"117.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24219":{"id":"24219","name":"骆驼（CAMEL）防侧翻吊床户外双人秋千室内家用庭院吊网床","price":"84.3","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54147":{"id":"54147","name":"Keep俯卧撑训练板多功能便携支架辅助器材家用健身练胸腹肌肉专业版","price":"78.5","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24405":{"id":"24405","name":"岩谷（Iwatani）喷枪 1.85kW 大火力户外烧烤喷火器烘焙料理 烧猪毛喷","price":"93.7","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"34995":{"id":"34995","name":"尚烤佳（Suncojia）户外木炭烧烤炉烧烤架家用碳烤炉便携可折叠烤串炉烤肉架烧","price":"59.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53417":{"id":"53417","name":"宏太（HongTai）软壶铃女士健身家用练翘臀神器男士运动塑形深蹲提壶器材","price":"99.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"32289":{"id":"32289","name":"TANXIANZHE探险者烤火炉户外庭院烤火盆烧烤架取暖炉室内烧烤炉家用围炉煮茶","price":"61.1","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24399":{"id":"24399","name":"尚烤佳（Suncojia） 速燃烧烤木炭 球形烧烤碳 围炉煮茶炭 果木炭 环保无","price":"27.4","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"35003":{"id":"35003","name":"尚烤佳（Suncojia）烧烤炉烧烤架电炭两用围炉煮茶炉烤羊肉串炉木碳煎烤炉30","price":"147.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"27121":{"id":"27121","name":"战仞者 1.0厚304不锈钢份数盆餐盆食堂餐厅分菜盆盛菜盆食物分餐盒方形打菜盆-","price":"93.7","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"41025":{"id":"41025","name":"尚烤佳（Suncojia）户外露营帐篷 户外公园帐篷 露营帐篷 速开全自动帐篷2","price":"136.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54189":{"id":"54189","name":"诚悦电镀哑铃杠铃15公斤男女士运动健身器材可调节拆卸组合套装CY-066","price":"199.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54167":{"id":"54167","name":"Keep软壶铃女士健身家用8kg提壶哑铃提臀塑形练手臂减肥奶茶色8公斤","price":"106.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24417":{"id":"24417","name":"牧高笛（MOBIGARDEN）寒霜22L保温箱 户外露营大容量储物收纳保鲜箱 N","price":"177.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"41047":{"id":"41047","name":"京东京造蝶形涂银15平户外露营六角天幕帐篷遮阳棚野餐防晒防雨凉棚4-6人","price":"154.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"32287":{"id":"32287","name":"探险者（TAN XIAN ZHE）电陶炉围炉煮茶套装家用户外电炭两用烤火炉烧烤炉","price":"186.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"28197":{"id":"28197","name":"京东京造【6层黑胶真防晒】蝶形天幕15平户外露营装备遮阳防雨凉棚5-7人","price":"184.0","sale":"已售0件","parent":"酒店设施","cat":"公区设施"},"41029":{"id":"41029","name":"骆驼（CAMEL）户外精致露营黑胶天幕帐篷遮阳便携式防晒野营大凉棚1J32263","price":"196.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24401":{"id":"24401","name":"探险者（TAN XIAN ZHE）卡式炉户外露营炉具便携式野外火锅炉子防风套装燃","price":"67.4","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54185":{"id":"54185","name":"诚悦电镀哑铃杠铃30公斤男女士运动健身器材可调节拆卸组合套装CY-160","price":"410.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54173":{"id":"54173","name":"PROIRON普力艾 浸塑磨砂哑铃男女士健身哑铃套装家用哑铃3/5/8磅+哑铃架","price":"223.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"65837":{"id":"65837","name":"三叶豆 防动物抓咬手套 加长加厚训狗驯蛇宠物手套 宠物店用防护手套","price":"154.0","sale":"本月上新","parent":"酒店设施","cat":"公区设施"},"28221":{"id":"28221","name":"骆驼（CAMEL）逍遥系列露营自动帐篷户外便携式折叠野营天幕遮阳棚133BANA","price":"274.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54153":{"id":"54153","name":"京东京造 跳绳成人儿童中学生专业中考试有绳跳神健身体育器材 黑色","price":"16.5","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54165":{"id":"54165","name":"PROIRON普力艾 哑铃男环保浸塑女士家用健身器材六角纯铁哑铃 8KG一对装","price":"235.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54161":{"id":"54161","name":"京东京造 计数握力器 练臂力训练 可调节手指康复锻炼 健身器材家用5-60KG","price":"20.6","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24385":{"id":"24385","name":"牧高笛（MOBIGARDEN）便携水袋 户外露营储水袋带水龙头手提大容量 NX2","price":"20.6","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24181":{"id":"24181","name":"京东京造 户外露营车折叠推车营地车野餐摆摊快递买菜小拉车拖车沙石色","price":"120.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"41041":{"id":"41041","name":"尚烤佳（Suncojia）天幕 防晒防水幕布 户外大尺寸黑胶天幕 遮阳棚 露营棚","price":"254.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54199":{"id":"54199","name":"诚悦彩色浸塑哑铃男女士家庭用健身塑型器材组合套装10kg*2黑灰CY-533","price":"259.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24439":{"id":"24439","name":"火枫（FIRE-MAPLE）擎天分体式大气炉头 户外炉具露营装备烧烤卡式气罐燃气","price":"284.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"41049":{"id":"41049","name":"探险者（TAN XIAN ZHE）黑胶天幕帐篷户外露营超大防晒遮阳棚便携式露营装","price":"274.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54187":{"id":"54187","name":"PROIRON普力艾 哑铃男健身家用可调节纯铁20KG家用杠铃+配35厘米连接杆","price":"268.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"41021":{"id":"41021","name":"牧高笛（MOBIGARDEN）天幕 户外露营防雨遮阳防晒牛津布方形天幕410 N","price":"274.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24427":{"id":"24427","name":"岩谷（Iwatani）户外双重防风卡式炉火锅便携炉露营燃气炉3.5kW强劲火力限","price":"323.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54175":{"id":"54175","name":"京东京造单杠 引体向上杆单杠家用健身器材成人儿童免打孔室内运动96-120","price":"80.5","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"41037":{"id":"41037","name":"沃特曼户外迷彩遮阳棚篷应急隔离帐篷伸缩式雨棚停车棚遮阳伞烧烤庭院","price":"399.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24393":{"id":"24393","name":"京东京造 果木炭 烧烤木炭碳火烤肉围炉煮茶取暖木炭烧烤碳 6斤","price":"45.3","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24383":{"id":"24383","name":"尚烤佳（Suncojia）户外不锈钢烧烤炉便携可折叠烧烤架木炭烤炉大号碳烤炉烤羊","price":"102.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"23367":{"id":"23367","name":"沃特曼户外桌椅折叠桌椅套装蛋卷桌长桌轻量便携式摆摊5件套围炉煮茶","price":"143.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24391":{"id":"24391","name":"火枫（FIRE-MAPLE）饕餮套装户外炉炊具自驾露营全套装备野炊大功率气炉4-","price":"632.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54177":{"id":"54177","name":"PROIRON普力艾 哑铃女士健身家用哑铃儿童小哑铃健身套装 果绿色2kg*2","price":"57.6","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53423":{"id":"53423","name":"宏太（HongTai）家用磁控静音健身单车动感单车","price":"999.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53443":{"id":"53443","name":"西屋户外豪享套装","price":"399.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53445":{"id":"53445","name":"西屋坦克轮大号营地车/迷你营地车","price":"199.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"43631":{"id":"43631","name":"Keep专业健腹轮自动回弹智能计数四轮腹肌轮卷腹训练器健身器材冰川灰","price":"159.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"42483":{"id":"42483","name":"舒华（SHUA）x6i高端家用跑步机商用智能走步机健身房运动减肥SH-T6700","price":"11463.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53421":{"id":"53421","name":"宏太（HongTai）软板跑步机家用款小型健身房专用可折叠健身器材走步机","price":"3499.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"42763":{"id":"42763","name":"米家（MIJIA）小米动感单车家用50W大功率自发电磁控调阻小米自行车JSC01","price":"1789.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53415":{"id":"53415","name":"宏太（HongTai）按摩椅按摩器材按摩全身 蓝牙音乐T1-9F","price":"3999.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53411":{"id":"53411","name":"宏太（HongTai）按摩椅按摩器材按摩全身 蓝牙音乐 5S","price":"3599.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"24191":{"id":"24191","name":"京东京造【600斤承重】聚拢型户外露营车折叠推车摆摊快递拉车拖车石墨黑","price":"210.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"42837":{"id":"42837","name":"特步（XTEP）单杠家用引体向上器室内单双杠多功能综合训练器成人健身器材","price":"578.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"53413":{"id":"53413","name":"宏太（HongTai）按摩椅按摩器材刮痧揉捏按摩带显示屏款A1-68","price":"4299.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54293":{"id":"54293","name":"xmlook户外帐篷3*3M/420Dpvc牛津布重18kg/ 定制颜色30顶起","price":"315.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"54287":{"id":"54287","name":"xmlook 户外帐篷3*3M/420D银胶防晒涂层重20kg/ 定制颜色30顶","price":"357.0","sale":"90天已售<10件","parent":"酒店设施","cat":"公区设施"},"64203":{"id":"64203","name":"装修设计施工咨询","price":"1.00","sale":"本月上新","parent":"酒店设施","cat":"装修装饰","params":{"品牌":"紫悦之光","质量保证期":"2年","最小起订量":"1","适用酒店":"3-5星"}},"68735":{"id":"68735","name":"助点酒店客房物资","price":"1.00","sale":"本月上新","parent":"酒店设施","cat":"装修装饰","params":{"品牌":"助点","质量保证期":"2年","最小起订量":"1","适用酒店":"3-5星"}},"21111":{"id":"21111","name":"工吏 奶油风小茶几 客厅家用小户型现代简易茶桌 双层120*60*42原木色","price":"367.00","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰","params":{"品牌":"工吏","箱规":"件","质量保证期":"1年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"34649":{"id":"34649","name":"殿下法式复古实木餐边柜客厅靠墙茶水柜中古风沙发边柜美式收纳储物柜","price":"2773.00","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰","params":{"品牌":"殿下","箱规":"台","质量保证期":"3年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"63333":{"id":"63333","name":"格诺瓦电脑椅子办公舒适久坐护腰靠背办公座椅【加固款】黑色海绵坐垫","price":"135.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"14219":{"id":"14219","name":"黎明 电脑椅办公椅子网布弓形椅职员椅培训会议椅弓架靠背椅子JYZ-08","price":"168.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"68747":{"id":"68747","name":"慧庭装饰","price":"1.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"63949":{"id":"63949","name":"钱柜会议椅学生椅培训椅无扶手餐椅组装款家用椅子弓形椅(3把起发)","price":"146.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"20655":{"id":"20655","name":"树浩床边桌可移动升降电脑桌客厅沙发边几折叠书桌卧室家用床上学习桌","price":"97.9","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"14495":{"id":"14495","name":"法果办公椅舒适久坐电脑椅家用会议室职员椅旋转椅子 716 白框黑网","price":"198.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"54429":{"id":"54429","name":"瑞仕达（Restar）折叠床午休午睡床神器月嫂床单人床酒店加床拼接对折海绵床90","price":"557.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"24449":{"id":"24449","name":"中伟（ZHONGWEI）办公椅职员电脑椅会议转椅简约升降皮椅家用舒适久坐人体工学","price":"599.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"15529":{"id":"15529","name":"兰谦办公桌椅组合老板桌简约现代办公室员工位职员桌子台式电脑桌家用","price":"330.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"68341":{"id":"68341","name":"帝麦尔 实木床上下铺双层床儿童子母床成人上下床双人床120/150*190cm","price":"1988.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"21387":{"id":"21387","name":"麦森 学习桌折叠培训员工会议桌大长条桌子 1.4米加厚款枫木色 MS-ZDZ","price":"210.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"52747":{"id":"52747","name":"森拉堡（Senrop）办公椅 家用电脑椅弓形椅职员椅培训会议椅网布椅黑色","price":"206.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"23803":{"id":"23803","name":"信京办公椅电脑椅会议椅职员椅学习椅人体工学椅子网椅升降转椅含头枕","price":"220.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"23315":{"id":"23315","name":"兰冉 网布办公椅电脑椅职员椅弓形会议椅子弓形办公椅 D820【黑色】","price":"231.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"14083":{"id":"14083","name":"兰冉 职员椅办公椅弓形会议椅家用背靠网布电脑椅子 L系列黑色","price":"231.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"58375":{"id":"58375","name":"杜沃 上下床全实木上下铺双层高低子母床儿童成年双人床90/120CM","price":"1770.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"21971":{"id":"21971","name":"久韵会议椅办公椅四脚木质椅麻将椅培训椅棋牌室椅子","price":"253.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"19093":{"id":"19093","name":"黎明 JLBG12弓形椅会议椅办公椅学习洽谈椅网布弓架电脑椅59*60*94cm","price":"315.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"14589":{"id":"14589","name":"鑫亚森优宿舍会议培训方凳餐凳教室凳工作凳钢木小方凳铁凳子（ 白色）","price":"75.8","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"55161":{"id":"55161","name":"钢信钢木办公桌学习电脑桌家用学生写字桌卧室长条桌子简易书桌1.2米","price":"274.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"54235":{"id":"54235","name":"威飞百电脑椅会议椅职员椅学习椅 办公椅常规网椅","price":"296.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"19005":{"id":"19005","name":"喜木来培训椅子带桌板折叠带写字板白色办公会议室桌椅 椅子-1127","price":"285.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"14235":{"id":"14235","name":"中伟（ZHONGWEI）人体工学椅网布椅电脑椅现代简约椅洽谈办公椅职员椅转椅","price":"294.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"69639":{"id":"69639","name":"恒鑫锐楚可折叠书桌电脑桌简易书桌学习办公弹簧桌单层长80CM*宽50CM*74C","price":"106.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"18287":{"id":"18287","name":"晋立达家用移动小茶桌茶台茶车茶盘茶水柜 升级胡桃色泡茶柜+盖板","price":"202.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"51397":{"id":"51397","name":"宜率 可移动茶台茶桌客厅边柜家用边茶几中式茶水柜一体阳台茶车","price":"336.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"33755":{"id":"33755","name":"梦麦斯屏风商务楼层学校公共卫生间隔断16mm三氢板+尼龙配件（每平米)","price":"344.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"70045":{"id":"70045","name":"弘雅韵床箱","price":"1000.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"35033":{"id":"35033","name":"洛来宝 长条凳换鞋凳室内软包长凳子长板凳健身房浴室更衣凳 80*35*45cm","price":"293.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"58763":{"id":"58763","name":"意米之恋进口橡胶木北欧全实木茶几客厅小户型茶桌家用方桌 1m*0.5m CJ-0","price":"389.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"15453":{"id":"15453","name":"格诺瓦职工电脑桌台式办公桌现代带抽屉 140cm五抽一门深胡桃【可定制】","price":"409.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"54027":{"id":"54027","name":"黎乘 棉纱手套耐磨防滑工地干活毛纺手套 灯罩棉500g 单位：双","price":"1.4","sale":"已售50件","parent":"酒店设施","cat":"装修装饰"},"18907":{"id":"18907","name":"颂泰（SONGTAI）办公椅会议椅洽谈椅椅子 常规","price":"425.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"70049":{"id":"70049","name":"弘雅韵床箱","price":"895.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"21687":{"id":"21687","name":"森拉堡（Senrop）办公椅网椅 经理椅 转椅 职员椅 家用电脑椅","price":"364.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"24291":{"id":"24291","name":"苡茉鞋架家用门口多层简易鞋帽一体鞋柜宿舍出租屋置物收纳架子3层60","price":"39.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"20421":{"id":"20421","name":"中伟（ZHONGWEI）电脑椅办公椅职员网椅会议椅弓形椅子家用椅子培训椅","price":"378.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"56745":{"id":"56745","name":"钱柜家用组装款实木吧台椅前台靠背椅高脚凳北欧创意酒吧椅坐高72cm","price":"231.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"52603":{"id":"52603","name":"格诺瓦客厅茶几客厅茶桌钢化玻璃茶几办公室会客极简轻奢小桌子140cm","price":"314.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"29321":{"id":"29321","name":"JEEP折叠床躺椅办公室午休床单人床午休折叠椅陪护床行军床加厚棉垫","price":"314.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"24463":{"id":"24463","name":"中伟（ZHONGWEI）电脑椅办公椅升降转椅职员办公椅人体工学靠背会议培训椅","price":"327.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"21791":{"id":"21791","name":"金戈安办公椅老板椅人体工学电脑椅可躺靠背培训椅职员椅家用会议椅","price":"174.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"21473":{"id":"21473","name":"吉盛达弓形办公椅舒适久坐电脑椅会议椅会客椅 黑色弓形椅","price":"169.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"14257":{"id":"14257","name":"洛来宝可折叠培训椅办公椅会议椅职员学习椅电脑椅 无写字板","price":"95.8","sale":"已售30件","parent":"酒店设施","cat":"装修装饰"},"18565":{"id":"18565","name":"晟励 塑料凳户外凳会议凳换鞋凳培训凳","price":"19.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"63083":{"id":"63083","name":"大匠传成 掼蛋桌象棋桌活动室打牌桌子扑克桌象棋款88cm GDZ-8","price":"288.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"59413":{"id":"59413","name":"昌益德木制会议椅将军椅耳朵椅洽谈椅电脑椅办公椅培训椅子（2把起发）","price":"293.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"63345":{"id":"63345","name":"吉盛达折叠桌便携桌简易长方形电脑桌 黑胡桃-长120宽60高75","price":"159.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"33511":{"id":"33511","name":"雅美乐超薄鞋柜门口入户柜 翻斗鞋柜收纳柜一体靠墙 楼道家用封闭式鞋架","price":"207.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"67227":{"id":"67227","name":"焊斧（HANAXE）办公家具办公室用会客沙发商务接待简约皮扶手沙发配套方茶几","price":"525.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"14399":{"id":"14399","name":"法果办公椅舒适久坐人体工学椅电脑椅子可躺职员椅座椅 683转椅灰色","price":"589.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"52511":{"id":"52511","name":"中伟茶桌新中式实木茶桌简约茶台客厅家用阳台泡茶桌椅组合-单桌1.4米","price":"741.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"19405":{"id":"19405","name":"宜率 高低架床上下铺床双层床儿童床实木床双人床多功能组合床","price":"5.3","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"58573":{"id":"58573","name":"ZLIII 办公桌电脑桌工作台油漆仿实木桌1.2m中抽款（E1级贴纸皮）","price":"522.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"62897":{"id":"62897","name":"中伟（ZHONGWEI）电脑桌台式简易书桌现代简约钢木办公桌120*50cm","price":"440.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"33775":{"id":"33775","name":"AEY新中式竹屏风客厅卧室遮挡隔断墙折叠移动屏风 180*50cm四扇","price":"452.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"15497":{"id":"15497","name":"分界线 边几 边桌茶几沙发边柜置物架加厚边几小桌子双层置物简易床头柜","price":"69.4","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"68333":{"id":"68333","name":"LINSY KIDS林氏家居儿童床实木可拆上下床上下铺子母床LH064 1.5米","price":"5030.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"58501":{"id":"58501","name":"泽慕儿童上下床双层上下铺一体榉木家用儿童床1.5*2米实木床#ZM12","price":"6781.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"51673":{"id":"51673","name":"首力战神 奶油风茶几极简客厅加厚碳钢底小户型现代简约茶几可移动白组合","price":"451.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"14749":{"id":"14749","name":"安尔雅凳子家用可叠放小凳子板凳矮凳餐桌圆凳带脚垫六腿厚坐垫 灰绒布","price":"33.1","sale":"已售31件","parent":"酒店设施","cat":"装修装饰"},"54421":{"id":"54421","name":"全品屋折叠床单人办公室午休沙发床家用简易月嫂陪护床酒店加厚海绵床","price":"525.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"14077":{"id":"14077","name":"华恺之星 加厚塑料凳家用 大号凳子小板凳防滑换鞋凳子YK09中国结红色","price":"34.6","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"14027":{"id":"14027","name":"华恺之星加厚塑料凳家用小凳子矮凳餐椅浴室凳小圆凳换鞋凳 咖色小圆凳","price":"18.9","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"67103":{"id":"67103","name":"HiBoss 办公椅会议椅网布电脑椅弓形椅职员班前椅灰白色YZ-32","price":"619.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"18511":{"id":"18511","name":"BKT 人体工学护腰坐姿椅护腰坐垫一体坐姿椅 加大版摩卡黑（带坐套）","price":"207.0","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"19243":{"id":"19243","name":"华恺之星凳子 家用简约铁艺餐椅 加厚钢筋板凳餐凳高凳圆凳子HK5129电镀灰","price":"41.1","sale":"已售<10件","parent":"酒店设施","cat":"装修装饰"},"24293":{"id":"24293","name":"安尔雅简易鞋架门口多层宿舍家用收纳立式省空间分层隔板鞋柜 暖白8层","price":"42.6","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"24353":{"id":"24353","name":"小匠材鞋架简易小型门口多层家用鞋柜宿舍出租屋收纳置物架六层","price":"111.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"64129":{"id":"64129","name":"妍苒办公桌电脑桌领导老板桌工位工作台木皮款120*60*75cm","price":"484.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"63977":{"id":"63977","name":"中伟（ZHONGWEI）人体工学椅办公椅电脑椅职员椅职员黑框带脚踏可躺升级款3级","price":"472.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"29239":{"id":"29239","name":"奥凯弗折叠床躺椅办公室午休椅单人床午睡椅陪护床户外行军床含加厚棉垫","price":"177.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"62957":{"id":"62957","name":"麦森（MAISEN）折叠椅 简约时尚办公会议培训靠背椅电脑椅加厚款MS-ZDY-","price":"147.0","sale":"90天已售<10件","parent":"酒店设施","cat":"装修装饰"},"67191":{"id":"67191","name":"安迪泰 定制不锈钢办公桌电脑工作台两斗无柜门 长1.2米一台价","price":"764.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"64229":{"id":"64229","name":"麦森maisen职员办公桌老板桌简约现代主管经理电脑抽屉桌员工办公室桌椅组合","price":"820.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"64045":{"id":"64045","name":"焊斧（HANAXE）木质油漆办公桌带抽屉木质书桌写字桌台式职员财务电脑桌1.6m","price":"842.0","sale":"本月上新","parent":"酒店设施","cat":"装修装饰"},"31827":{"id":"31827","name":"京东京造 钛铁炒锅 锤纹不粘健康无涂层圆底燃气灶电磁炉通用32cm","price":"167.00","sale":"90天已售<10件","parent":"酒店设施","cat":"餐厨用品","params":{"品牌":"京东京造","箱规":"箱","质量保证期":"1年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"17823":{"id":"17823","name":"小米电饭煲 电饭锅C1 迷你电饭煲小 24H智能预约 蒸屉（适用2-6人） 米家","price":"178.00","sale":"已售17件 好评100%","parent":"酒店设施","cat":"餐厨用品","params":{"品牌":"米家","箱规":"个","质量保证期":"1年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"69745":{"id":"69745","name":"双枪（Suncha）不锈钢牛排刀叉勺西餐餐具加厚加长餐刀勺子叉子三件套刀组合","price":"16.80","sale":"本月上新","parent":"酒店设施","cat":"餐厨用品","params":{"品牌":"双枪（Suncha）","箱规":"盒","质量保证期":"无质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"56841":{"id":"56841","name":"启航雅居 三八节伴手礼品玻璃杯礼品套装 创意实用营销礼品可定制logo 玻璃杯+","price":"36.90","sale":"90天已售<10件","parent":"酒店设施","cat":"餐厨用品","params":{"品牌":"启航雅居（QIHANG）","箱规":"套","质量保证期":"无质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"32605":{"id":"32605","name":"巨博（JOBO）商用A8密胺调羹汤勺 喝汤勺子 仿瓷小勺子1个装","price":"2.2","sale":"已售130件","parent":"酒店设施","cat":"餐厨用品"},"63485":{"id":"63485","name":"豫宙高端酒店杯垫酒吧杯垫吸水纸杯垫 一次性杯垫100个（直径10cm）","price":"69.8","sale":"本月上新","parent":"酒店设施","cat":"餐厨用品"},"51323":{"id":"51323","name":"物生物 450ml茗香保温钛杯 烟墨灰","price":"230.0","sale":"90天已售<10件","parent":"酒店设施","cat":"餐厨用品"},"4196":{"id":"4196","name":"双耳长方形铸铁深煎盘","price":"310.0","sale":"已售25件","parent":"酒店设施","cat":"餐厨用品"},"24371":{"id":"24371","name":"拾画陶瓷小饭勺汤勺小勺子5只装 弯把调羹勺家用酒店纯白餐勺","price":"11.6","sale":"已售15件","parent":"酒店设施","cat":"餐厨用品"},"31825":{"id":"31825","name":"京东京造 平底锅 煎锅无涂层煎蛋牛排烤盘早餐平底燃气【进口极铁】26cm","price":"79.4","sale":"90天已售<10件","parent":"酒店设施","cat":"餐厨用品"},"44433":{"id":"44433","name":"丹诗致远 黑色合金筷子酒店餐厅食堂筷子耐高温筷子 竹编纹24cm1双","price":"0.7","sale":"已售102件","parent":"酒店设施","cat":"餐厨用品"},"26331":{"id":"26331","name":"韵之和碗具碗碟套装家用2026新款高颜值餐具整套装景德镇乔迁礼物","price":"425.0","sale":"90天已售<10件","parent":"酒店设施","cat":"餐厨用品"},"69147":{"id":"69147","name":"凤凰 20寸7速双碟刹折叠自行车辐条轮长征-消光灰","price":"599.00","sale":"本月上新","parent":"酒店设施","cat":"康养运动","params":{"品牌":"凤凰","箱规":"1","支持定制":"否","质量保证期":"一年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"69143":{"id":"69143","name":"凤凰 20寸山地自行车辐条轮贝塔puls","price":"525.00","sale":"本月上新","parent":"酒店设施","cat":"康养运动","params":{"品牌":"凤凰","箱规":"1","支持定制":"否","质量保证期":"一年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"69141":{"id":"69141","name":"凤凰 21速26寸辐条轮霸王龙山地自行车","price":"678.00","sale":"本月上新","parent":"酒店设施","cat":"康养运动","params":{"品牌":"凤凰","箱规":"1","支持定制":"否","质量保证期":"一年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"10367":{"id":"10367","name":"趣游帮 露营折叠月亮椅 Y38","price":"49.00","sale":"已售26件 好评100%","parent":"酒店设施","cat":"后勤耗材","params":{"品牌":"趣游帮","箱规":"/","支持定制":"否","质量保证期":"/","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"10347":{"id":"10347","name":"趣游帮 户外露营便携折叠桌椅三件套Y703","price":"125.00","sale":"已售31件 好评100%","parent":"酒店设施","cat":"后勤耗材","params":{"品牌":"趣游帮","箱规":"/","支持定制":"否","质量保证期":"/","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"10363":{"id":"10363","name":"趣游帮 免安装折叠烧烤炉 Y03","price":"59.00","sale":"已售185件 好评100%","parent":"酒店设施","cat":"后勤耗材","params":{"品牌":"趣游帮","箱规":"/","支持定制":"否","质量保证期":"/","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"4477":{"id":"4477","name":"挪客 食光迷你卡式炉CNH22CJ011","price":"169.00","sale":"已售46件 好评100%","parent":"酒店设施","cat":"后勤耗材","params":{"品牌":"挪客","箱规":"8个/箱 51*48*28","支持定制":"否","质量保证期":"2年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-5星"}},"4481":{"id":"4481","name":"挪客（凌越）PP折叠收纳箱NH20SJ036","price":"168.0","sale":"已售14件 好评100%","parent":"酒店设施","cat":"后勤耗材"},"4480":{"id":"4480","name":"挪客（凌沃）可折叠圆形水桶NH20SJ040","price":"35.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"10351":{"id":"10351","name":"趣游帮 60L迷你款露营户外营地推车YB06","price":"33.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"10357":{"id":"10357","name":"趣游帮 便携免安装碳钢合金折叠克米特椅 Y37","price":"25.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"6341":{"id":"6341","name":"晨光(M&G) 0.5mm办公用中性笔 按动签字笔 12支/盒","price":"37.0","sale":"已售23件 好评100%","parent":"酒店设施","cat":"后勤耗材"},"6345":{"id":"6345","name":"晨光 办公凤尾夹彩色大中小号 混装42个/筒","price":"26.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4482":{"id":"4482","name":"挪客 信封带帽可水洗棉睡袋NH20MSD02","price":"132.0","sale":"已售11件","parent":"酒店设施","cat":"后勤耗材"},"6335":{"id":"6335","name":"晨光(M&G)单头黑色记号笔 油性马克笔 10支/盒","price":"23.1","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4479":{"id":"4479","name":"挪客 印花图案野餐垫NH21FCD01","price":"115.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4478":{"id":"4478","name":"挪客 超轻秋千吊床NH21DC011","price":"68.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4475":{"id":"4475","name":"挪客（星简）户外折叠蛋卷桌NH19JJ009","price":"420.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4476":{"id":"4476","name":"挪客 户外铝合金折叠桌NH16Z016","price":"228.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"11413":{"id":"11413","name":"海尔兄弟 折叠桌椅组合","price":"210.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"6383":{"id":"6383","name":"晨光（M&G） 高透明封箱胶布胶条 48mm 6卷/筒","price":"78.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"10913":{"id":"10913","name":"驿客露营天幕（银胶-米白色）EKH-9018","price":"169.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"11315":{"id":"11315","name":"海尔兄弟天幕 BHMO1","price":"148.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4484":{"id":"4484","name":"挪客 户外套餐一","price":"520.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"11177":{"id":"11177","name":"海尔兄弟 折叠车","price":"205.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"6337":{"id":"6337","name":"晨光(M&G) 双头细杆记号笔 12支/盒","price":"31.5","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"11417":{"id":"11417","name":"海尔兄弟 帐篷 BHP01","price":"260.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"11411":{"id":"11411","name":"海尔兄弟 野餐垫 BHD01","price":"88.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4490":{"id":"4490","name":"挪客 户外套餐三","price":"850.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"4491":{"id":"4491","name":"挪客 户外套餐四","price":"1090.0","sale":"已售<10件","parent":"酒店设施","cat":"后勤耗材"},"42853":{"id":"42853","name":"GJIROL 国际电工插卡取电开关酒店三线延时取电器民宿40A任意卡刻字开关面板","price":"36.00","sale":"已售32件","parent":"酒店设施","cat":"水电暖通","params":{"品牌":"国际电工（SERNICNE）","箱规":"个","质量保证期":"1个月质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"15677":{"id":"15677","name":"米家小米自动香氛机2白色套装 柏木青茶香氛液 天然植萃精油 自然清新 定制香氛","price":"153.00","sale":"已售17件 好评100%","parent":"酒店设施","cat":"水电暖通","params":{"品牌":"米家（MIJIA）","箱规":"个","质量保证期":"1年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"63687":{"id":"63687","name":"全季酒店4.0\\5.0花洒手持三档按键淋浴手喷","price":"36.40","sale":"本月上新","parent":"酒店设施","cat":"水电暖通","params":{"品牌":"全季同款","箱规":"1","支持定制":"否","质量保证期":"无","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"22155":{"id":"22155","name":"日常元素【柏木青茶】2代香氛液 定制香氛 天然精油配方 大容量封闭式设计 适配米","price":"42.00","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通","params":{"品牌":"日常元素","箱规":"盒","质量保证期":"3年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"42897":{"id":"42897","name":"国际电工（FDD） 86型扩展式插座 厨房拓展多孔转换器轨道插座无线插排 86原","price":"30.4","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"34321":{"id":"34321","name":"智国者车载灭火器水基小型私家庭汽轿车商专用便携式国家消防3c认证器材","price":"22.6","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"42027":{"id":"42027","name":"准航车载灭火器水基家用小型汽轿车商2026新国标便携式国家消防3c认证","price":"21.5","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"69773":{"id":"69773","name":"创佳取电开关","price":"70.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"44731":{"id":"44731","name":"洪湖26新国标3C认证家用商用消防年检大货车专用手提式干粉灭火器4kg","price":"69.3","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"42025":{"id":"42025","name":"火焰战士车载灭火器水基灭火器家用新能源汽车国标消防3C认证21B环保620ml","price":"23.6","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66843":{"id":"66843","name":"鸣固烟雾报警器 消防3c认证独立烟感报警器消防火灾探测器免布线","price":"26.4","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"34353":{"id":"34353","name":"烈火先锋25年新国标干粉灭火器4公斤*2灭火箱子组合MF/ABCE4套装消防商用","price":"163.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"62779":{"id":"62779","name":"酒店宾馆民宿专用【防拆】防爆花洒淋浴耐高温PVC软管通用防漏管","price":"6.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"35699":{"id":"35699","name":"飞利浦（PHILIPS）充电台灯家用充插两用护眼台灯宿舍床头学习台灯小雅5200","price":"346.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"67041":{"id":"67041","name":"海得曼无线门铃多彩炫光自发电家用一键静音呼叫器一拖二 奶油风","price":"166.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"33785":{"id":"33785","name":"援邦车载水基灭火器980ml水基型灭火器国家消防3C认证小型灭水器980ml","price":"37.3","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"44735":{"id":"44735","name":"援邦（YUANBANG）25新国标4KG商家用住宅干粉灭火器4公斤消防3c认证京","price":"59.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"42021":{"id":"42021","name":"绿消25新国标商用干粉灭火器4公斤国家消防3c认证京东自营家用4kg车载","price":"61.6","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"67683":{"id":"67683","name":"小米（MI）小背包 10L 深蓝色 多场景适用舒适不勒肩 无惧雨水泼溅","price":"29.5","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66775":{"id":"66775","name":"海曼（HEIMAN）海曼家用燃气报警器家用厨房饭店可燃天然气燃气泄漏消防报警器","price":"219.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"19853":{"id":"19853","name":"小米门窗传感器2 智能感知门窗开合 手机同步推送 状态语音播报 光照感知 接入米","price":"47.4","sale":"已售<10件","parent":"酒店设施","cat":"水电暖通"},"33787":{"id":"33787","name":"援邦灭火器水基型家用商用店用大货车用3L水基灭火器可灭电火新国标","price":"56.7","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"33531":{"id":"33531","name":"星浙安 干粉主链接","price":"83.1","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66965":{"id":"66965","name":"施耐德电气 选择开关 两位自锁 短柄 1常开","price":"16.5","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"33969":{"id":"33969","name":"中瑾新国标灭火器手提式水基型器材国家消防3C认证家用商用灭火瓶3L电","price":"59.8","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"67015":{"id":"67015","name":"海得曼（advent）无线门铃家用室内机313单独接收器（不可单独使用需配对FL","price":"34.7","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"67105":{"id":"67105","name":"太樾 车载香薰 智能车载沉香香薰器（一代）典雅灰","price":"207.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66901":{"id":"66901","name":"小米（MI）智能天然气卫士 远程报警 天然气报警器","price":"163.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66753":{"id":"66753","name":"保时安（BAOSHIAN）便携式气体采样泵泵吸式检测仪数显充电式外置泵 ZC60","price":"209.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66885":{"id":"66885","name":"保时安（BAOSHIAN）点型工业天然气商用气体泄漏浓度监测仪报警器GTYQ-D","price":"315.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66751":{"id":"66751","name":"保时安（BAOSHIAN）可燃气体检测仪检漏仪天然气燃气甲烷液化气煤气泄漏报警器","price":"337.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66859":{"id":"66859","name":"海曼（HEIMAN）水浸卫士检测自动感应报警器漏水水位传感器远程报警涂鸦网关","price":"79.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"15207":{"id":"15207","name":"公牛（BULL）智能台灯 国AA级防蓝光 无极调光 防近视认证 无可视频闪 学生","price":"93.7","sale":"已售<10件","parent":"酒店设施","cat":"水电暖通"},"33555":{"id":"33555","name":"绿消商用手提式二氧化碳灭火器3KG消防器材机房精密仪器3公斤配电箱","price":"189.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66759":{"id":"66759","name":"凌防（LFang）GY-LF-811 燃气报警器商用餐饮煤气罐液化石油气工业丙烷","price":"242.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"61907":{"id":"61907","name":"小米充电宝 10000mAh 22.5W 移动电源 双向快充 多口输出 适用小米","price":"75.8","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"33855":{"id":"33855","name":"绿消25新国标手提式干粉灭火器4公斤消防器材商用4kg*2+箱组合套装","price":"198.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"65967":{"id":"65967","name":"OLOIU儿童花洒喷头手持宠物小花洒套装 婴儿花洒止水一体塑芯电镀款*2","price":"85.7","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66861":{"id":"66861","name":"凌防（LFang）SN-801 一氧化碳报警器CO探测器煤炉烧炭警报器蜂窝煤气体","price":"78.1","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66763":{"id":"66763","name":"小米烟感卫士2 火灾烟雾报警器 远程提醒【新国标认证】 智能联动","price":"174.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"35697":{"id":"35697","name":"小米（MI）充插两用台灯 防蓝光高色显 无可视频闪 快充长续航 米家用宿舍卧室床","price":"136.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"58897":{"id":"58897","name":"小米充电宝 10000mAh 22.5W 移动电源 苹果20W充电 双向快充 多","price":"75.8","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"43619":{"id":"43619","name":"海曼（HEIMAN）水浸卫士检测自动感应报警器漏水水位传感器远程报警涂鸦网关","price":"73.1","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"33569":{"id":"33569","name":"援邦（YUANBANG）25新国标水基型3L家用灭火器国家消防3c认证京东自营商","price":"62.7","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"33517":{"id":"33517","name":"淮海干粉灭火器4公斤手提式灭火水器国家消防3c认证商用家用 MF/ABCE4","price":"67.4","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"42029":{"id":"42029","name":"火焰战士 灭火器车载家车用干粉灭火器便携新能源消防器材1A21B增强型610G","price":"37.1","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"19701":{"id":"19701","name":"凌防 烟雾报警器独立烟感探测器无线烟雾感应器家用消防火灾浓烟警报","price":"37.0","sale":"已售<10件","parent":"酒店设施","cat":"水电暖通"},"28513":{"id":"28513","name":"小米（MI）智能家居（MIJIA）台灯2 智能学习阅读台灯卧室儿童读写护眼灯小米","price":"198.0","sale":"已售14件","parent":"酒店设施","cat":"水电暖通"},"66841":{"id":"66841","name":"凌防（LFang）SA-A82-Y 吸烟探测仪烟雾探测报警器办公室洗手卫生间禁烟","price":"478.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66711":{"id":"66711","name":"凌防（LFang）PS-817 烟雾报警器独立烟感探测器家用无线3C消防火灾浓烟","price":"39.2","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66803":{"id":"66803","name":"PGST一氧化碳报警器CO感应煤炉烧炭蜂窝煤气烟雾报警器PA-008","price":"111.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"65883":{"id":"65883","name":"佳雁电线电缆KVVR 3*2.5平方国标阻燃三芯电源线多股铜丝软护套线1米","price":"10.6","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"24017":{"id":"24017","name":"engue恩谷三色护眼智能台灯EG-529 触屏操控 三档调光（白金色）","price":"72.7","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66769":{"id":"66769","name":"浙安广消国标烟雾报警器3C认证独立烟感器家庭火灾警报器消防验收家用商用","price":"24.3","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"52499":{"id":"52499","name":"公牛（BULL）智能护眼台灯【充插两用】无极触控调光 1500Ah长续航 3档色","price":"72.7","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"44739":{"id":"44739","name":"兴安消防便携灭火弹 灭火球水基型灭火弹投掷式应急灭火逃生弹","price":"79.6","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66767":{"id":"66767","name":"PGST燃气报警器天然气报警器煤气泄漏报警家用厨房天然气检测器 R03","price":"32.4","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"15085":{"id":"15085","name":"联想E20 指纹锁 智能门锁 民宿公寓 密码锁 入户门 智能锁 家用 防盗门 电","price":"348.0","sale":"已售<10件","parent":"酒店设施","cat":"水电暖通"},"67005":{"id":"67005","name":"领普科技无线门铃G2 远距离家用自发电不用电池老人呼叫器防水 一拖一","price":"67.6","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66997":{"id":"66997","name":"海得曼（Advent）门铃不用电池自发电无线门铃防水家用呼叫器FL-313","price":"69.8","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"55473":{"id":"55473","name":"华为智选鸿蒙智选哈尔斯保温杯智能弹盖款2 450ml水杯覆钛男女学生送礼伴手礼 ","price":"126.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66747":{"id":"66747","name":"保时安（BAOSHIAN） 彩屏气体检测仪检漏仪天然气液化气煤气泄漏报警器","price":"493.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66973":{"id":"66973","name":"唐安烟雾报警器国标3C认证独立式烟感报警器家用火灾警报消防器材","price":"13.6","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"67027":{"id":"67027","name":"希崖欢迎光临感应器进门叮咚语音播报提示器超市商店门口迎宾门铃","price":"40.1","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66919":{"id":"66919","name":"京玺 烟雾报警器 国标3C认证家庭消防验收火灾警报消防器材烟感报警器","price":"24.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66961":{"id":"66961","name":"施耐德电气 选择开关 三位自锁 短柄 2常开","price":"20.7","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"67039":{"id":"67039","name":"大洪欢迎光临感应器进门店铺语音提示迎宾器超市门铃报警器","price":"42.1","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"67001":{"id":"67001","name":"大洪DH220大洪欢迎光临感应器进门店铺感应门铃无线分体式迎宾器商店","price":"49.5","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66855":{"id":"66855","name":"京玺 一氧化碳报警器家用防中毒厨房烧煤泄漏探测消防报警器","price":"44.7","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66953":{"id":"66953","name":"保时安（BAOSHIAN）不联网独立式220V无需布线插电直接用GTY-B60S","price":"512.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66723":{"id":"66723","name":"dahua大华天然气漏气泄露家用厨房WiFi无屏甲烷燃气探测报警器GA4FA","price":"109.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66721":{"id":"66721","name":"凌防（LFang）WD8-NB门磁报警器手机远程通知家用门窗店铺门窗防盗器防贼门","price":"109.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66995":{"id":"66995","name":"凌防（LFang）免插电门铃无线门铃家用防水远距离老人呼叫器 1按钮+1接收器","price":"98.4","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"66825":{"id":"66825","name":"PGSTwifi烟雾报警器家庭企业消防烟感火灾探测手机远程报警器","price":"97.6","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"15553":{"id":"15553","name":"ENGUE恩谷EG-529无级调光三色护眼台灯白色","price":"87.4","sale":"已售<10件","parent":"酒店设施","cat":"水电暖通"},"66883":{"id":"66883","name":"保时安（BAOSHIAN）BTY-S100可燃气体测漏仪天然气煤气甲烷丙烷泄露检","price":"630.0","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"28255":{"id":"28255","name":"小米智能温湿度计3mini 室内温度计家用温度湿度计传感器","price":"39.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"66727":{"id":"66727","name":"凌防（LFang）SF18C 门磁报警器门窗防盗报警器家用店铺无线遥控防盗器","price":"53.2","sale":"本月上新","parent":"酒店设施","cat":"水电暖通"},"28505":{"id":"28505","name":"欧普照明（OPPLE）国AAAA级护眼台灯【专业防眩光】无蓝光护视力 4挡调光 ","price":"105.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"28477":{"id":"28477","name":"小米 米家智能床头灯2【语音调光 通体发光】早安唤醒 炫彩柔光 自由调节 多功能","price":"210.0","sale":"90天已售<10件","parent":"酒店设施","cat":"水电暖通"},"977":{"id":"977","name":"乐柏美 浴缸垫（中号57x36cm）美国原装进口 浴室防滑垫Rubbermaid","price":"35.00","sale":"已售785件 好评92%","parent":"酒店设施","cat":"基础建材","params":{"品牌":"乐柏美","箱规":"12片/箱","支持定制":"否","质量保证期":"3年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-4星"}},"7551":{"id":"7551","name":"A130S酒店门锁酒店锁刷卡门锁刷卡锁IC卡门锁IC卡锁联网门锁联网锁","price":"599.00","sale":"已售40件 好评100%","parent":"酒店设施","cat":"基础建材","params":{"品牌":"火河","箱规":"以实际发货为准","支持定制":"否","质量保证期":"1年","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"0-3星"}},"18187":{"id":"18187","name":"连锁酒店同款智能马桶","price":"669.00","sale":"已售<10件","parent":"酒店设施","cat":"基础建材","params":{"品牌":"红凯","箱规":"1","质量保证期":"1","最小起订量":"1","发货周期":"3天内发货","适用酒店":"2-4星"}},"69775":{"id":"69775","name":"创佳开门卡","price":"3.80","sale":"本月上新","parent":"酒店设施","cat":"基础建材","params":{"品牌":"创佳","箱规":"50","支持定制":"否","质量保证期":"5","最小起订量":"50","支持试用":"否","适用酒店":"0-3星"}},"69885":{"id":"69885","name":"创佳电梯控制器 （含刷卡器，电源，控制器","price":"2300.0","sale":"本月上新","parent":"酒店设施","cat":"基础建材"},"69767":{"id":"69767","name":"创佳门锁8089","price":"245.0","sale":"本月上新","parent":"酒店设施","cat":"基础建材"},"69883":{"id":"69883","name":"创佳门禁","price":"1700.0","sale":"本月上新","parent":"酒店设施","cat":"基础建材"},"69769":{"id":"69769","name":"创佳门锁8085","price":"325.0","sale":"本月上新","parent":"酒店设施","cat":"基础建材"},"40825":{"id":"40825","name":"恒洁（HEGII）智能马桶H5Pro(26版)感应翻盖泡沫盾带水箱DCE717B","price":"2997.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"28467":{"id":"28467","name":"雷士（NVC）次日达吸顶灯客厅大灯简约奶油风LED照明灯饰卧室灯餐厅白雪1","price":"255.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"31913":{"id":"31913","name":"京东京造U1 Pro 卧室吸顶灯D450全光谱智能护眼吸顶灯三防灯","price":"279.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24363":{"id":"24363","name":"海尔（Haier）智能马桶盖即热暖风系列 四季温感全自动坐便盖1级水效 新款52","price":"1019.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"31909":{"id":"31909","name":"京东京造U1 Pro 客厅吸顶灯 全光谱智能护眼灯已接入米家APP","price":"579.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"66459":{"id":"66459","name":"维亿曼极光星空投影灯天花板氛围灯满天星壁灯灯光装饰卧室酒吧灯","price":"92.7","sale":"本月上新","parent":"酒店设施","cat":"基础建材"},"11603":{"id":"11603","name":"小米米家智能门锁","price":"799.0","sale":"已售<10件","parent":"酒店设施","cat":"基础建材"},"27127":{"id":"27127","name":"好工邦 灭蚊灯 家用餐厅商场灭蝇灯 8w 单位：台","price":"59.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24551":{"id":"24551","name":"嗨灯 led明装吊线筒射灯餐厅过道商场吊灯 白色 吊线1M 7W 暖光","price":"48.2","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24345":{"id":"24345","name":"恒洁（HEGII）马桶盖板 通用加厚缓降坐便器盖板普通马桶圈厕所配件 V型款E0","price":"118.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"32313":{"id":"32313","name":"公牛（BULL）LED灯泡球泡灯 E27螺口球泡灯 9W球泡白光（日光色）650","price":"12.6","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"32309":{"id":"32309","name":"FSL佛山照明LED球泡10W大口节能灯泡E27明珠三代日光色6500K","price":"6.5","sale":"已售10件","parent":"酒店设施","cat":"基础建材"},"32307":{"id":"32307","name":"正泰（CHNT）led大功率灯泡飞碟灯节能E27螺口球泡家用商用36W正白光","price":"35.6","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40897":{"id":"40897","name":"美的（Midea）LED小夜灯卧室伴睡床头灯宿舍过道起夜灯室内布置氛围灯节日礼物","price":"9.8","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40845":{"id":"40845","name":"科勒（KOHLER）智能马桶ST30座圈加热离座自动静音冲水除菌包安装305坑距","price":"5142.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"20277":{"id":"20277","name":"恩谷多功能万年历台灯白色","price":"144.0","sale":"已售<10件","parent":"酒店设施","cat":"基础建材"},"40853":{"id":"40853","name":"东芝（TOSHIBA）智能马桶小海豚A415全域U型感应自动翻圈翻盖305mm【","price":"4144.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40859":{"id":"40859","name":"松下（Panasonic）智能马桶家用泡沫盾低水压停电冲X7 300mm","price":"2999.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24349":{"id":"24349","name":"小牧卫浴智能马桶盖 即热清洗暖风烘干抗菌座圈加热S3智能坐便盖 京东安装","price":"558.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"28491":{"id":"28491","name":"欧普（OPPLE） 吸顶灯客厅大灯可调色LED照明护眼灯具灯饰凝月呵护光【包安装","price":"417.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"31901":{"id":"31901","name":"京东京造 智能马桶盖调温版 单加热盖板 加热加厚缓降坐便盖板","price":"199.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40895":{"id":"40895","name":"酷火智能声控小夜灯语音床头灯宿舍台灯阅读护眼卧室睡眠充电超长续航","price":"88.7","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"23703":{"id":"23703","name":"正翔ZX-007-160户外市电草坪灯800MM简约大气灯具","price":"290.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"28459":{"id":"28459","name":"惠普客厅大灯具套餐三室两厅吸顶灯简约led普瑞护眼智能臻之光包安装","price":"678.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"32317":{"id":"32317","name":"PHILIPS飞利浦恒亮型LED小柱灯柱形LED灯泡标准口E27 9.5W白光6","price":"22.9","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"19433":{"id":"19433","name":"海尔（Haier）智能马桶盖即热手柄系列 小贝壳2.0 全自动坐便盖 京东安装1","price":"699.0","sale":"已售<10件","parent":"酒店设施","cat":"基础建材"},"40889":{"id":"40889","name":"箭牌（ARROW）智能马桶一体机无水箱脚感冲水小户型智能坐便器AB1026-U3","price":"1399.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"31921":{"id":"31921","name":"京东京造小白鲸W3.0轻智能马桶无水压限制离座自动冲水智能坐便器包安装","price":"828.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"19449":{"id":"19449","name":"海尔（Haier）智能马桶盖即热暖风系列电动加热马桶圈全自动坐便盖V-168Pl","price":"839.0","sale":"已售<10件","parent":"酒店设施","cat":"基础建材"},"40883":{"id":"40883","name":"九牧（JOMOO）无水压限制轻智能马桶脚感翻盖翻圈无棱内壁SQ8640-SA-C","price":"1829.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40885":{"id":"40885","name":"九牧TS1脚感款智能马桶ZQ5346-S0-CJM305","price":"1578.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40835":{"id":"40835","name":"九牧（JOMOO）轻智能马桶白魔方无水压限制旋风魔力泡SQ8450-S0-CJM","price":"1302.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24341":{"id":"24341","name":"恒洁（HEGII）京东联名轻智能马桶自由座S3小户型泡沫盾DCQ661A-305","price":"1101.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40841":{"id":"40841","name":"京东京造小白鲸Pro2.0轻智能马桶无水压限制脚感冲水智能坐便器包安装","price":"1000.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24375":{"id":"24375","name":"京东京造海豚智能马桶盖 暖风烘干 活水即热清洗 座圈加热 自动除臭","price":"676.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40831":{"id":"40831","name":"松下（Panasonic）智能便盖智能温控清洗升级夜灯款P11+【李佳琦升级款】","price":"999.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"24379":{"id":"24379","name":"京东京造海豚Plus智能马桶盖U型D型 电动加热烘干 童洗助便洗 抗菌坐便圈","price":"727.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40891":{"id":"40891","name":"箭牌（ARROW）卫浴轻智能马桶脚感冲水轻智能坐便器AF6022-S M-超体","price":"1399.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40887":{"id":"40887","name":"箭牌（ARROW）卫浴轻智能马桶脚感冲水轻智能坐便器AF6022-S L-超体","price":"1473.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"40847":{"id":"40847","name":"松下（Panasonic）轻智能马桶无水压限制租房家用遥控翻盖翻圈夜灯停电冲Q6","price":"1612.0","sale":"90天已售<10件","parent":"酒店设施","cat":"基础建材"},"19465":{"id":"19465","name":"松下（Panasonic）智能便盖即热智能温控烘干夜灯款P21","price":"1328.0","sale":"已售<10件","parent":"酒店设施","cat":"基础建材"},"5055":{"id":"5055","name":"添添财全国拍摄-定制服务空间酒店/民宿视频拍摄（可免房置换）","price":"150.00","sale":"已售69件 好评100%","parent":"视觉设计","cat":"影像拍摄","params":{"品牌":"元伍纪","质量保证期":"999","最小起订量":"1","适用酒店":"3-5星"}},"17553":{"id":"17553","name":"酒店视频制作剪辑社区推广","price":"1.00","sale":"已售164件 好评100%","parent":"视觉设计","cat":"影像拍摄","params":{"品牌":"丽呈宇曼数字科技","质量保证期":"12","最小起订量":"1","适用酒店":"3-5星"}},"58091":{"id":"58091","name":"3888 元打造高转化线上店铺金钻定制送包月一个月的平台上传指导（页面头图、房型","price":"3888.00","sale":"90天已售<10件 好评100%","parent":"视觉设计","cat":"影像拍摄","params":{"品牌":"添添财","质量保证期":"1个月","最小起订量":"1","适用酒店":"3-5星"}},"5057":{"id":"5057","name":"添添财-全国拍摄-豪华/金钻酒店、民宿拍摄（可免房置换）","price":"50.00","sale":"已售256件 好评100%","parent":"视觉设计","cat":"影像拍摄","params":{"品牌":"元伍纪","质量保证期":"999","最小起订量":"1","适用酒店":"3-4星"}},"6333":{"id":"6333","name":"全国酒店/民宿（照片、视频、360VR全景）拍摄","price":"1.0","sale":"已售311件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"58089":{"id":"58089","name":"2888 元打造高转化线上店铺送图文秀及送包月一个月的平台上传指导（页面头图、房","price":"300.0","sale":"已售12件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"9259":{"id":"9259","name":"<去拍拍>首席总监级摄影师上门拍摄解锁新视角","price":"388.0","sale":"已售167件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"9999":{"id":"9999","name":"【君达影业】酒店照片视频套餐拍摄，性价比极高， 全国（含港澳台）上门拍摄","price":"10.0","sale":"已售162件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"69203":{"id":"69203","name":"酒店新媒体营销","price":"1.0","sale":"本月上新","parent":"视觉设计","cat":"影像拍摄"},"623":{"id":"623","name":"<去拍拍>专业拍摄图片视频助力酒店营销","price":"388.0","sale":"已售3171件 好评99%","parent":"视觉设计","cat":"影像拍摄"},"5305":{"id":"5305","name":"添添财-全国拍摄-266元房型视频10-30秒","price":"266.0","sale":"已售31件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"2382":{"id":"2382","name":"APP酒店亮点视频剪辑【线上服务】酒店摄影","price":"300.0","sale":"已售2238件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"67909":{"id":"67909","name":"住映像-视频/照片酒店摄影定制拍摄","price":"10.0","sale":"本月上新","parent":"视觉设计","cat":"影像拍摄"},"434":{"id":"434","name":"<去拍拍>视频拍摄酒店动态新界面【限时赠送达人推广】","price":"100.0","sale":"已售796件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"18017":{"id":"18017","name":"住映像-照片/视频单项酒店摄影酒店拍摄","price":"8600.0","sale":"已售13件","parent":"视觉设计","cat":"影像拍摄"},"5303":{"id":"5303","name":"添添财全国拍摄-标准版主视频（共7个视频） /6个房型视频/航拍为赠送项目，如因","price":"532.0","sale":"已售65件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"3335":{"id":"3335","name":"<轻阁>抄底价图片视频组合","price":"2000.0","sale":"已售127件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"7309":{"id":"7309","name":"<去拍拍>臻选酒店摄影高端定制专属服务【限时赠送达人推广】","price":"2400.0","sale":"已售49件","parent":"视觉设计","cat":"影像拍摄"},"3092":{"id":"3092","name":"<轻阁>酒店照片拍摄服务","price":"280.0","sale":"已售278件 好评98%","parent":"视觉设计","cat":"影像拍摄"},"5463":{"id":"5463","name":"亲子房 主题房 影音房等房型照片拍摄（支持免房置换）","price":"200.0","sale":"已售21件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"7283":{"id":"7283","name":"全国主题房拍摄亲子房拍摄影音房等房型照片","price":"599.0","sale":"已售21件","parent":"视觉设计","cat":"影像拍摄"},"156":{"id":"156","name":"<去拍拍>抄底价图片视频组合全国酒店摄影 【限时赠送达人推广】","price":"388.0","sale":"已售961件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"20755":{"id":"20755","name":"桃淘筑甄选-摄影-房型公区-摄定制服务","price":"100.0","sale":"已售93件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"3119":{"id":"3119","name":"酒店民宿影像拍摄服务】高档酒店摄影套餐 客房 / 大堂 / 环境拍摄 突出酒店亮","price":"500.0","sale":"已售107件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"69335":{"id":"69335","name":"【三舍特约】全国酒店空间图片视频拍摄","price":"10.0","sale":"本月上新","parent":"视觉设计","cat":"影像拍摄"},"1435":{"id":"1435","name":"小二快拍酒店民宿摄影","price":"2980.0","sale":"已售57件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"5923":{"id":"5923","name":"【麓途-酒店民宿影像拍摄服务】高档酒店摄影套餐 客房 / 大堂 / 环境拍摄 突","price":"1.0","sale":"已售140件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"5016":{"id":"5016","name":"研画空间|酒店照片套餐（支持免房置换·全网通用）","price":"10.0","sale":"已售73件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"10243":{"id":"10243","name":"<去拍拍>0-1全套视觉搭建 | 全网通用图片视频详情页海报一步到位","price":"750.0","sale":"已售27件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"8337":{"id":"8337","name":"星瀚云图-酒店民宿拍摄底片全送","price":"2499.0","sale":"已售18件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"8931":{"id":"8931","name":"<去拍拍>臻选摄影高端定制专属服务【限时赠送达人推广】","price":"500.0","sale":"已售244件 好评98%","parent":"视觉设计","cat":"影像拍摄"},"9257":{"id":"9257","name":"去拍拍【OTA主图视频】详情页转化大师","price":"100.0","sale":"已售39件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"9095":{"id":"9095","name":"<去拍拍>性价比之王经济型酒店拍照套餐","price":"750.0","sale":"已售24件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"6467":{"id":"6467","name":"【首席总监拍摄】图片特级精拍精修，满足高端酒店多元需求，全国拍摄","price":"10.0","sale":"已售17件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"16":{"id":"16","name":"瑞轩特惠活动（可免房置换 ）","price":"120.0","sale":"已售123件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"157":{"id":"157","name":"<去拍拍>经济实用推荐酒店摄影超实惠","price":"50.0","sale":"已售93件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"5056":{"id":"5056","name":"添添财全国拍摄-单房型拍摄-酒店/民宿拍摄（可免房置换）","price":"266.0","sale":"已售82件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"61207":{"id":"61207","name":"探巡摄影-酒店开业摄影拍照","price":"10.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"6397":{"id":"6397","name":"住小满--专业OTA照片拍摄（可免房置换 可用全渠道）","price":"1328.0","sale":"已售24件","parent":"视觉设计","cat":"影像拍摄"},"17431":{"id":"17431","name":"<去拍拍>高端酒店摄影定制服务","price":"399.0","sale":"已售12件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"9093":{"id":"9093","name":"<去拍拍>一站式拍摄服务满足中高端酒店摄影多元需求","price":"2400.0","sale":"已售25件","parent":"视觉设计","cat":"影像拍摄"},"63903":{"id":"63903","name":"住映像-亲子房酒店摄影定制拍摄","price":"0.01","sale":"本月上新","parent":"视觉设计","cat":"影像拍摄"},"3082":{"id":"3082","name":"轻阁-限时折扣定制摄影套餐","price":"1700.0","sale":"已售68件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"6395":{"id":"6395","name":"住小满——专业OTA照片拍摄精修（免费房置换 可用全渠道）","price":"1630.0","sale":"已售13件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"7553":{"id":"7553","name":"<去拍拍>自营酒店摄影服务,助力酒店火速破圈","price":"888.0","sale":"已售10件","parent":"视觉设计","cat":"影像拍摄"},"62819":{"id":"62819","name":"住小满--专业OTA照片拍摄(可免房置换 可用全渠道）","price":"460.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"5343":{"id":"5343","name":"添添财 全国拍摄-只精修图不含拍摄（请找客服要案例图）","price":"50.0","sale":"已售49件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"12":{"id":"12","name":"大藤摄影酒店民宿照片视频拍摄","price":"2500.0","sale":"已售46件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"6453":{"id":"6453","name":"全国酒店/民宿（照片、视频、360VR全景）拍摄","price":"1.0","sale":"已售14件","parent":"视觉设计","cat":"影像拍摄"},"8237":{"id":"8237","name":"君达影业专业酒店视频拍摄：首页宣传视频、房型视频、航拍、列表页视频可定制拍摄","price":"1000.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"9183":{"id":"9183","name":"<去拍拍>品牌视觉升维计划！高端酒店形象重塑","price":"2400.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"5058":{"id":"5058","name":"添添财全国拍摄-998元（4个房型-工区门头赠送）","price":"50.0","sale":"已售88件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"3083":{"id":"3083","name":"<轻阁>-视频照片组合套餐","price":"600.0","sale":"已售393件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"43945":{"id":"43945","name":"映界视觉 OTA平台列表页竖版视频剪辑优化 专业后期工程师精细化调整（非拍摄，下","price":"150.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"42217":{"id":"42217","name":"映界视觉 定制酒店照片/视频拍摄套餐 创意总监级摄影师上门拍摄","price":"200.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"45237":{"id":"45237","name":"映界视觉 金钻级酒店视频拍摄套餐 资深摄像团队上门拍摄","price":"100.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"5801":{"id":"5801","name":"【麓途-旅拍-达人营销】酒店民宿景区探店全案丨达人旅拍 -视频或笔记","price":"299.0","sale":"已售24件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"9179":{"id":"9179","name":"<去拍拍>抄底价图片、视频、推广组合全国拍摄","price":"4180.0","sale":"已售17件","parent":"视觉设计","cat":"影像拍摄"},"9195":{"id":"9195","name":"<去拍拍>创意中级摄影师 上门拍摄酒店","price":"388.0","sale":"已售12件","parent":"视觉设计","cat":"影像拍摄"},"9201":{"id":"9201","name":"<去拍拍>艺术高级摄影师 上门拍摄酒店【臻选】全国酒店拍摄服务【限时赠送达人推广","price":"388.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"6197":{"id":"6197","name":"添添财全国服务性价比极高秒杀价/全国接单","price":"50.0","sale":"已售18件","parent":"视觉设计","cat":"影像拍摄"},"62845":{"id":"62845","name":"领锐股份-四星五星酒店官图拍摄","price":"1.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"8571":{"id":"8571","name":"陕西酒店照片拍摄20张精修","price":"500.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"18021":{"id":"18021","name":"住映像-高星酒店摄影营销物料版（照片+主影片+房型视频+营销物料）定制拍摄","price":"23600.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"8605":{"id":"8605","name":"全国精选中高端酒店定制拍摄","price":"1500.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"8339":{"id":"8339","name":"星瀚云图-酒店民宿图片及视频拍摄","price":"3000.0","sale":"已售19件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"9167":{"id":"9167","name":"去拍拍【OTA算法友好酒店摄影】符合OTA最新审核标准","price":"200.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"18019":{"id":"18019","name":"住映像-三星及以上酒店摄影影像组合套餐（酒店空间精修照片+酒店空间主视频+房型视","price":"16800.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"8603":{"id":"8603","name":"全国精选精品民宿、公寓定制拍摄","price":"599.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"42219":{"id":"42219","name":"映界视觉 金钻酒店照片/视频拍摄套餐 视觉导师级摄影师上门拍摄","price":"200.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"54083":{"id":"54083","name":"集团高星酒店定制拍摄套餐","price":"800.0","sale":"90天已售<10件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"8341":{"id":"8341","name":"星瀚云图-视频➕图片组合套餐拍摄","price":"500.0","sale":"已售14件","parent":"视觉设计","cat":"影像拍摄"},"62847":{"id":"62847","name":"领锐股份-高端酒店宣传片视频拍摄剪辑服务","price":"1.0","sale":"90天已售<10件","parent":"视觉设计","cat":"影像拍摄"},"17651":{"id":"17651","name":"限时特惠(一站式拍摄服务)全国热销","price":"300.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"6475":{"id":"6475","name":"【布光拍摄】总监级摄影师，图片视频组合全国拍摄","price":"150.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"9355":{"id":"9355","name":"全国精选酒店视频定制拍摄","price":"3499.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"17655":{"id":"17655","name":"全国热销限时特惠(一站式拍摄服务)","price":"2499.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"8241":{"id":"8241","name":"包月 OTA 店铺优化服务，300 元 / 月","price":"300.0","sale":"已售<10件","parent":"视觉设计","cat":"影像拍摄"},"8453":{"id":"8453","name":"闪拍·图片拍摄","price":"100.0","sale":"已售30件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"8349":{"id":"8349","name":"星瀚云图-酒店民宿视频定制拍摄","price":"300.0","sale":"已售13件 好评100%","parent":"视觉设计","cat":"影像拍摄"},"54085":{"id":"54085","name":"【轻阁-图文秀】酒店民宿定制化图文秀（酒店亮点）设计/一店一设计","price":"360.00","sale":"90天已售<10件","parent":"视觉设计","cat":"图文设计","params":{"品牌":"轻阁摄影","质量保证期":"3天","最小起订量":"1","适用酒店":"3-5星"}},"5919":{"id":"5919","name":"【麓途-图文秀】酒店民宿定制化图文秀设计丨一店一设计+房型卖点提炼 + 场景化排","price":"599.00","sale":"已售51件 好评100%","parent":"视觉设计","cat":"图文设计","params":{"品牌":"麓途","质量保证期":"1","最小起订量":"1","适用酒店":"3-5星"}},"3080":{"id":"3080","name":"<去拍拍>全国视频拍摄酒店动态新界面【限时赠送达人推广】","price":"2999.00","sale":"已售<10件","parent":"视觉设计","cat":"图文设计","params":{"品牌":"去拍拍","质量保证期":"免费修改至达到上线要求","最小起订量":"1份","适用酒店":"3-5星"}},"9899":{"id":"9899","name":"【后台优化】酒店上线陪跑计划：单次服务搞定后台优化+全链路支持","price":"2999.00","sale":"已售<10件","parent":"视觉设计","cat":"图文设计","params":{"品牌":"酒店单次影像优化服务","质量保证期":"1","最小起订量":"1","适用酒店":"3-5星"}},"63063":{"id":"63063","name":"住小满酒店图文秀设计服务","price":"360.0","sale":"90天已售<10件","parent":"视觉设计","cat":"图文设计"},"9185":{"id":"9185","name":"<去拍拍>全国高星主题房酒店摄影","price":"388.0","sale":"已售<10件","parent":"视觉设计","cat":"图文设计"},"2416":{"id":"2416","name":"<去拍拍>专业拍摄图片视频覆盖酒店全场景","price":"100.0","sale":"已售14件","parent":"视觉设计","cat":"图文设计"},"9181":{"id":"9181","name":"<去拍拍>图文秀设计一店一定制，您酒店的专属名片","price":"10.0","sale":"已售12件","parent":"视觉设计","cat":"图文设计"},"9325":{"id":"9325","name":"【麓途×旅朋友】新媒体顾问咨询服务","price":"1.0","sale":"已售<10件","parent":"视觉设计","cat":"图文设计"},"7821":{"id":"7821","name":"《匠心定制·酒店视觉名片设计：环境叙事+深度游攻略+品牌沉浸式体验》","price":"599.0","sale":"已售<10件","parent":"视觉设计","cat":"图文设计"},"8457":{"id":"8457","name":"闪拍·生意通充值","price":"3000.0","sale":"已售<10件","parent":"视觉设计","cat":"图文设计"},"5917":{"id":"5917","name":"10年酒店修图经验｜500+高端品牌案例｜让您的视觉效果碾压同行」","price":"1499.0","sale":"已售11件","parent":"视觉设计","cat":"图文设计"},"57367":{"id":"57367","name":"🚀节日营销加速器！专业海报设计省时90%！ （痛点解决+效率提升）","price":"365.0","sale":"90天已售<10件","parent":"视觉设计","cat":"图文设计"},"9079":{"id":"9079","name":"【达人推广】打造口碑，精准触达受众住客","price":"888.00","sale":"已售51件 好评100%","parent":"视觉设计","cat":"酒店旅拍","params":{"品牌":"去拍拍","质量保证期":"保证上线使用","最小起订量":"1份","适用酒店":"3-5星"}},"63017":{"id":"63017","name":"酒店旅拍-达人营销-种草笔记","price":"3999.00","sale":"已售70件 好评100%","parent":"视觉设计","cat":"酒店旅拍","params":{"品牌":"沐廉","质量保证期":"1","最小起订量":"1","适用酒店":"3-5星"}},"3299":{"id":"3299","name":"<去拍拍>专业拍摄图片视频助力酒店营销","price":"2400.00","sale":"已售13件 好评100%","parent":"视觉设计","cat":"酒店旅拍","params":{"品牌":"去拍拍","质量保证期":"助力提高转化","最小起订量":"1","适用酒店":"3-5星"}},"70441":{"id":"70441","name":"酒店旅拍/小红薯种草笔记/达人营销","price":"1999.00","sale":"本月上新","parent":"视觉设计","cat":"酒店旅拍","params":{"品牌":"无","质量保证期":"无","最小起订量":"1","适用酒店":"3-5星"}},"7127":{"id":"7127","name":"全国精选酒店旅拍探店服务商，全国范围拍摄","price":"2199.0","sale":"已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"7545":{"id":"7545","name":"<去拍拍>王炸！全国酒店拍摄图片+视频组合拍摄抄底价 ★限时赠送达人推广","price":"50.0","sale":"已售16件","parent":"视觉设计","cat":"酒店旅拍"},"17863":{"id":"17863","name":"酒店旅拍","price":"1.0","sale":"已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"6057":{"id":"6057","name":"<去拍拍>全国主题房型拍摄（全网通用 免房置换 若需更多案例请找客服 ）","price":"2800.0","sale":"已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"17885":{"id":"17885","name":"流量提升|种草笔记/达人带货|爬坡大礼包","price":"1.0","sale":"已售15件 好评100%","parent":"视觉设计","cat":"酒店旅拍"},"7823":{"id":"7823","name":"【麓途碰一碰智能系统】麓途碰一碰智能系统丨 AI 创作 + 多平台通投，永久版","price":"2999.0","sale":"已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"51215":{"id":"51215","name":"【酒店营销优选套餐-酒店图文秀+旅拍】达人在线创作,优质标签内容,展示于社区、达","price":"899.0","sale":"90天已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"63095":{"id":"63095","name":"住小满---达人种草写好文 精准匹配酒店目标客源","price":"1000.0","sale":"90天已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"51217":{"id":"51217","name":"【旅拍】麓途・酒店民宿景区全案丨达人实拍 - 视频笔记","price":"365.0","sale":"90天已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"17433":{"id":"17433","name":"专业呈现，赋能收益 | 高端酒店/民宿商业空间摄影","price":"1200.0","sale":"已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"17427":{"id":"17427","name":"<去拍拍>总监级摄影师上门拍摄解锁新视角","price":"5500.0","sale":"已售<10件","parent":"视觉设计","cat":"酒店旅拍"},"51587":{"id":"51587","name":"影音房-小帅-W6S产品套餐【现金】","price":"2999.00","sale":"已售25件","parent":"特色服务","cat":"主题房签约","params":{"品牌":"小帅","箱规":"1","支持定制":"否","质量保证期":"2","最小起订量":"6","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"4943":{"id":"4943","name":"影音房-小帅产品商用版权续约","price":"300.00","sale":"已售2229件 好评100%","parent":"特色服务","cat":"主题房签约","params":{"品牌":"小帅","箱规":"常规","支持定制":"否","质量保证期":"1","最小起订量":"5","支持试用":"否","发货周期":"48小时发货","适用酒店":"0-3星"}},"24603":{"id":"24603","name":"添眠-智能按摩舒睡房S1【客房分成】","price":"7999.00","sale":"已售11件","parent":"特色服务","cat":"主题房签约","params":{"品牌":"nitetronic添眠","箱规":"1187X934X272mm","支持定制":"否","质量保证期":"3年","最小起订量":"5","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"57695":{"id":"57695","name":"Hape欢乐派对玩具主题房","price":"7999.00","sale":"已售28件","parent":"特色服务","cat":"主题房签约","params":{"品牌":"HAPE","箱规":"-","支持定制":"否","质量保证期":"-","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"16943":{"id":"16943","name":"添眠-S1智能按摩舒睡房","price":"5999.0","sale":"已售103件","parent":"特色服务","cat":"主题房签约"},"57371":{"id":"57371","name":"影音房-YOYIN-V3（现金方式）","price":"1599.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"51109":{"id":"51109","name":"影音房-小帅-开机付费(三年)","price":"5000.0","sale":"已售52件","parent":"特色服务","cat":"主题房签约"},"60459":{"id":"60459","name":"蛋仔派对亲子主题房","price":"7999.0","sale":"已售148件 好评100%","parent":"特色服务","cat":"主题房签约"},"60287":{"id":"60287","name":"梦百合-零压薄垫舒睡房【固定收费】","price":"2190.0","sale":"已售40件","parent":"特色服务","cat":"主题房签约"},"41527":{"id":"41527","name":"电玩房-小帅-开机付费(两年)","price":"3510.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"3071":{"id":"3071","name":"B.Duck续签","price":"1800.0","sale":"已售855件 好评100%","parent":"特色服务","cat":"主题房签约"},"1932":{"id":"1932","name":"梦百合-零压厚垫舒睡房","price":"2649.5","sale":"已售313件 好评100%","parent":"特色服务","cat":"主题房签约"},"62821":{"id":"62821","name":"携程亲子房-小黄人产品包系列","price":"8999.0","sale":"已售66件 好评100%","parent":"特色服务","cat":"主题房签约"},"62817":{"id":"62817","name":"海底小纵队亲子主题房【焕新版】","price":"9999.0","sale":"已售19件","parent":"特色服务","cat":"主题房签约"},"5152":{"id":"5152","name":"B.Duck小黄鸭亲子主题房【豪华版】","price":"7999.0","sale":"已售672件 好评100%","parent":"特色服务","cat":"主题房签约"},"5355":{"id":"5355","name":"梦百合-零压薄垫舒睡房【客房分成】","price":"2028.0","sale":"已售1331件 好评100%","parent":"特色服务","cat":"主题房签约"},"5361":{"id":"5361","name":"蓝盒子-云端睡感民宿舒睡房","price":"1428.0","sale":"已售132件 好评100%","parent":"特色服务","cat":"主题房签约"},"9803":{"id":"9803","name":"奶龙亲子主题房","price":"5999.0","sale":"已售530件 好评100%","parent":"特色服务","cat":"主题房签约"},"9455":{"id":"9455","name":"Hape丝绸之路玩具主题房【火车系列产品】","price":"5999.0","sale":"已售151件 好评100%","parent":"特色服务","cat":"主题房签约"},"9387":{"id":"9387","name":"B.Duck小黄鸭亲子主题房【玩乐版】","price":"5999.0","sale":"已售499件 好评100%","parent":"特色服务","cat":"主题房签约"},"22023":{"id":"22023","name":"奶龙亲子房续签","price":"2000.0","sale":"已售36件","parent":"特色服务","cat":"主题房签约"},"63259":{"id":"63259","name":"享住宠物房","price":"660.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"7329":{"id":"7329","name":"樱桃小丸子亲子主题房","price":"7999.0","sale":"已售204件 好评100%","parent":"特色服务","cat":"主题房签约"},"8371":{"id":"8371","name":"臻影-影音房Y5-Lite现金支付（不含安装）","price":"1580.0","sale":"已售59件","parent":"特色服务","cat":"主题房签约"},"5038":{"id":"5038","name":"唐龙-电竞主题房升级方案","price":"1.0","sale":"已售165件","parent":"特色服务","cat":"主题房签约"},"22435":{"id":"22435","name":"【2026焕新款】影音房Y8-block Ⅲ【不含：安装，幕布】","price":"1980.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"3334":{"id":"3334","name":"喜临门-品质厚垫舒睡房","price":"262.0","sale":"已售231件 好评100%","parent":"特色服务","cat":"主题房签约"},"54401":{"id":"54401","name":"小帅-助眠按摩舒睡房（现金/免房/分期）","price":"4299.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"17683":{"id":"17683","name":"享享时光系列产品加购/系统版权续费（现金方式/免房置换）","price":"500.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"64207":{"id":"64207","name":"享住宠物房入住礼包 10套","price":"529.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"54433":{"id":"54433","name":"小帅-助眠按摩舒睡房【客房分成】","price":"4299.0","sale":"已售53件","parent":"特色服务","cat":"主题房签约"},"17659":{"id":"17659","name":"享享时光VR主题房（开机付费35元/台/天）","price":"14000.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"6613":{"id":"6613","name":"唐龙-租赁或分期(5060/70+14代CPU+专业电竞桌椅)","price":"15768.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"68149":{"id":"68149","name":"享住宠物房【启航版】","price":"660.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"68151":{"id":"68151","name":"享住宠物房【启航版】（三期免息）","price":"660.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"2813":{"id":"2813","name":"海底小纵队续签","price":"1800.0","sale":"已售733件 好评100%","parent":"特色服务","cat":"主题房签约"},"64223":{"id":"64223","name":"享住宠物房标识物料","price":"25.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"51585":{"id":"51585","name":"影音房-小帅-W6S产品套餐【分期/免房】","price":"2280.0","sale":"已售14件","parent":"特色服务","cat":"主题房签约"},"3054":{"id":"3054","name":"影音房-海尔小帅合作意向","price":"0.01","sale":"已售206件","parent":"特色服务","cat":"主题房签约"},"66327":{"id":"66327","name":"中昇预付分期/免房置换专用","price":"1.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"4889":{"id":"4889","name":"电竞房-G次元-电竞房RTX3060（开机付费）","price":"50.0","sale":"已售64件","parent":"特色服务","cat":"主题房签约"},"67451":{"id":"67451","name":"享住宠物房（3期免息）","price":"660.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"69207":{"id":"69207","name":"我的世界实境探险主题房","price":"7999.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"4807":{"id":"4807","name":"喜羊羊与灰太狼续签","price":"1800.0","sale":"已售66件 好评100%","parent":"特色服务","cat":"主题房签约"},"20201":{"id":"20201","name":"恐龙主题上下床系列产品","price":"33599.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"68109":{"id":"68109","name":"潮玩寰宝主题房","price":"8000.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"63061":{"id":"63061","name":"添眠-G1智能深睡按摩舒睡房【客房分成】","price":"15800.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"17661":{"id":"17661","name":"享享时光VR主题房（免房置换/预付款分期模式）","price":"7999.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"67279":{"id":"67279","name":"宠物主题房间抱枕","price":"72.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"59377":{"id":"59377","name":"自调节软硬床","price":"1.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"17669":{"id":"17669","name":"享享时光VR主题房（现金方式）","price":"7999.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"9371":{"id":"9371","name":"樱桃小丸子续签","price":"1800.0","sale":"已售60件 好评100%","parent":"特色服务","cat":"主题房签约"},"69699":{"id":"69699","name":"山左免房置换","price":"1.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"67277":{"id":"67277","name":"宠物主题房间床旗","price":"96.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"4808":{"id":"4808","name":"埃及萌神续签","price":"1800.0","sale":"已售70件 好评100%","parent":"特色服务","cat":"主题房签约"},"21267":{"id":"21267","name":"影音房-【臻影】酒店商用版会员续约","price":"190.0","sale":"已售42件 好评100%","parent":"特色服务","cat":"主题房签约"},"4492":{"id":"4492","name":"电竞房-G次元-电竞房RTX（租满即送）","price":"14527.0","sale":"已售29件","parent":"特色服务","cat":"主题房签约"},"7011":{"id":"7011","name":"2026焕新款-影音房Y8-block Ⅲ（全套餐）","price":"2420.0","sale":"已售156件 好评100%","parent":"特色服务","cat":"主题房签约"},"67275":{"id":"67275","name":"（家长用）防粘毛床品4件套/白色","price":"383.2","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"67623":{"id":"67623","name":"52阂兹H6高清投影仪","price":"1999.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"7769":{"id":"7769","name":"巨幕影音房-A5","price":"3599.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"7773":{"id":"7773","name":"巨幕影音房-A2","price":"6199.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"67281":{"id":"67281","name":"防污生活地毯","price":"144.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"9443":{"id":"9443","name":"电玩房-海尔小帅合作意向","price":"0.01","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"6485":{"id":"6485","name":"创维智瞳-影音房—激光投影XYB1B","price":"5800.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"17745":{"id":"17745","name":"电竞房—G次元i5—RTX5060","price":"22.0","sale":"已售15件","parent":"特色服务","cat":"主题房签约"},"56101":{"id":"56101","name":"峰翔-影音房-L1 LCD显示技术","price":"2499.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"22337":{"id":"22337","name":"影音房合作意向咨询","price":"0.01","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"67665":{"id":"67665","name":"享住宠物房家具用品","price":"28.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"56821":{"id":"56821","name":"奢享定制影音房-YOYIN-V8（免房/分期）","price":"3499.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"7221":{"id":"7221","name":"菩康牌负氧离子土炕","price":"15880.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"67781":{"id":"67781","name":"电玩房-小帅产品商用版权续约","price":"699.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"1625":{"id":"1625","name":"YOYO续签套餐","price":"720.0","sale":"已售94件 好评100%","parent":"特色服务","cat":"主题房签约"},"54471":{"id":"54471","name":"负氧离子-助眠空净舒睡房","price":"6018.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"5350":{"id":"5350","name":"峰翔-影音房-H9 LCD显示技术","price":"6199.0","sale":"已售<10件","parent":"特色服务","cat":"主题房签约"},"57377":{"id":"57377","name":"影音房-YOYIN-V3-开机付费（三年）","price":"3999.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"51591":{"id":"51591","name":"影音房-小帅-W8S产品套餐会员版权2年【分期/免房】","price":"4950.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"67695":{"id":"67695","name":"宠物主题房浴室地垫","price":"68.0","sale":"本月上新","parent":"特色服务","cat":"主题房签约"},"19419":{"id":"19419","name":"海洋主题帐篷床系列产品","price":"14999.0","sale":"已售14件","parent":"特色服务","cat":"主题房签约"},"51579":{"id":"51579","name":"电玩房-小帅-会员版权1年产品套餐【分期/免房】","price":"1898.0","sale":"90天已售<10件","parent":"特色服务","cat":"主题房签约"},"2255":{"id":"2255","name":"海底小纵队主题房【儿童拖鞋】","price":"6.17","sale":"已售4.3万件 好评100%","parent":"特色服务","cat":"亲子房补货","params":{"品牌":"海底小纵队","箱规":"1","支持定制":"否","质量保证期":"1年","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"5619":{"id":"5619","name":"经典奥特曼主题【儿童拖鞋】","price":"6.40","sale":"已售1.1万件 好评100%","parent":"特色服务","cat":"亲子房补货","params":{"品牌":"娱宿空间","箱规":"30","支持定制":"否","质量保证期":"一年","最小起订量":"30","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"2224":{"id":"2224","name":"海底小纵队主题房【床盖】","price":"513.50","sale":"已售679件 好评100%","parent":"特色服务","cat":"亲子房补货","params":{"品牌":"海底小纵队","箱规":"1箱","支持定制":"否","质量保证期":"1年","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"2230":{"id":"2230","name":"海底小纵队主题房【定制款游戏帐篷】","price":"244.34","sale":"已售152件 好评100%","parent":"特色服务","cat":"亲子房补货","params":{"品牌":"海底小纵队","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"609":{"id":"609","name":"亲子房补充物料补差支付专用","price":"1.0","sale":"已售134件 好评100%","parent":"特色服务","cat":"亲子房补货"},"57681":{"id":"57681","name":"Hape亲子公区","price":"1.0","sale":"已售34.5万件","parent":"特色服务","cat":"亲子房补货"},"10217":{"id":"10217","name":"奶龙亲子主题房【儿童洗漱套装】","price":"7.8","sale":"已售6705件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5124":{"id":"5124","name":"B.Duck小黄鸭【拖鞋】","price":"5.07","sale":"已售2.4万件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9929":{"id":"9929","name":"奶龙亲子主题房【儿童一次性拖鞋】","price":"5.16","sale":"已售5940件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5119":{"id":"5119","name":"B.Duck小黄鸭2023款【玩具类】","price":"36.0","sale":"已售395件 好评100%","parent":"特色服务","cat":"亲子房补货"},"2237":{"id":"2237","name":"海底小纵队主题房【巾类】","price":"10.34","sale":"已售8069件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8491":{"id":"8491","name":"亲子房通配版【儿童洗护】","price":"1.82","sale":"已售8224件 好评100%","parent":"特色服务","cat":"亲子房补货"},"10429":{"id":"10429","name":"B.Duck小黄鸭2025款【游戏屋】","price":"11.96","sale":"已售80件 好评100%","parent":"特色服务","cat":"亲子房补货"},"4190":{"id":"4190","name":"通用一次性儿童牙刷牙膏可爱卡通宝宝细软毛牙具","price":"0.68","sale":"已售3.8万件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8489":{"id":"8489","name":"B.Duck小黄鸭主题房【儿童洗护】","price":"1.35","sale":"已售3.2万件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5130":{"id":"5130","name":"B.Duck小黄鸭2023款【卡套】","price":"0.65","sale":"已售3894件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5197":{"id":"5197","name":"B.duck主题房【儿童爬行垫】","price":"153.4","sale":"已售112件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5121":{"id":"5121","name":"B.Duck小黄鸭2023款【杯垫】","price":"7.15","sale":"已售582件 好评100%","parent":"特色服务","cat":"亲子房补货"},"17499":{"id":"17499","name":"B.Duck小黄鸭2023款【密胺漱口杯】","price":"18.2","sale":"已售257件 好评100%","parent":"特色服务","cat":"亲子房补货"},"2238":{"id":"2238","name":"海底小纵队主题房【儿童洗护套装】","price":"15.9","sale":"已售4.8万件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5125":{"id":"5125","name":"B.Duck小黄鸭2023款【帐篷】","price":"377.0","sale":"已售167件 好评100%","parent":"特色服务","cat":"亲子房补货"},"2239":{"id":"2239","name":"海底小纵队主题房【宝宝二级台阶】","price":"47.45","sale":"已售181件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9941":{"id":"9941","name":"奶龙亲子主题房【儿童斜挎包】","price":"14.47","sale":"已售1330件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9907":{"id":"9907","name":"奶龙亲子主题房【房门卡套】","price":"1.09","sale":"已售1170件","parent":"特色服务","cat":"亲子房补货"},"5320":{"id":"5320","name":"奶龙，bduck，喜羊羊，1元补差","price":"1.0","sale":"已售38件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5331":{"id":"5331","name":"YOYO主题房-儿童滑梯组合玩具","price":"445.0","sale":"已售30件","parent":"特色服务","cat":"亲子房补货"},"62565":{"id":"62565","name":"蛋仔派对帐篷床+儿童三件套","price":"180.0","sale":"已售54件","parent":"特色服务","cat":"亲子房补货"},"2228":{"id":"2228","name":"海底小纵队主题房【大毛绒公仔】","price":"244.0","sale":"已售426件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5129":{"id":"5129","name":"B.Duck小黄鸭2023款【防撞角】","price":"5.2","sale":"已售694件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9923":{"id":"9923","name":"奶龙亲子主题房【游戏屋】","price":"10.5","sale":"已售104件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5212":{"id":"5212","name":"B.duck主题房【抱枕】","price":"37.7","sale":"已售349件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5245":{"id":"5245","name":"盼酷主题房【拖鞋】","price":"5.9","sale":"已售2.2万件 好评100%","parent":"特色服务","cat":"亲子房补货"},"1813":{"id":"1813","name":"通用酒店亲子款拖鞋","price":"2.39","sale":"已售8399件 好评100%","parent":"特色服务","cat":"亲子房补货"},"62525":{"id":"62525","name":"蛋仔派对-枕套（不含枕芯）","price":"55.0","sale":"已售124件","parent":"特色服务","cat":"亲子房补货"},"67609":{"id":"67609","name":"焕新版床盖","price":"39.0","sale":"本月上新","parent":"特色服务","cat":"亲子房补货"},"9919":{"id":"9919","name":"奶龙亲子主题房【马克杯】","price":"22.52","sale":"已售172件 好评100%","parent":"特色服务","cat":"亲子房补货"},"62549":{"id":"62549","name":"蛋仔派对-巾类","price":"11.0","sale":"已售423件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9913":{"id":"9913","name":"奶龙亲子主题房【抱枕】","price":"47.78","sale":"已售170件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5151":{"id":"5151","name":"B.duck主题房【浴室防滑垫】","price":"49.4","sale":"已售134件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8181":{"id":"8181","name":"樱桃小丸子主题【打卡相框】","price":"117.0","sale":"已售12件","parent":"特色服务","cat":"亲子房补货"},"62519":{"id":"62519","name":"蛋仔派对大床盖（适合大床房）","price":"299.0","sale":"已售33件","parent":"特色服务","cat":"亲子房补货"},"10271":{"id":"10271","name":"B.Duck小黄鸭2025款【巾类】","price":"7.15","sale":"已售796件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8119":{"id":"8119","name":"樱桃小丸子主题【毛巾】","price":"17.46","sale":"已售253件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5192":{"id":"5192","name":"B.duck主题房【帆布包】","price":"15.6","sale":"已售3646件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9945":{"id":"9945","name":"奶龙亲子主题房【贴纸】","price":"6.14","sale":"已售51件 好评100%","parent":"特色服务","cat":"亲子房补货"},"64167":{"id":"64167","name":"小黄人系列【杯垫】","price":"7.44","sale":"本月上新","parent":"特色服务","cat":"亲子房补货"},"8109":{"id":"8109","name":"樱桃小丸子主题【拖鞋套装】","price":"6.44","sale":"已售5125件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8129":{"id":"8129","name":"樱桃小丸子主题【洗护套装】","price":"19.6","sale":"已售2670件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5198":{"id":"5198","name":"B.duck主题房【儿童马桶圈】","price":"58.5","sale":"已售106件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5148":{"id":"5148","name":"B.Duck小黄鸭2023款【异形抱枕】","price":"55.9","sale":"已售267件 好评100%","parent":"特色服务","cat":"亲子房补货"},"64097":{"id":"64097","name":"小黄人系列【清洁提示牌】","price":"15.5","sale":"本月上新","parent":"特色服务","cat":"亲子房补货"},"20141":{"id":"20141","name":"儿童牙具套装-【卡盒版】","price":"0.69","sale":"已售7396件","parent":"特色服务","cat":"亲子房补货"},"6533":{"id":"6533","name":"BDUCK-KIDS儿童洗护套装","price":"21.45","sale":"已售1755件 好评100%","parent":"特色服务","cat":"亲子房补货"},"2229":{"id":"2229","name":"海底小纵队主题房【小公仔】","price":"22.31","sale":"已售2330件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8123":{"id":"8123","name":"樱桃小丸子主题【地巾】","price":"46.54","sale":"已售78件","parent":"特色服务","cat":"亲子房补货"},"5126":{"id":"5126","name":"B.Duck小黄鸭2023款【帆布包】","price":"15.6","sale":"已售2039件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9931":{"id":"9931","name":"奶龙亲子主题房【多角杯】","price":"21.16","sale":"已售162件 好评100%","parent":"特色服务","cat":"亲子房补货"},"62559":{"id":"62559","name":"蛋仔派对洗漱杯","price":"15.0","sale":"已售73件","parent":"特色服务","cat":"亲子房补货"},"5213":{"id":"5213","name":"B.duck主题房【床盖】","price":"149.5","sale":"已售158件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5150":{"id":"5150","name":"B.Duck小黄鸭2023款【浴袍】","price":"114.4","sale":"已售410件 好评100%","parent":"特色服务","cat":"亲子房补货"},"10241":{"id":"10241","name":"B.Duck小黄鸭2025款【玻璃贴】","price":"27.3","sale":"已售12件","parent":"特色服务","cat":"亲子房补货"},"9903":{"id":"9903","name":"奶龙亲子主题房【床盖】","price":"170.63","sale":"已售279件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5123":{"id":"5123","name":"B.Duck小黄鸭2023款【床盖】","price":"149.5","sale":"已售666件 好评100%","parent":"特色服务","cat":"亲子房补货"},"1637":{"id":"1637","name":"小熊尼奥主题儿童拖鞋","price":"7.8","sale":"已售1680件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8149":{"id":"8149","name":"樱桃小丸子主题【卡通门牌】","price":"15.15","sale":"已售<10件","parent":"特色服务","cat":"亲子房补货"},"51051":{"id":"51051","name":"seven plus-儿童洗护套装","price":"15.9","sale":"已售30件","parent":"特色服务","cat":"亲子房补货"},"8121":{"id":"8121","name":"樱桃小丸子主题【浴巾】","price":"53.08","sale":"已售184件 好评100%","parent":"特色服务","cat":"亲子房补货"},"62521":{"id":"62521","name":"蛋仔派对小床盖（适用于双床房）","price":"264.0","sale":"已售20件","parent":"特色服务","cat":"亲子房补货"},"1450":{"id":"1450","name":"小熊尼奥功能房【桌面指示台卡】","price":"20.8","sale":"已售13件","parent":"特色服务","cat":"亲子房补货"},"8117":{"id":"8117","name":"樱桃小丸子主题【方巾】","price":"8.0","sale":"已售256件 好评100%","parent":"特色服务","cat":"亲子房补货"},"17523":{"id":"17523","name":"【海洋系列】儿童洗护套装","price":"7.8","sale":"已售478件","parent":"特色服务","cat":"亲子房补货"},"9935":{"id":"9935","name":"奶龙亲子主题房【巾类】","price":"7.23","sale":"已售1157件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5137":{"id":"5137","name":"B.Duck小黄鸭2023款【门牌】","price":"9.1","sale":"已售136件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9947":{"id":"9947","name":"奶龙亲子主题房【戏水玩具】","price":"6.83","sale":"已售300件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5128":{"id":"5128","name":"B.Duck小黄鸭【防滑凳】","price":"41.6","sale":"已售144件 好评100%","parent":"特色服务","cat":"亲子房补货"},"8157":{"id":"8157","name":"樱桃小丸子主题【马克杯套装】","price":"59.1","sale":"已售71件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5639":{"id":"5639","name":"经典奥特曼主题【儿童方巾】","price":"9.6","sale":"已售663件 好评100%","parent":"特色服务","cat":"亲子房补货"},"6473":{"id":"6473","name":"B.Duck小黄鸭2023款【小水枪】","price":"11.52","sale":"已售2300件 好评100%","parent":"特色服务","cat":"亲子房补货"},"5199":{"id":"5199","name":"B.duck主题房【防滑凳】","price":"36.4","sale":"已售82件 好评100%","parent":"特色服务","cat":"亲子房补货"},"2235":{"id":"2235","name":"海底小纵队主题房【小书包】","price":"18.34","sale":"已售1.6万件 好评100%","parent":"特色服务","cat":"亲子房补货"},"9539":{"id":"9539","name":"【梦百合】高端酒店同款枕头-含礼品盒","price":"198.00","sale":"已售2.2万件 好评100%","parent":"特色服务","cat":"舒睡房补货","params":{"品牌":"梦百合","箱规":"1个/箱","支持定制":"否","质量保证期":"3年","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-5星"}},"9533":{"id":"9533","name":"【睡眠仪】自然音乐智能白噪音机","price":"98.00","sale":"已售238件 好评100%","parent":"特色服务","cat":"舒睡房补货","params":{"品牌":"携程舒睡房","箱规":"/","支持定制":"否","质量保证期":"/","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-4星"}},"7483":{"id":"7483","name":"太空深睡记忆枕芯(70*42*10cm)","price":"85.00","sale":"已售1602件 好评100%","parent":"特色服务","cat":"舒睡房补货","params":{"品牌":"随心空间","箱规":"1","支持定制":"否","质量保证期":"10","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-5星"}},"9385":{"id":"9385","name":"舒睡房物料-助眠礼包","price":"12.00","sale":"已售1522件","parent":"特色服务","cat":"舒睡房补货","params":{"品牌":"携程舒睡房","箱规":"/","支持定制":"否","质量保证期":"/","最小起订量":"1","支持试用":"否","发货周期":"48小时发货","适用酒店":"3-4星"}},"59381":{"id":"59381","name":"海尔磁疗枕","price":"30.0","sale":"已售1.3万件","parent":"特色服务","cat":"舒睡房补货"},"18103":{"id":"18103","name":"添眠深睡枕","price":"30.0","sale":"已售18件","parent":"特色服务","cat":"舒睡房补货"},"9037":{"id":"9037","name":"携程舒睡房-合作意向","price":"0.01","sale":"已售258件","parent":"特色服务","cat":"舒睡房补货"},"18101":{"id":"18101","name":"添眠荷叶护颈枕","price":"30.0","sale":"已售3.1万件","parent":"特色服务","cat":"舒睡房补货"},"8569":{"id":"8569","name":"携程热敷暖颈围脖（25片/包）","price":"74.1","sale":"已售32件","parent":"特色服务","cat":"舒睡房补货"},"8567":{"id":"8567","name":"携程热敷蒸汽眼罩（25片/包）","price":"63.2","sale":"已售127件 好评100%","parent":"特色服务","cat":"舒睡房补货"},"67453":{"id":"67453","name":"舒睡房-蒸汽眼罩暖颈贴对客礼包（25份）","price":"120.0","sale":"本月上新","parent":"特色服务","cat":"舒睡房补货"},"9535":{"id":"9535","name":"舒睡房物料-门牌台卡","price":"20.2","sale":"已售<10件","parent":"特色服务","cat":"舒睡房补货"},"9531":{"id":"9531","name":"舒睡房物料-抱枕地毯","price":"43.0","sale":"已售22件","parent":"特色服务","cat":"舒睡房补货"},"58667":{"id":"58667","name":"暖友-柠檬马鞭草凉感眼罩","price":"68.64","sale":"90天已售<10件","parent":"特色服务","cat":"舒睡房补货"},"58665":{"id":"58665","name":"暖友-薰衣草凉感眼罩","price":"68.64","sale":"90天已售<10件","parent":"特色服务","cat":"舒睡房补货"},"9521":{"id":"9521","name":"舒睡房物料-床旗","price":"143.0","sale":"已售<10件","parent":"特色服务","cat":"舒睡房补货"},"58669":{"id":"58669","name":"暖友41°C-热敷腰腹带","price":"98.4","sale":"90天已售<10件","parent":"特色服务","cat":"舒睡房补货"},"18199":{"id":"18199","name":"添眠水气浮力枕F2","price":"287.0","sale":"已售<10件","parent":"特色服务","cat":"舒睡房补货"},"9529":{"id":"9529","name":"舒睡房物料-轻松夜主题","price":"680.0","sale":"已售26件","parent":"特色服务","cat":"舒睡房补货"},"18197":{"id":"18197","name":"添眠智能止鼾枕Z6","price":"1919.0","sale":"已售<10件","parent":"特色服务","cat":"舒睡房补货"},"4632":{"id":"4632","name":"喜临门-酒店同款枕头","price":"99.0","sale":"已售<10件","parent":"特色服务","cat":"舒睡房补货"},"7591":{"id":"7591","name":"青柠-运营补差价专用","price":"1.00","sale":"已售25件","parent":"特色服务","cat":"影音房补货","params":{"品牌":"青柠","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"24小时发货","适用酒店":"0-3星"}},"21067":{"id":"21067","name":"影音房-创维产品商用版权续约","price":"300.00","sale":"已售<10件","parent":"特色服务","cat":"影音房补货","params":{"品牌":"腾讯视频会员","箱规":"1年","支持定制":"是","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"24小时发货","适用酒店":"3-5星"}},"17043":{"id":"17043","name":"片源续费——现金支付","price":"240.00","sale":"已售<10件","parent":"特色服务","cat":"影音房补货","params":{"品牌":"青柠","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"24小时发货","适用酒店":"2-4星"}},"51775":{"id":"51775","name":"片源续费——现金支付","price":"240.00","sale":"90天已售<10件","parent":"特色服务","cat":"影音房补货","params":{"品牌":"青柠","箱规":"1","支持定制":"否","质量保证期":"1","最小起订量":"1","支持试用":"否","发货周期":"24小时发货","适用酒店":"2-4星"}},"8589":{"id":"8589","name":"云迹双舱格格青春版送物机器人","price":"13000.00","sale":"已售125件","parent":"特色服务","cat":"智能专区","params":{"品牌":"云迹","箱规":"65*65*125","支持定制":"否","质量保证期":"1年","最小起订量":"1台","支持试用":"否","发货周期":"7天内发货","适用酒店":"3-5星"}},"5027":{"id":"5027","name":"无忧服务包","price":"3980.00","sale":"已售120件 好评100%","parent":"特色服务","cat":"智能专区","params":{"品牌":"云迹科技","箱规":"无","质量保证期":"1年","最小起订量":"1","发货周期":"7天内发货","适用酒店":"3-5星"}},"62113":{"id":"62113","name":"【森林王子】标准版","price":"1.00","sale":"已售10件","parent":"特色服务","cat":"智能专区","params":{"品牌":"森林王子","箱规":"(mm):485x300x925","支持定制":"否","质量保证期":"一年","最小起订量":"1","支持试用":"否","发货周期":"3天内发货","适用酒店":"3-5星"}},"5036":{"id":"5036","name":"五星服务包","price":"3480.00","sale":"已售354件 好评100%","parent":"特色服务","cat":"智能专区","params":{"品牌":"云迹科技","箱规":"无","质量保证期":"1年","最小起订量":"1","发货周期":"7天内发货","适用酒店":"3-5星"}},"45153":{"id":"45153","name":"厂家直销-程呈送双舱青春版送物机器人","price":"1.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"17803":{"id":"17803","name":"酒店AI运营服务管家","price":"1.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"4211":{"id":"4211","name":"擎朗酒店送物机器人W3 Plus","price":"15800.0","sale":"已售89件 好评100%","parent":"特色服务","cat":"智能专区"},"67573":{"id":"67573","name":"安心泳池全年托管服务","price":"3980.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"9981":{"id":"9981","name":"九号单仓送物机器人飞碟","price":"11900.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"62121":{"id":"62121","name":"【森林王子】桌面版","price":"3699.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"9069":{"id":"9069","name":"厂家直销-程呈送双舱送物机器人","price":"16999.0","sale":"已售18件","parent":"特色服务","cat":"智能专区"},"7125":{"id":"7125","name":"程呈送机器人延保产品","price":"1.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"67965":{"id":"67965","name":"普渡机器人以旧换新","price":"1.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"19537":{"id":"19537","name":"UP分体多态机器人-青春版-送物仓","price":"8000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"6497":{"id":"6497","name":"桌面款自助机","price":"68000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"67575":{"id":"67575","name":"安心泳池认证服务｜泳池数字档案管理+水质检测记录","price":"499.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"19533":{"id":"19533","name":"UP分体多态机器人-青春版-地盘","price":"10000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"30189":{"id":"30189","name":"云迹煮面机器人","price":"68000.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"9139":{"id":"9139","name":"擎朗送物机器人W3 Lite青春版","price":"13000.0","sale":"已售47件","parent":"特色服务","cat":"智能专区"},"6495":{"id":"6495","name":"碰一下住酒店","price":"1000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9435":{"id":"9435","name":"平板自助入住管家","price":"29800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9439":{"id":"9439","name":"双屏台式自助机","price":"29800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"8259":{"id":"8259","name":"未来酒店刷脸开门","price":"1800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"8251":{"id":"8251","name":"立式自助入住机","price":"46800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"6487":{"id":"6487","name":"酒店AI智能体","price":"35800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"6489":{"id":"6489","name":"高端商务款立式机","price":"68000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"67967":{"id":"67967","name":"顺榄一元补差价链接（维保续费）","price":"1.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"8601":{"id":"8601","name":"程呈送双舱送物机器人-皮肤","price":"1.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"2757":{"id":"2757","name":"爱奇艺VR影院","price":"7999.0","sale":"已售68件 好评100%","parent":"特色服务","cat":"智能专区"},"55071":{"id":"55071","name":"美宿云&天猫精灵智慧住中服务方案","price":"30.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"4665":{"id":"4665","name":"前置仓（制冷版）","price":"10000.0","sale":"已售25件","parent":"特色服务","cat":"智能专区"},"63597":{"id":"63597","name":"四年联保五星服务包","price":"8333.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"3882":{"id":"3882","name":"智慧酒店客控系统","price":"2518.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"63599":{"id":"63599","name":"四年联保无忧服务包","price":"9666.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"9137":{"id":"9137","name":"擎朗清洁机器人C30","price":"28800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"54755":{"id":"54755","name":"AI-OMS系统","price":"100.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"63547":{"id":"63547","name":"智慧酒店 客控","price":"999.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"4998":{"id":"4998","name":"天猫精灵轻智能客房","price":"299.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"4809":{"id":"4809","name":"天猫精灵IN糖pro酒店版","price":"299.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"4118":{"id":"4118","name":"智能生态房","price":"1280.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"62125":{"id":"62125","name":"【森林王子】豪华版","price":"8999.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"22911":{"id":"22911","name":"3D易眠房","price":"680.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"10579":{"id":"10579","name":"UP分体多态机器人-青春版","price":"26999.0","sale":"已售11件","parent":"特色服务","cat":"智能专区"},"4215":{"id":"4215","name":"擎朗智能货柜W3M3","price":"16000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"8087":{"id":"8087","name":"鹿马手持式大掌柜DM01","price":"7200.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"8627":{"id":"8627","name":"鹿马高端立式VK02自助机","price":"23000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"63555":{"id":"63555","name":"智慧客房","price":"1299.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"9175":{"id":"9175","name":"鹿马-X45星耀白入住机","price":"14800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"8625":{"id":"8625","name":"鹿马标准台式X70自助机","price":"19800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9177":{"id":"9177","name":"鹿马-T700嵌入一体式入住机","price":"20800.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"7239":{"id":"7239","name":"IMBODY智能力量健身镜POWER S","price":"4999.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"7687":{"id":"7687","name":"涂鸦智慧酒店智能客控智慧楼宇","price":"1988.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"67571":{"id":"67571","name":"Novanine AI智能泳池机器人（商用版）｜酒店民宿泳池智能清洁设备","price":"7999.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"54753":{"id":"54753","name":"电话AI管家","price":"4800.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"9143":{"id":"9143","name":"擎朗机器人维保","price":"3080.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"24725":{"id":"24725","name":"货柜五星服务包","price":"1580.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"9373":{"id":"9373","name":"终身质保-程呈送双舱送物机器人","price":"18999.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9133":{"id":"9133","name":"擎朗送餐机器人-T3","price":"34000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"17393":{"id":"17393","name":"九号送物机器人维保增值版","price":"4000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9131":{"id":"9131","name":"擎朗送餐机器人-T9","price":"26000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"17391":{"id":"17391","name":"九号送物机器人维保基础版","price":"2000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9135":{"id":"9135","name":"擎朗送餐机器人T10","price":"37000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"8613":{"id":"8613","name":"智慧客房","price":"1299.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"4622":{"id":"4622","name":"擎朗送餐机器人T8","price":"25000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"63361":{"id":"63361","name":"自助入住机（立式）","price":"25800.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"57007":{"id":"57007","name":"自助入住机（嵌入式）","price":"23800.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"57005":{"id":"57005","name":"自助入住机（台式双屏）","price":"20800.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"57003":{"id":"57003","name":"自助入住机（台式单屏）","price":"18800.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"9983":{"id":"9983","name":"九号多仓送物机器人方糖","price":"18000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"9011":{"id":"9011","name":"科沃斯商用扫地机器人DEEBOT PRO K1 VAC","price":"55000.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"19535":{"id":"19535","name":"UP分体多态机器人-青春版-清洁仓","price":"10999.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"15717":{"id":"15717","name":"enabot家庭机器人EBO Air 2全屋移动监控摄像头 老人小孩宠物AI陪伴","price":"999.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"15449":{"id":"15449","name":"元萝卜SenseRobotAI下棋学练机器人 象棋 围棋 国际象棋 五子棋【四合","price":"2999.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"66325":{"id":"66325","name":"普渡送物机器人闪电匣lite","price":"11980.0","sale":"本月上新","parent":"特色服务","cat":"智能专区"},"55069":{"id":"55069","name":"美宿云人机协同住中服务方案","price":"2300.0","sale":"90天已售<10件","parent":"特色服务","cat":"智能专区"},"19427":{"id":"19427","name":"闪电匣配送服务机器人","price":"11999.0","sale":"已售<10件","parent":"特色服务","cat":"智能专区"},"4545":{"id":"4545","name":"擎朗生意通充值专拍","price":"20.0","sale":"已售53件 好评100%","parent":"特色服务","cat":"智能专区"},"2814":{"id":"2814","name":"云迹生意通自拓单专拍","price":"1.0","sale":"已售1563件 好评100%","parent":"特色服务","cat":"智能专区"},"2758":{"id":"2758","name":"爱奇艺VR100元代金券","price":"100.0","sale":"已售419件 好评100%","parent":"特色服务","cat":"智能专区"},"6491":{"id":"6491","name":"未来前台补差价链接","price":"1.0","sale":"已售71件","parent":"特色服务","cat":"智能专区"},"61261":{"id":"61261","name":"携旅免房置换","price":"1.00","sale":"已售39件","parent":"特色服务","cat":"软件系统","params":{"品牌":"携旅","质量保证期":"3年","最小起订量":"1","适用酒店":"2-4星"}},"18099":{"id":"18099","name":"定制酒店客房电视UI系统服务","price":"60.00","sale":"已售14件 好评100%","parent":"特色服务","cat":"软件系统","params":{"品牌":"小帅","质量保证期":"1年","最小起订量":"20","适用酒店":"3-5星"}},"17423":{"id":"17423","name":"西软云酒店管理软件","price":"120000.00","sale":"已售36件","parent":"特色服务","cat":"软件系统","params":{"品牌":"西软","箱规":"0","质量保证期":"1年","最小起订量":"1","发货周期":"7天内发货","适用酒店":"3-5星"}},"4498":{"id":"4498","name":"【PMS.酒店管理系统.OTA直连】旅悦酒店房态综合管理系统（XPMS）软件","price":"0.01","sale":"已售39件","parent":"特色服务","cat":"软件系统","params":{"品牌":"XPMS","质量保证期":"1年","最小起订量":"1","适用酒店":"3-4星"}},"67969":{"id":"67969","name":"美宿云补差价链接","price":"1.0","sale":"本月上新","parent":"特色服务","cat":"软件系统"},"17665":{"id":"17665","name":"腾讯极光TV酒店商用版VIP1年续约","price":"1.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"17685":{"id":"17685","name":"沐廉AI数字名片（个人名片+客户crm管理系统）","price":"1.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"3643":{"id":"3643","name":"华客CEM体验云系统","price":"7248.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"3738":{"id":"3738","name":"华客HQM质检云系统","price":"5500.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"18109":{"id":"18109","name":"酒店客房电视UI影视版权优酷年卡会员","price":"200.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"6229":{"id":"6229","name":"【酒店房态系统】麓途・PMS 全自动管理系统丨多平台实时同步","price":"1200.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"19575":{"id":"19575","name":"买一送一，同程智造酒店智能电视系统（支持定制）","price":"30.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"3490":{"id":"3490","name":"HDOS-AI智能管家","price":"7200.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"18107":{"id":"18107","name":"定制酒店客房电视UI盒子方案（盒子+UI系统+超级遥控器+选购影视会员年卡）","price":"400.0","sale":"已售<10件","parent":"特色服务","cat":"软件系统"},"2105":{"id":"2105","name":"【尊客】小垃圾袋含税包邮","price":"40.10","sale":"已售6.4万件 好评99%","parent":"特色服务","cat":"新人专区","params":{"品牌":"尊客","箱规":"2000","支持定制":"是","质量保证期":"2","最小起订量":"1000","支持试用":"是","发货周期":"24小时发货","适用酒店":"0-3星"}},"10207":{"id":"10207","name":"【恒创】秸秆竹炭软毛牙刷带牙膏套装","price":"40.10","sale":"已售18.1万件 好评100%","parent":"特色服务","cat":"新人专区","params":{"品牌":"AOLIYI","箱规":"1000/箱","支持定制":"是","质量保证期":"2年","最小起订量":"100","支持试用":"是","发货周期":"48小时发货","适用酒店":"0-3星"}},"3296":{"id":"3296","name":"新款牙具套装","price":"40.10","sale":"已售12.8万件 好评99%","parent":"特色服务","cat":"新人专区","params":{"品牌":"思扉尔","箱规":"1000支/箱","支持定制":"是","质量保证期":"2年","最小起订量":"100","支持试用":"是","发货周期":"3天内发货","适用酒店":"0-3星"}},"52457":{"id":"52457","name":"【恒创】4mm加厚防滑一次性拖鞋无纺布","price":"40.10","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区","params":{"品牌":"AOLIYI","箱规":"1000","支持定制":"是","质量保证期":"2年","最小起订量":"100","支持试用":"是","发货周期":"48小时发货","适用酒店":"0-3星"}},"6407":{"id":"6407","name":"娇维魅民宿客房洗护四件套","price":"40.1","sale":"已售57件 好评100%","parent":"特色服务","cat":"新人专区"},"52185":{"id":"52185","name":"【尊客】云栖一次性牙刷牙膏梳子 含税包邮","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52465":{"id":"52465","name":"鹏达/原生木浆/三层/77克小卷纸卫生纸有蕊卷纸","price":"0.67","sale":"已售3481件","parent":"特色服务","cat":"新人专区"},"54207":{"id":"54207","name":"一次性面巾毛巾 强力吸水 包邮含税","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52391":{"id":"52391","name":"鹏达/本色/2层/120抽/ 软抽纸面巾纸","price":"40.1","sale":"已售13件","parent":"特色服务","cat":"新人专区"},"52301":{"id":"52301","name":"若禺/擦手纸/2层加厚240张/包独立包装抽纸","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"62259":{"id":"62259","name":"【如漫】50克空芯卷纸","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52327":{"id":"52327","name":"【恒创】双层不锈钢刀剃须刀+5克剃须膏","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"10211":{"id":"10211","name":"【恒创】秸秆竹炭毛牙刷带牙膏牛皮纸套装","price":"40.1","sale":"已售2.9万件 好评100%","parent":"特色服务","cat":"新人专区"},"52305":{"id":"52305","name":"【红杉树】酒店一次性拉毛绒拖鞋","price":"40.1","sale":"90天已售<10件 好评100%","parent":"特色服务","cat":"新人专区"},"54143":{"id":"54143","name":"一次性儿童牙刷牙膏可爱卡通超细软毛牙具","price":"40.1","sale":"已售11件","parent":"特色服务","cat":"新人专区"},"69471":{"id":"69471","name":"【红杉树】一次性酒店帆麻拖鞋","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"69611":{"id":"69611","name":"30g洗衣液","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52451":{"id":"52451","name":"【恒创】一次性拖鞋儿童拖鞋加厚防滑","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"67913":{"id":"67913","name":"【红杉树】酒店民宿客房电吹风机折叠款","price":"48.5","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52299":{"id":"52299","name":"【尊客】300g大瓶装酒店洗发水沐浴露护发素","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52329":{"id":"52329","name":"【恒创】高档针线包6线2针2扣套装独立包装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52195":{"id":"52195","name":"【尊客】一次性面巾毛巾 强力吸水 包邮含税","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52389":{"id":"52389","name":"【含税包邮】 杭洁牌 黑色平口大垃圾袋 90*110cm 32克 50装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52393":{"id":"52393","name":"【恒创】开古一次性茶包红茶绿茶茉莉花茶","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"67899":{"id":"67899","name":"【奥泊美】双层防烫烧水壶自动断电电水壶","price":"49.0","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52191":{"id":"52191","name":"【尊客】无纺丝一次性牙刷牙膏梳子 含税包邮","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52435":{"id":"52435","name":"【恒创】一次性毛巾面巾洗脸巾独立包装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"67901":{"id":"67901","name":"【科瑞德】1.2L科瑞德星级酒店热水壶","price":"49.8","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52317":{"id":"52317","name":"【恒创】秸秆丽枫软毛牙刷软膜袋独立包装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52323":{"id":"52323","name":"【恒创】15克茉莉花香圆形香皂珠光膜独立包装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52385":{"id":"52385","name":"棉麻布防滑底大码酒店一次性拖鞋","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"69487":{"id":"69487","name":"【红杉树】岩栖系列一次性耗品六小件","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"68683":{"id":"68683","name":"【如漫】新人专享30克空芯卷纸","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"54255":{"id":"54255","name":"4mm加厚防滑一次性拖鞋拉毛绒","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"69429":{"id":"69429","name":"【尊客】加厚星光软膜竹炭毛软膜牙刷牙膏套装","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52351":{"id":"52351","name":"真美布面料一次性拖鞋","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"54141":{"id":"54141","name":"儿童软膜一次性牙刷牙膏 含税包邮","price":"40.1","sale":"已售23件","parent":"特色服务","cat":"新人专区"},"69041":{"id":"69041","name":"徕芬1600W高速电吹风机 SWIFT4（含顺滑风嘴+润养风嘴+润养舱）","price":"680.0","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"68693":{"id":"68693","name":"【如漫】新人专享客房60克空芯卷纸","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"3295":{"id":"3295","name":"非繁系列一次性软管洗沐","price":"40.1","sale":"已售253件 好评100%","parent":"特色服务","cat":"新人专区"},"54215":{"id":"54215","name":"儿童软膜一次性牙刷牙膏 含税包邮","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"69273":{"id":"69273","name":"【红杉树】客房一次性套装床上四件套","price":"7.5","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"69285":{"id":"69285","name":"【新品】米佳铝膜一次性牙刷牙膏梳子","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"69521":{"id":"69521","name":"【红杉树】浅系列一次性酒店牙具梳子耗品套装","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"54203":{"id":"54203","name":"小黄鸭主题房【儿童洗护】 套装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"68739":{"id":"68739","name":"【尊客】加厚星光软膜瓷白软膜牙刷牙膏套装","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52403":{"id":"52403","name":"【恒创】开古一次性茶包保鲜红茶绿茶茉莉花茶","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"68783":{"id":"68783","name":"【尊客】奶咖双色软毛牙刷牙膏套装加厚软膜包装","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"69465":{"id":"69465","name":"【红杉树】珍珠棉儿童一次性拖鞋","price":"40.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"52325":{"id":"52325","name":"【恒创】加大加厚高压条形浴帽洗澡防水头套","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"69021":{"id":"69021","name":"小米1600W负离子速干智能恒温护发电吹风机 H300","price":"95.0","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"62257":{"id":"62257","name":"【如漫】40克空芯卷纸","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"69703":{"id":"69703","name":"20ml软管一次性洗发水沐浴露 100瓶","price":"51.0","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"62197":{"id":"62197","name":"【如漫】卷纸抽纸专用","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52309":{"id":"52309","name":"【红杉树】一次性绵柔布珍珠棉拖鞋","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52303":{"id":"52303","name":"【尊客】20g简约锡封口一次性洗发水沐浴露宾馆专用小瓶装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"52319":{"id":"52319","name":"【恒创】高档软塑绿色长条梳拇指梳卡盒装","price":"40.1","sale":"90天已售<10件","parent":"特色服务","cat":"新人专区"},"4720":{"id":"4720","name":"【正执新汉方】养生茶彩盒","price":"40.1","sale":"已售57件 好评100%","parent":"特色服务","cat":"新人专区"},"69171":{"id":"69171","name":"科瑞德烧水壶家用一人小型1升酒店电热水壶","price":"85.0","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"69777":{"id":"69777","name":"【7毫米镶底款】米色细麻布一次性拖鞋防滑底","price":"42.1","sale":"本月上新","parent":"特色服务","cat":"新人专区"},"57057":{"id":"57057","name":"宴荟拍档置换专用","price":"100.00","sale":"90天已售<10件","parent":"特色服务","cat":"人才.教育","params":{"品牌":"宴荟拍档","质量保证期":"一年","最小起订量":"1","适用酒店":"3-5星"}},"52297":{"id":"52297","name":"中国酒店行动学习系列培训课程","price":"1.00","sale":"90天已售<10件","parent":"特色服务","cat":"人才.教育","params":{"品牌":"美连酒店管理（北京）有限公司","质量保证期":"1年","最小起订量":"1","适用酒店":"3-5星"}},"52295":{"id":"52295","name":"中国酒店行动学习VIP会员","price":"10.00","sale":"90天已售<10件","parent":"特色服务","cat":"人才.教育","params":{"品牌":"美连酒店管理（北京）有限公司","质量保证期":"1年","最小起订量":"1","适用酒店":"3-5星"}},"23567":{"id":"23567","name":"公牛（BULL）新国标过载超功率保护插座/插线板/插排/宿舍家用桌面排插 3C认","price":"34.20","sale":"已售42件 好评100%","parent":"特色服务","cat":"行政办公","params":{"品牌":"公牛（BULL）","箱规":"个","质量保证期":"3年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"42191":{"id":"42191","name":"沙宣大红瓶清盈顺柔洗发水750g士洗头膏洗发露蓬松轻盈去油清爽男女","price":"56.10","sale":"已售16件","parent":"特色服务","cat":"行政办公","params":{"品牌":"沙宣（VS）","箱规":"个","质量保证期":"无质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"42573":{"id":"42573","name":"京东京造青少年洗发水控油去屑洗发露13岁+中学生去油洗发水儿童500ml男女","price":"43.10","sale":"90天已售<10件 好评100%","parent":"特色服务","cat":"行政办公","params":{"品牌":"京东京造","箱规":"瓶","质量保证期":"无质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"58819":{"id":"58819","name":"联想扬天M4000q 商用办公台式电脑台式机主机(14代i3-14100 16G","price":"6793.00","sale":"90天已售<10件","parent":"特色服务","cat":"行政办公","params":{"品牌":"联想（Lenovo）","箱规":"台","质量保证期":"3年质保","最小起订量":"1","发货周期":"7天内发货","适用酒店":"0-3星"}},"30895":{"id":"30895","name":"纽曼无线家用智能AI摄像头1200万高清监控器360度无死角带夜视全景语音手机远","price":"78.4","sale":"90天已售<10件","parent":"特色服务","cat":"行政办公"},"31003":{"id":"31003","name":"机械师鼠标垫 游戏垫 鼠标垫电竞 笔记本电脑桌垫 锁边加厚防滑游戏鼠标垫小号 G","price":"12.7","sale":"已售15件","parent":"特色服务","cat":"行政办公"},"29279":{"id":"29279","name":"得力（deli）保险柜家用型保险箱指纹密码办公财务专用 全钢防盗防搬走可入衣柜 ","price":"547.0","sale":"90天已售<10件","parent":"特色服务","cat":"行政办公"},"66189":{"id":"66189","name":"沃韦朗（VOONLINE）鱼缸底砂 沙子雨林免洗南美细天然装饰石水草造景拉普拉砂","price":"28.8","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"54135":{"id":"54135","name":"得力蓝色A4双长压夹/单双强力夹/资料夹/插页试卷夹/文件夹5349","price":"9.3","sale":"90天已售<10件","parent":"特色服务","cat":"行政办公"},"18429":{"id":"18429","name":"百利文 百利文H136独立装蓝色手提袋文件袋拉链式公文包手提包资料袋办公会议档案","price":"9.4","sale":"已售32件","parent":"特色服务","cat":"行政办公"},"64773":{"id":"64773","name":"憨憨乐园宠物狗狗玩具棉绳耐咬互动训练惨叫鸡狗狗磨牙用品互动套装用品5","price":"19.9","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"65097":{"id":"65097","name":"JKULNING宠物狗狗玩具两种发声毛绒狗狗互动耐咬解闷中小犬菲兹狐互动玩具","price":"25.7","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"18311":{"id":"18311","name":"得力蓝色四联多层文件框/文件夹/收纳盒/文件架/立式书架/文件框/资料架 337","price":"19.5","sale":"已售<10件","parent":"特色服务","cat":"行政办公"},"66307":{"id":"66307","name":"森森鱼缸水族箱加热棒自动恒温防爆乌龟缸加温棒小型鱼缸加热器200W","price":"32.7","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"66053":{"id":"66053","name":"雪貂留香 狗狗沐浴露清洁祛味留香宠物香波抑菌止痒500ml","price":"32.8","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"65169":{"id":"65169","name":"福丸x小豆泥联名猫猫头猫薄荷玩具猫咪互动神器猫咪玩具玩偶","price":"36.8","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"65405":{"id":"65405","name":"BNBNO木天蓼磨牙棒猫玩具自嗨解闷猫薄荷球逗猫棒耐咬猫咪用品养猫神器","price":"6.6","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"65015":{"id":"65015","name":"赞宠狗狗玩具球 耐咬磨牙弹力球泰迪自嗨解闷实心橡胶球宠物训练","price":"9.4","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"65785":{"id":"65785","name":"憨憨乐园狗狗磨牙棒宠物狗咬胶狗零食泰迪金毛成犬幼犬专用洁齿骨头5寸","price":"15.7","sale":"本月上新","parent":"特色服务","cat":"行政办公"},"65585":{"id":"65585","name":"憨憨乐园宠物外出遛狗狗鞋防滑防水雨鞋泰迪比熊小型犬耐磨靴子鞋子脚套5","price":"16.4","sale":"本月上新","parent":"特色服务","cat":"行政办公"}};
const missingEl = new Proxy(function () {}, {
  get: () => missingEl,
  set: () => true,
  apply: () => missingEl
});
const $ = id => document.getElementById(id) || missingEl;
// 脱敏：从任意文本中抹掉 API Key / 令牌片段，避免错误信息回显 Key
function maskSecrets(text, extraKeys = []) {
  let out = String(text || '');
  const collect = [];
  try { collect.push(...Object.values(getAIConfig() || {})); } catch {}
  try { collect.push(...Object.values(getImageConfig() || {})); } catch {}
  collect.push(...extraKeys);
  const candidates = collect
    .filter(v => typeof v === 'string' && v.length >= 12 && /[A-Za-z0-9_-]/.test(v))
    .map(v => v.trim())
    .filter(Boolean);
  for (const key of candidates) {
    try {
      const esc = key.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
      out = out.replace(new RegExp(esc, 'g'), key.slice(0, 4) + '…' + key.slice(-4));
    } catch {}
  }
  out = out.replace(/\b(sk-[A-Za-z0-9_-]{12,}|sk-sp-[A-Za-z0-9_-]{12,}|sk-ws-[A-Za-z0-9_-]{12,}|LTAI[A-Za-z0-9]{16,})\b/g,
    m => m.slice(0, 4) + '…' + m.slice(-4));
  return out;
}
function readProxyBase() {
  try {
    const saved = localStorage.getItem('tripMall.proxyBase');
    if (saved && saved.trim()) return saved.trim().replace(/\/+$/, '');
  } catch {}
  return (window.TRIP_MALL_CONFIG?.API_BASE || '').replace(/\/+$/, '');
}
const API_BASE = readProxyBase();
const apiUrl = path => API_BASE + path;

async function apiRequest(path, payload, timeoutMs = 10000) {
  const controller = new AbortController();
  const timer = setTimeout(() => controller.abort(), timeoutMs);
  try {
    const response = await fetch(apiUrl(path), {
      method: 'POST', headers: {'Content-Type': 'application/json'},
      body: JSON.stringify(payload), signal: controller.signal
    });
    const contentType = response.headers.get('content-type') || '';
    if (!response.ok || !contentType.includes('application/json')) {
      throw new Error(`公网API不可用（${response.status}）`);
    }
    const data = await response.json();
    if (data.error) throw new Error(data.error);
    return data;
  } finally { clearTimeout(timer); }
}

function puterText(response) {
  if (typeof response === 'string') return response;
  const content = response?.message?.content ?? response?.content ?? response?.text;
  if (typeof content === 'string') return content;
  if (Array.isArray(content)) return content.map(item => item?.text || item?.content || '').join('\n');
  return String(response || '');
}

const IS_GITHUB_PAGES = window.location.hostname.endsWith('github.io');

function timeoutPromise(ms, message) {
  return new Promise((_, reject) => setTimeout(() => reject(new Error(message)), ms));
}

async function ensurePuterAuth() {
  if (!window.puter?.auth || !window.puter?.ai) {
    throw new Error('公共AI组件未加载，请按 Ctrl+F5 刷新页面');
  }
  const signedIn = await Promise.resolve(window.puter.auth.isSignedIn());
  if (!signedIn) {
    $('aiStatus').textContent = '公网AI：等待登录授权';
    await Promise.race([
      window.puter.auth.signIn(),
      timeoutPromise(30000, '登录窗口可能被拦截，请允许本站弹出窗口后点击“登录公共AI”')
    ]);
  }
  $('aiStatus').textContent = '公网AI：已连接';
}

async function puterChat(prompt, options = {}) {
  if (!window.puter?.ai?.chat) throw new Error('Puter AI 未加载，请刷新页面后重试');
  return puterText(await window.puter.ai.chat(prompt, options));
}

/* ============================ 自填 API Key（OpenAI 兼容，浏览器直连） ============================ */

const AI_PROVIDERS = {
  deepseek: {
    name: 'DeepSeek（推荐）', base: 'https://api.deepseek.com/v1', model: 'deepseek-chat', imageModel: '',
    models: ['deepseek-chat', 'deepseek-reasoner'], recommend: 'deepseek-chat'
  },
  siliconflow: {
    name: '硅基流动', base: 'https://api.siliconflow.cn/v1', model: 'deepseek-ai/DeepSeek-V3', imageModel: 'black-forest-labs/FLUX.1-schnell',
    models: ['deepseek-ai/DeepSeek-V3', 'Qwen/Qwen2.5-72B-Instruct', 'Qwen/Qwen2.5-7B-Instruct'], recommend: 'deepseek-ai/DeepSeek-V3'
  },
  zhipu: {
    name: '智谱GLM', base: 'https://open.bigmodel.cn/api/paas/v4', model: 'glm-4-plus', imageModel: '',
    models: ['glm-4-plus', 'glm-4-air', 'glm-4-flash'], recommend: 'glm-4-plus'
  },
  moonshot: {
    name: 'Kimi（月之暗面）', base: 'https://api.moonshot.cn/v1', model: 'moonshot-v1-32k', imageModel: '',
    models: ['moonshot-v1-32k', 'moonshot-v1-8k', 'kimi-latest'], recommend: 'moonshot-v1-32k'
  },
  dashscope: {
    name: '阿里云百炼（通义）', base: 'https://dashscope.aliyuncs.com/compatible-mode/v1', model: 'qwen-max', imageModel: '',
    models: ['qwen-max', 'qwen-plus', 'qwen-turbo'], recommend: 'qwen-max'
  },
  qianwen: {
    name: '千问AI平台 Token Plan（月付套餐）', base: 'https://token-plan.cn-beijing.maas.aliyuncs.com/compatible-mode/v1', model: 'qwen3.8-max', imageModel: 'qwen-image-3.0-pro',
    models: ['qwen3.8-max', 'qwen3.7-max', 'qwen3.7-plus', 'qwen3.6-flash', 'deepseek-v4-pro', 'deepseek-v4-flash', 'glm-5.2'], recommend: 'qwen3.8-max'
  },
  openai: {
    name: 'OpenAI', base: 'https://api.openai.com/v1', model: 'gpt-4o', imageModel: 'gpt-image-1',
    models: ['gpt-4o', 'gpt-4o-mini'], recommend: 'gpt-4o'
  },
  custom: { name: '自定义', base: '', model: '', imageModel: '', models: [], recommend: '' }
};

const AI_KEY = 'tripMall.aiConfig';

function getAIConfig() {
  return lsGet(AI_KEY, { mode: 'vercel', provider: 'deepseek', apiKey: '', model: '', baseUrl: '' });
}

function hasByok() {
  const cfg = getAIConfig();
  return cfg.mode === 'byok' && !!cfg.apiKey;
}

function getImageConfig() {
  const cfg = getAIConfig();
  if (cfg.mode !== 'byok') return null;
  let providerKey = cfg.imageProvider || cfg.provider;
  const provider = AI_PROVIDERS[providerKey] || AI_PROVIDERS.custom;
  let key = cfg.imageKey || '';
  // 百炼/Token Plan：文字服务商同名时才可复用文字 Key；否则必须单独填专属图片 Key（不能把 DeepSeek/硅基的 Key 发过去）
  if (!key && (providerKey === 'dashscope' || providerKey === 'qianwen') && cfg.provider === providerKey) key = cfg.apiKey || '';
  if (!key && providerKey !== 'dashscope' && providerKey !== 'qianwen') key = cfg.apiKey || '';
  if (!key) return null;
  if (providerKey === 'dashscope' && /^sk-sp-/i.test(key)) providerKey = 'qianwen'; // Token Plan 专属 Key 自动识别
  // Token Plan：sk-sp- Key 只认 token-plan 域名；旧配置里若还留着百炼地址则强制换回默认地址
  const base = providerKey === 'qianwen'
    ? (String(cfg.imageBaseUrl || '').includes('token-plan') ? cfg.imageBaseUrl : 'https://token-plan.cn-beijing.maas.aliyuncs.com')
    : (cfg.imageBaseUrl || provider.base);
  const model = cfg.imageModel || (providerKey === 'qianwen' || providerKey === 'dashscope' ? 'qwen-image-3.0-pro' : provider.imageModel);
  if (!model) return null;
  return { provider: providerKey, base, key, model };
}

function hasByokImage() {
  return !!getImageConfig();
}

function imageConfigError() {
  const cfg = getAIConfig();
  if (cfg.mode !== 'byok') return '未配置自填 AI：请在「AI 设置」里开启自填 AI 并填写服务商与 Key。';
  const providerKey = cfg.imageProvider || cfg.provider;
  if ((providerKey === 'dashscope' || providerKey === 'qianwen') && !(cfg.imageKey || (cfg.provider === providerKey && cfg.apiKey))) {
    return providerKey === 'qianwen'
      ? 'Token Plan 图片 Key 未配置：AI 设置 → 图片生成 → 图片服务商选「千问AI平台 Token Plan（月付套餐）」，图片 API Key 填千问AI平台 Token Plan 页面里的专属 Key（sk-sp- 开头）。'
      : '百炼图片 Key 未配置：AI 设置 → 图片生成 → 图片 API Key 需单独填百炼控制台里 sk- 开头的 Key（不能复用 DeepSeek/硅基的文字 Key，否则报 InvalidApiKey）。';
  }
  const provider = AI_PROVIDERS[providerKey] || AI_PROVIDERS.custom;
  if (!cfg.imageModel && !provider.imageModel) {
    return `图片模型未配置：请在「AI 设置」里填写图片模型（${providerKey === 'dashscope' || providerKey === 'qianwen' ? '推荐 qwen-image-3.0-pro' : '如 black-forest-labs/FLUX.1-schnell'}）。`;
  }
  return '未配置图片生成：请先在「AI 设置」里把图片服务商设为阿里云百炼 / 千问AI平台 Token Plan（月付套餐）或智谱 CogView 并填写 Key。';
}

async function openAILikeChat(system, user, { maxTokens = 3000, temperature = 0.85, deep = false } = {}) {
  const cfg = getAIConfig();
  const provider = AI_PROVIDERS[cfg.provider] || AI_PROVIDERS.custom;
  // 深度思考：优先切到带思考能力的模型
  const deepModel = {
    deepseek: 'deepseek-reasoner',
    siliconflow: 'deepseek-ai/DeepSeek-R1',
    dashscope: 'qwen3-max',
    qianwen: 'qwen3.7-max',
    zhipu: 'glm-4-plus',
    moonshot: 'kimi-latest',
    openai: 'gpt-4o'
  }[cfg.provider] || '';
  const effModel = deep && deepModel ? deepModel : (cfg.model || provider.model);
  if (deep) maxTokens = Math.max(maxTokens, 8000);
  // Token Plan 接口未开放浏览器跨域，文本统一走服务端中转
  if (cfg.provider === 'qianwen') {
    if (!API_BASE) throw new Error('Token Plan 文本接口需要服务端中转，请在部署环境中使用（当前页面未配置 API_BASE）。');
    const messages = [];
    if (system) messages.push({ role: 'system', content: system });
    messages.push({ role: 'user', content: user });
    // 优先异步（短提交+轮询，绕开同步长连接超时）；异步接口不可用时回退同步
    let asyncTaskId = '';
    try {
      const submitResp = await fetch(apiUrl('/api/token-plan-text-async'), {
        method: 'POST',
        headers: { 'Content-Type': 'application/json' },
        signal: AbortSignal.timeout(25000),
        body: JSON.stringify({ apiKey: cfg.apiKey, model: effModel, messages, max_tokens: maxTokens, temperature })
      });
      const submitData = await submitResp.json().catch(() => ({}));
      if (submitResp.ok && submitData.task_id) {
        asyncTaskId = submitData.task_id;
        const started = Date.now();
        while (Date.now() - started < 600000) {
          await new Promise(r => setTimeout(r, 4000));
          const taskResp = await fetch(apiUrl('/api/token-plan-text-task'), {
            method: 'POST',
            headers: { 'Content-Type': 'application/json' },
            signal: AbortSignal.timeout(25000),
            body: JSON.stringify({ task_id: asyncTaskId, apiKey: cfg.apiKey })
          });
          const taskData = await taskResp.json().catch(() => ({}));
          if (!taskResp.ok) throw new Error(taskData.error || `任务查询失败（${taskResp.status}）`);
          const status = String(taskData.task_status || 'RUNNING');
          if (status === 'SUCCEEDED' && taskData.content) return String(taskData.content);
          if (status === 'FAILED') throw new Error(taskData.message || '文本任务生成失败');
        }
        throw new Error('文本任务超过10分钟未完成，请稍后重试');
      }
    } catch (asyncErr) {
      if (asyncTaskId) throw asyncErr; // 任务已提交，勿重复调用/计费
      // 异步接口不可用（如模型/套餐不支持异步）时，落到下面走同步
    }
    const callChat = async () => {
      const res = await fetch(apiUrl('/api/token-plan-chat'), {
        method: 'POST',
        headers: { 'Content-Type': 'application/json' },
        body: JSON.stringify({ apiKey: cfg.apiKey, model: effModel, messages, max_tokens: maxTokens, temperature })
      });
      if (!res.ok) {
        const ct = res.headers.get('content-type') || '';
        const payload = ct.includes('application/json') ? await res.json().catch(() => ({})) : {};
        return { error: payload.error || `Token Plan 文本中转错误（${res.status}）` };
      }
      const data = await res.json();
      if (data.content) return { content: data.content };
      return { error: 'Token Plan 返回内容为空' };
    };
    let firstError = '';
    for (let attempt = 0; attempt < 2; attempt++) {
      try {
        const result = await callChat();
        if (result.content) return result.content;
        firstError = result.error || 'Token Plan 返回内容为空';
        // 仅对连接超时类错误再重试一次，其他错误直接返回
        if (!/timed out|timeout|connect|Failed to fetch|网络/i.test(firstError)) break;
      } catch (fetchError) {
        firstError = fetchError.message || 'Failed to fetch';
      }
    }
    const isLinkIssue = /timed out|timeout|connect|Failed to fetch|网络/i.test(firstError);
    const hint = isLinkIssue
      ? '（中转→阿里云连接受限，多为跨境链路临时抖动，已自动重试仍失败，请稍后再试；仍不行可把文字服务商改为 阿里云百炼按量 / DeepSeek / 硅基流动 直连，不依赖中转、更稳定）'
      : `（请确认中转后端已部署且当前网络能访问 ${API_BASE || '中转地址'}；仍不行可把文字服务商改为 阿里云百炼按量 / DeepSeek / 硅基流动 直连）`;
    throw new Error(`Token Plan 文本生成失败：${firstError}${hint}`);
  }
  const base = (cfg.baseUrl || provider.base).replace(/\/+$/, '');
  if (!base) throw new Error('请先在 AI 设置里填写接口地址');
  const model = effModel || 'gpt-4o-mini';
  const messages = [];
  if (system) messages.push({ role: 'system', content: system });
  messages.push({ role: 'user', content: user });
  const response = await fetch(base + '/chat/completions', {
    method: 'POST',
    headers: { 'Content-Type': 'application/json', 'Authorization': 'Bearer ' + cfg.apiKey },
    body: JSON.stringify({ model, messages, max_tokens: maxTokens, temperature })
  });
  if (!response.ok) {
    const text = await response.text().catch(() => '');
    throw new Error(`AI接口错误（${response.status}）：${maskSecrets(String(text).slice(0, 200), [cfg.apiKey])}`);
  }
  const data = await response.json();
  const content = data.choices?.[0]?.message?.content;
  if (!content) throw new Error('AI 返回内容为空');
  return content;
}

async function dashscopeImage(prompt, { aspect = 'square', reference = null, references = null, size = '', strictRef = false, onStatus = null } = {}) {
  const img = getImageConfig();
  const isTokenPlan = img.provider === 'qianwen';
  const providerLabel = isTokenPlan ? 'Token Plan' : '百炼';
  const refs = (Array.isArray(references) ? references.filter(Boolean) : (reference ? [reference] : [])).slice(0, 3);
  const isEdit = refs.length > 0;
  const isV3 = /3\.0/i.test(img.model || '');
  let model;
  if (isV3) {
    model = img.model; // qwen-image-3.0 / 3.0-pro 统一支持文生图与参考图编辑
  } else if (isEdit) {
    model = /edit/i.test(img.model) ? img.model : 'qwen-image-edit';
  } else {
    model = img.model || 'qwen-image';
  }
  const content = [];
  for (const r of refs) content.push({ image: r });
  content.push({ text: prompt });
  const parameters = { watermark: false };
  if (isV3) {
    // 严格对齐阿里云控制台生成海报的初始设置：
    // 不传 size（分辨率由模型 auto 推荐）、不传 prompt_extend / negative_prompt 等自定义参数，
    // 只发 model + 指令，跟官网试用完全一致（qwen-image-3.0 / 3.0-pro 通用）
  } else {
    // Token Plan 官方示例与旧版 qwen-image 都支持 size；参考图编辑时百炼 qwen-image-edit 不传 size
    if (!isEdit || isTokenPlan) {
      parameters.size = size || (aspect === '9:16' ? '1080*1920' : (aspect === '16:9' ? '1920*1080' : '1024*1024'));
    }
    if (!isEdit) {
      parameters.negative_prompt = '低质量、模糊、畸形、水印、杂乱构图、乱码、白边、白框';
    }
  }
  // Token Plan 接口未开放浏览器跨域（官方设计给服务端工具用），优先走网站自带中转；
  // 中转不可用时才尝试直连（直连在浏览器里通常会因跨域失败）
  let proxyError = null;
  if (isTokenPlan && API_BASE) {
    // 先做一次轻量健康自检：快速区分"中转不可达"（网络问题）与"生成超时"，
    // 避免用户等完整生成后才看到 Failed to fetch
    try {
      const healthResp = await fetch(apiUrl('/api/health'), { signal: AbortSignal.timeout(15000) });
      if (!healthResp.ok) throw new Error('HTTP ' + healthResp.status);
    } catch (healthError) {
      throw new Error(`中转服务不可达：当前网络访问不了 ${API_BASE || '中转地址'}（${healthError.message || 'Failed to fetch'}）。请在你浏览器打开 ${API_BASE || '中转地址'}/api/health 自测：打不开 = 网络/运营商拦截，或该中转已下线；若确认打不开，请把图片服务商换成「阿里云百炼（按量）直连」（浏览器可直连、不依赖中转），或在「AI 设置 → 服务端中转接口地址」填入你在阿里云函数计算部署好的中转地址。`);
    }
    const proxyBody = {
      apiKey: img.key,
      model,
      prompt,
      references: refs,
      reference: refs[0] || '',
      size: parameters.size || '',
      prompt_extend: parameters.prompt_extend === undefined ? undefined : !!parameters.prompt_extend,
      negative_prompt: parameters.negative_prompt || '',
      watermark: parameters.watermark !== false
    };
    // 异步任务制（推荐）：提交秒回 task_id，再轮询结果，绕开中转 60 秒上限
    // Token Plan 图片为同步多模态生成（无稳定异步接口），直接走同步中转并放宽等待，避免异步挂起/重复计费
    try {
      const proxyResp = await fetch(apiUrl('/api/token-plan-image'), {
        method: 'POST',
        headers: { 'Content-Type': 'application/json' },
        signal: AbortSignal.timeout(300000),
        body: JSON.stringify(proxyBody)
      });
      if (proxyResp.ok) {
        const proxyCt = proxyResp.headers.get('content-type') || '';
        if (!proxyCt.includes('application/json')) {
          throw new Error('中转后端返回的不是 JSON（可能被部署保护/认证页拦截）');
        }
        const proxyData = await proxyResp.json();
        if (proxyData.image) {
          return proxyData.image.startsWith('data:') ? proxyData.image : toSafeDataURL(proxyData.image);
        }
        throw new Error(proxyData.error || '中转未返回图片');
      }
      const proxyCt = proxyResp.headers.get('content-type') || '';
      const proxyErr = proxyCt.includes('application/json') ? (await proxyResp.json().catch(() => ({}))) : {};
      throw new Error(proxyErr.error || `中转接口错误（${proxyResp.status}）`);
    } catch (error) {
      proxyError = error;
    }
  }
  // Token Plan：sk-sp- 专属 Key 只认 token-plan 域名，绝不回退百炼通用域名；
  // 百炼：自定义地址（业务空间专属域名等）→ 国内版 → 国际版；401 时自动换域名重试
  const bases = isTokenPlan
    ? [img.base]
    : [img.base, 'https://dashscope.aliyuncs.com', 'https://dashscope-intl.aliyuncs.com'];
  const endpoints = [...new Set(bases
    .map(b => String(b || '').replace(/\/+$/, '').replace(/\/compatible-mode(\/v1)?$/, ''))
    .filter(b => /^https?:\/\//i.test(b))
    .map(b => b + '/api/v1/services/aigc/multimodal-generation/generation'))];
  const call = (endpoint, params) => fetch(endpoint, {
    method: 'POST',
    headers: { 'Content-Type': 'application/json', 'Authorization': 'Bearer ' + img.key },
    body: JSON.stringify({
      model,
      input: { messages: [{ role: 'user', content }] },
      parameters: params
    })
  });
  let response = null;
  let usedEndpoint = endpoints[0];
  for (const endpoint of endpoints) {
    try {
      response = await call(endpoint, parameters);
    } catch (error) {
      response = null; // 网络/跨域失败，换下一个域名
      usedEndpoint = endpoint;
      continue;
    }
    usedEndpoint = endpoint;
    if (response.ok) break;
    if (response.status !== 401) break; // 仅鉴权失败才换域名，其他错误直接返回
  }
  // 参数降级重试：先去 prompt_extend，再去 watermark，避免 Token Plan/百炼个别参数校验严格
  if (response && !response.ok && response.status !== 401) {
    const attempts = [parameters];
    const last = attempts[attempts.length - 1];
    if (isV3 && last.size) attempts.push({ ...last, size: undefined });
    if (isV3 && last.prompt_extend) attempts.push({ ...last, prompt_extend: false });
    if (attempts[attempts.length - 1].negative_prompt) attempts.push({ ...attempts[attempts.length - 1], negative_prompt: undefined });
    if (attempts[attempts.length - 1].watermark) attempts.push({ ...attempts[attempts.length - 1], watermark: false });
    for (const params of attempts.slice(1)) {
      const retry = await call(usedEndpoint, params).catch(() => null);
      if (retry && retry.ok) { response = retry; break; }
    }
  }
  if (!response) {
    if (isTokenPlan) {
      throw new Error(
        `Token Plan 接口不支持浏览器直连（官方未开放跨域），必须走服务端中转；中转调用失败：${proxyError ? proxyError.message : '中转后端未部署或不可达'}。请在你浏览器打开 ${API_BASE || '中转地址'}/api/health 自测：打不开 = 当前网络访问不了该中转，请改用「阿里云百炼（按量）直连」（浏览器可直连、不依赖中转，参考图编辑同样可用），或在「AI 设置 → 服务端中转接口地址」填入你在阿里云函数计算部署好的中转地址；若 health 能打开但生成超时，说明生成耗时较长，请把参考图再压缩后重试。`
      );
    }
    throw new Error(`${providerLabel}接口连接失败（网络或跨域被拦截），请刷新后重试，或检查图片接口地址。`);
  }
  if (!response.ok) {
    const text = await response.text().catch(() => '');
    const maskedKey = img.key ? `${img.key.slice(0, 6)}…${img.key.slice(-4)}` : '未填写';
    throw new Error(`${providerLabel}图片接口错误（${response.status}）：${maskSecrets(dashErrorText(text, { provider: img.provider }), [img.key])}（当前使用的图片 Key：${maskedKey}）`);
  }
  const data = await response.json();
  const out = data.output || {};
  let url = out.images?.[0]?.url;
  const contentArr = out.choices?.[0]?.message?.content;
  if (Array.isArray(contentArr)) {
    const part = contentArr.find(p => p && typeof p.image === 'string');
    if (part) url = part.image;
  } else if (typeof contentArr === 'string' && /^(https?:|data:image)/i.test(contentArr)) {
    url = contentArr;
  }
  if (!url) throw new Error(`${providerLabel}图片接口未返回图片`);
  return toSafeDataURL(url);
}

function dashErrorText(raw, { provider } = {}) {
  let text = String(raw || '').trim();
  try {
    const err = JSON.parse(text);
    if (err.code || err.message) text = `${err.code || ''} ${err.message || ''}`.trim();
  } catch {}
  if (!text) text = '未知错误';
  const isTokenPlan = provider === 'qianwen';
  if (/InvalidApiKey|invalid api/i.test(text)) {
    text += isTokenPlan
      ? '（图片 API Key 无效：Token Plan 只认千问AI平台「Token Plan 页面」里的专属 Key（sk-sp- 开头），且接口地址域名必须包含 token-plan（https://token-plan.cn-beijing.maas.aliyuncs.com）；不能用百炼按量 Key（sk-/sk-ws- 开头）、不能用 DeepSeek/硅基文字 Key；复制时不要带空格换行；若订阅已到期也会 401；仍失败请到 Token Plan 页面重置 Key）'
      : '（图片 API Key 无效：如果你在百炼「业务空间」里创建的专属 Key，通用域名不认，必须到 AI 设置→图片接口地址填你的专属域名 {WorkspaceId}.cn-beijing.maas.aliyuncs.com（百炼控制台右上角「业务空间详情」可查 WorkspaceId）后保存重试；另外请确认填的是 sk- 开头 Key（不是 LTAI 开头、不是 DeepSeek/硅基 Key），国内版/国际版域名网站已自动都试过；若仍失败，请到百炼控制台重新生成 Key）';
  } else if (/ModelNotExist|InvalidModel|not found|not supported|未开通|无权限|PermissionDenied|AccessDenied/i.test(text)) {
    text += isTokenPlan
      ? '（请确认模型在 Token Plan 支持列表内且拼写一致：qwen-image-2.0 / qwen-image-2.0-pro / qwen-image-3.0-pro / wan2.7-image / wan2.7-image-pro；403 AccessDenied.Unpurchased 表示该模型不在你的套餐版本内，请改用套餐支持的模型）'
      : '（请确认已在百炼控制台开通/购买 qwen-image-3.0-pro，模型名需完全一致）';
  } else if (/region|地域|WorkspaceId/i.test(text)) {
    text += isTokenPlan
      ? '（Token Plan 只在特定地域提供服务，请确认 Key 与接口地址地域一致，当前默认 https://token-plan.cn-beijing.maas.aliyuncs.com）'
      : '（请确认 API Key 与模型在同一地域；可把业务空间专属域名填到图片接口地址，如 {WorkspaceId}.cn-beijing.maas.aliyuncs.com）';
  } else if (/Throttl|QPS|限流|insufficient_quota|AllocationQuota/i.test(text)) {
    text += '（触发限流或套餐额度不足，请稍后重试；套餐额度用完需等下一个周期或购买加油包）';
  } else if (/size|resolution|参数|InvalidParameter/i.test(text)) {
    text += '（请求参数被接口拒绝，已自动降级重试）';
  }
  return text.slice(0, 300);
}

// 把生成图片 URL 转成本地 dataURL，避免跨域图片污染画布（下载/编辑才不会被浏览器拦截）
async function toSafeDataURL(src) {
  if (/^data:image/i.test(src)) return src;
  try {
    const response = await fetch(src);
    if (!response.ok) throw new Error('HTTP ' + response.status);
    const blob = await response.blob();
    return await new Promise((resolve, reject) => {
      const reader = new FileReader();
      reader.onload = () => resolve(String(reader.result));
      reader.onerror = () => reject(reader.error || new Error('读取图片失败'));
      reader.readAsDataURL(blob);
    });
  } catch (error) {
    // 图片托管域名不允许跨域读取时，尝试匿名加载后再转 canvas
  }
  try {
    return await new Promise((resolve, reject) => {
      const image = new Image();
      image.crossOrigin = 'anonymous';
      image.onload = () => {
        try {
          const temp = document.createElement('canvas');
          temp.width = image.naturalWidth || image.width;
          temp.height = image.naturalHeight || image.height;
          temp.getContext('2d').drawImage(image, 0, 0);
          resolve(temp.toDataURL('image/png'));
        } catch (error) {
          reject(error);
        }
      };
      image.onerror = reject;
      image.src = src;
    });
  } catch (error) {
    return src; // 兜底：直接显示，下载/编辑可能受浏览器跨域限制
  }
}

async function openAILikeImage(prompt, { aspect = 'square', reference = null, references = null, size = '', strictRef = false, onStatus = null } = {}) {
  const img = getImageConfig();
  if (!img) throw new Error(imageConfigError());
  if (img.provider === 'dashscope' || img.provider === 'qianwen') return dashscopeImage(prompt, { aspect, reference, references, size, strictRef, onStatus });
  if ((Array.isArray(references) && references.length) || reference) throw new Error('参考图编辑仅支持阿里云百炼 / 千问AI平台 Token Plan（qwen-image-3.0 / qwen-image-3.0-pro / qwen-image-2.0-pro），请在图片服务商里选择百炼或 Token Plan');
  const base = img.base.replace(/\/+$/, '');
  const model = img.model;
  const isSilicon = img.provider === 'siliconflow';
  const isZhipu = img.provider === 'zhipu';
  const effSize = isSilicon
    ? (aspect === '9:16' ? '768x1360' : aspect === '16:9' ? '1360x768' : '1024x1024')
    : (aspect === '9:16' ? '1024x1536' : aspect === '16:9' ? '1536x1024' : '1024x1024');
  const body = isSilicon
    ? { model, prompt, image_size: effSize, batch_size: 1, response_format: 'b64_json' }
    : isZhipu
      ? { model, prompt, size: effSize }
      : { model, prompt, size: effSize, n: 1, response_format: 'b64_json' };
  const response = await fetch(base + '/images/generations', {
    method: 'POST',
    headers: { 'Content-Type': 'application/json', 'Authorization': 'Bearer ' + img.key },
    body: JSON.stringify(body)
  });
  if (!response.ok) {
    const text = await response.text().catch(() => '');
    throw new Error(`图片接口错误（${response.status}）：${maskSecrets(String(text).slice(0, 200), [img.key])}`);
  }
  const data = await response.json();
  const item = data.data?.[0];
  if (item?.b64_json) return 'data:image/png;base64,' + item.b64_json;
  if (item?.url) return toSafeDataURL(item.url);
  throw new Error('图片接口未返回图片');
}

function updateAIStatus() {
  const cfg = getAIConfig();
  if (hasByok()) {
    const provider = AI_PROVIDERS[cfg.provider] || AI_PROVIDERS.custom;
    $('aiStatus').textContent = `自填AI：${provider.name}（${cfg.model || provider.model}）`;
  }
}

/* 海报区实时显示"实际连接的图片引擎"，避免选了 pro 却连到普通版还不自知 */
function updatePosterEngineLine() {
  const el = $('posterEngineLine');
  if (!el) return;
  const img = getImageConfig();
  if (!img) {
    el.textContent = '当前图片引擎：未配置（请在 AI 设置 → 图片生成 选择阿里云百炼并保存）';
    return;
  }
  const mode = img.provider === 'qianwen' ? 'Token Plan 中转' : '百炼直连';
  el.textContent = img.provider === 'qianwen'
    ? `当前图片引擎：${img.model}（${mode}${API_BASE ? '，中转 ' + API_BASE : '，未配置中转地址'}）—— 若生成报 Failed to fetch，说明当前网络访问不了该中转，可改用「阿里云百炼（按量）直连」，或在「AI 设置 → 服务端中转接口地址」填入你在阿里云函数计算部署好的中转地址`
    : `当前图片引擎：${img.model}（${mode}）—— 浏览器可直接调用，与阿里云控制台同参数`;
}

/* 图片模型：下拉选项与"自定义模型"输入框联动 */
function setImageModel(value) {
  const sel = $('aiImageModel');
  const custom = $('aiImageModelCustom');
  if (!sel) return;
  const v = String(value || '').trim();
  if (!custom) { sel.value = v; return; }
  if (!v) { sel.value = ''; custom.value = ''; custom.hidden = true; return; }
  const known = Array.from(sel.options).some(o => o.value === v);
  if (known) {
    sel.value = v;
    custom.hidden = true;
  } else {
    sel.value = '__custom__';
    custom.value = v;
    custom.hidden = false;
  }
}

function imageModelValue() {
  const sel = $('aiImageModel');
  if (!sel) return '';
  if (sel.value === '__custom__') {
    const custom = $('aiImageModelCustom');
    return custom ? (custom.value || '').trim() : '';
  }
  return sel.value || '';
}

$('aiSettings').onclick = () => {
  const cfg = getAIConfig();
  $('aiMode').value = cfg.mode || 'vercel';
  $('aiProvider').value = cfg.provider || 'deepseek';
  const provider = AI_PROVIDERS[$('aiProvider').value] || AI_PROVIDERS.deepseek;
  $('aiKey').value = cfg.apiKey || '';
  renderAIModels();
  $('aiModel').value = cfg.model || provider.recommend || provider.model;
  $('aiBaseUrl').value = cfg.baseUrl || '';
  // Token Plan 专属 Key（sk-sp-）自动对应「千问AI平台 Token Plan」选项
  if (/^sk-sp-/i.test(cfg.imageKey || '')) $('aiImageProvider').value = 'qianwen';
  else $('aiImageProvider').value = cfg.imageProvider || '';
  $('aiImageKey').value = cfg.imageKey || '';
  setImageModel(cfg.imageModel || '');
  $('aiImageBaseUrl').value = cfg.imageBaseUrl || '';
  $('aiProxyBase').value = (() => { try { return localStorage.getItem('tripMall.proxyBase') || ''; } catch { return ''; } })();
  // 仅旧默认（空 / 远古 qwen-image）自动升级为 pro；用户明确选的 qwen-image-3.0 常规版保持不变
  if ((cfg.imageProvider === 'dashscope' || cfg.imageProvider === 'qianwen') && ['', 'qwen-image'].includes((cfg.imageModel || '').trim())) {
    setImageModel('qwen-image-3.0-pro');
  }
  applyAIPreset();
  $('aiTestStatus').textContent = '';
  $('aiModal').hidden = false;
  const box = $('aiModal').querySelector('.modal-box');
  if (box) box.scrollTop = 0;
};

function renderAIModels() {
  const provider = AI_PROVIDERS[$('aiProvider').value] || AI_PROVIDERS.custom;
  const models = provider.models?.length ? provider.models : [provider.model || ''];
  $('aiModel').innerHTML = models.map(model => `<option value="${model}">${model}</option>`).join('');
}

function applyAIPreset() {
  const provider = AI_PROVIDERS[$('aiProvider').value] || AI_PROVIDERS.custom;
  if (!$('aiBaseUrl').value) $('aiBaseUrl').value = provider.base;
  $('byokFields').hidden = $('aiMode').value !== 'byok';
  $('imgFields').hidden = $('aiMode').value !== 'byok';
}

$('aiMode').onchange = applyAIPreset;
$('aiProvider').onchange = () => {
  const provider = AI_PROVIDERS[$('aiProvider').value] || AI_PROVIDERS.custom;
  renderAIModels();
  $('aiModel').value = provider.recommend || provider.model;
  $('aiBaseUrl').value = provider.base;
  // 仅当图片服务商是「跟随文字服务商」时才联动图片模型，避免覆盖用户已单独选好的 pro/常规版
  if (!$('aiImageProvider').value) setImageModel(provider.imageModel);
};
$('aiModelSuggest').onclick = () => {
  const provider = AI_PROVIDERS[$('aiProvider').value] || AI_PROVIDERS.custom;
  if (provider.recommend) $('aiModel').value = provider.recommend;
  else alert('该服务商暂无推荐模型，请手动填写。');
};
$('aiImageProvider').onchange = () => {
  const key = $('aiImageProvider').value;
  if (key === 'siliconflow') {
    setImageModel('black-forest-labs/FLUX.1-schnell');
    $('aiImageBaseUrl').value = 'https://api.siliconflow.cn/v1';
  } else if (key === 'dashscope') {
    setImageModel('qwen-image-3.0-pro');
    $('aiImageBaseUrl').value = 'https://dashscope.aliyuncs.com';
  } else if (key === 'qianwen') {
    setImageModel('qwen-image-3.0-pro');
    $('aiImageBaseUrl').value = 'https://token-plan.cn-beijing.maas.aliyuncs.com';
  } else if (key === 'zhipu') {
    setImageModel('cogview-4-250304');
    $('aiImageBaseUrl').value = 'https://open.bigmodel.cn/api/paas/v4';
  } else if (key === 'openai') {
    setImageModel('gpt-image-1');
    $('aiImageBaseUrl').value = 'https://api.openai.com/v1';
  } else if (key === 'custom') {
    setImageModel('__custom__');
    $('aiImageBaseUrl').value = '';
  }
};
$('aiImageModel').onchange = () => {
  const custom = $('aiImageModelCustom');
  if (!custom) return;
  if ($('aiImageModel').value === '__custom__') {
    custom.hidden = false;
    custom.focus();
  } else {
    custom.hidden = true;
  }
};
$('aiImageModelSuggest').onclick = () => {
  const key = $('aiImageProvider').value;
  const suggestions = {
    dashscope: 'qwen-image-3.0-pro',
    qianwen: 'qwen-image-3.0-pro',
    siliconflow: 'black-forest-labs/FLUX.1-schnell',
    zhipu: 'cogview-4-250304',
    openai: 'gpt-image-1'
  };
  if (suggestions[key]) {
    setImageModel(suggestions[key]);
    if (!key.startsWith('custom')) {
      const baseMap = {
        dashscope: 'https://dashscope.aliyuncs.com',
        qianwen: 'https://token-plan.cn-beijing.maas.aliyuncs.com',
        siliconflow: 'https://api.siliconflow.cn/v1',
        zhipu: 'https://open.bigmodel.cn/api/paas/v4',
        openai: 'https://api.openai.com/v1'
      };
      if (!String($('aiImageBaseUrl').value).trim()) $('aiImageBaseUrl').value = baseMap[key] || '';
    }
  } else {
    alert('请先选择图片服务商，再填入推荐模型。');
  }
};
$('aiSave').onclick = () => {
  const cfg = {
    mode: $('aiMode').value,
    provider: $('aiProvider').value,
    apiKey: $('aiKey').value.trim(),
    model: $('aiModel').value.trim(),
    baseUrl: $('aiBaseUrl').value.trim(),
    imageProvider: $('aiImageProvider').value,
    imageKey: $('aiImageKey').value.trim(),
    imageModel: imageModelValue(),
    imageBaseUrl: $('aiImageBaseUrl').value.trim()
  };
  const newProxy = ($('aiProxyBase').value || '').trim().replace(/\/+$/, '');
  let oldProxy = '';
  try { oldProxy = (localStorage.getItem('tripMall.proxyBase') || '').trim().replace(/\/+$/, ''); } catch {}
  cfg.proxyBase = newProxy;
  lsSet(AI_KEY, cfg);
  try {
    if (newProxy) localStorage.setItem('tripMall.proxyBase', newProxy);
    else localStorage.removeItem('tripMall.proxyBase');
  } catch {}
  updateAIStatus();
  updatePosterEngineLine();
  $('aiModal').hidden = true;
  if (cfg.mode === 'byok' && !cfg.apiKey) alert('已保存，但 API Key 为空——生成时会自动回退到其他方式。');
  else if (newProxy && newProxy !== oldProxy) {
    alert('中转接口已更新。正在刷新页面以生效……');
    location.reload();
    return;
  } else alert('AI 接入设置已保存。');
};
$('aiClear').onclick = () => {
  localStorage.removeItem(AI_KEY);
  try { localStorage.removeItem('tripMall.proxyBase'); } catch {}
  $('aiKey').value = '';
  $('aiModel').value = '';
  $('aiBaseUrl').value = '';
  $('aiImageProvider').value = '';
  $('aiImageKey').value = '';
  setImageModel('');
  $('aiImageBaseUrl').value = '';
  if ($('aiProxyBase')) $('aiProxyBase').value = '';
  $('aiStatus').textContent = IS_GITHUB_PAGES ? '公网AI：未连接' : '公网AI：未连接';
  alert('已清除自填 Key 设置。');
};
$('kbRefresh').onclick = async () => {
  const btn = $('kbRefresh');
  const old = btn.textContent;
  btn.textContent = '刷新中…';
  btn.disabled = true;
  try {
    const cacheBust = 'v=' + Date.now();
    const resp = await fetch(apiUrl('/api/knowledge?' + cacheBust)).catch(() => null) ||
      await fetch('knowledge_base.json?' + cacheBust);
    if (!resp.ok) throw new Error('knowledge_base.json 不可用');
    const data = await resp.json();
    applyKnowledge(data);
    const live = data?.marketplace?.live || {};
    alert(`知识库已刷新（${live.updated_at || '最近快照'}）：${live.categories?.length || 0} 个品类、${live.flagship_products?.length || 0} 个热销/上新好物、${live.key_coupons?.length || 0} 个重点券已载入。`);
  } catch (e) {
    alert('刷新知识库失败：' + e.message);
  } finally {
    btn.textContent = old;
    btn.disabled = false;
  }
};
$('aiClose').onclick = () => { $('aiModal').hidden = true; };

// 用户已开通 qwen-image-3.0-pro：页面加载时仅把百炼/Token Plan 的旧默认图片模型（空 / qwen-image）升级为 pro，
// 用户明确选择的 qwen-image-3.0 常规版保持不变
(() => {
  const cfg = getAIConfig();
  if ((cfg.imageProvider === 'dashscope' || cfg.imageProvider === 'qianwen') && ['', 'qwen-image'].includes((cfg.imageModel || '').trim())) {
    cfg.imageModel = 'qwen-image-3.0-pro';
    lsSet(AI_KEY, cfg);
  }
})();

$('aiTest').onclick = async () => {
  const cfg = {
    mode: $('aiMode').value,
    provider: $('aiProvider').value,
    apiKey: $('aiKey').value.trim(),
    model: $('aiModel').value.trim(),
    baseUrl: $('aiBaseUrl').value.trim(),
    imageProvider: $('aiImageProvider').value,
    imageKey: $('aiImageKey').value.trim(),
    imageModel: imageModelValue(),
    imageBaseUrl: $('aiImageBaseUrl').value.trim()
  };
  if (!cfg.apiKey) return alert('先填写 API Key');
  lsSet(AI_KEY, cfg);
  $('aiTestStatus').textContent = '测试中…';
  try {
    const text = await openAILikeChat('你是测试助手', '请只回复四个字：连接成功', { maxTokens: 50 });
    $('aiTestStatus').textContent = `测试成功：${String(text).slice(0, 40)}`;
  } catch (error) {
    $('aiTestStatus').textContent = `测试失败：${error.message}`;
  }
};
$('aiImgTest').onclick = async () => {
  const cfg = {
    mode: $('aiMode').value,
    provider: $('aiProvider').value,
    apiKey: $('aiKey').value.trim(),
    model: $('aiModel').value.trim(),
    baseUrl: $('aiBaseUrl').value.trim(),
    imageProvider: $('aiImageProvider').value,
    imageKey: $('aiImageKey').value.trim(),
    imageModel: imageModelValue(),
    imageBaseUrl: $('aiImageBaseUrl').value.trim()
  };
  lsSet(AI_KEY, cfg);
  $('aiTestStatus').textContent = '图片测试中…';
  try {
    await openAILikeImage('简单测试贴纸：一只微笑的橘猫，单一主体居中，画面干净，无文字', { aspect: 'square' });
    $('aiTestStatus').textContent = '图片生成测试成功！';
  } catch (error) {
    $('aiTestStatus').textContent = `图片测试失败：${error.message}`;
  }
};
updateAIStatus();
updatePosterEngineLine();

function extractJson(text) {
  const cleaned = String(text || '')
    .replace(/^```json\s*/i, '')
    .replace(/```\s*$/i, '')
    .trim();
  const start = cleaned.indexOf('{');
  const end = cleaned.lastIndexOf('}');
  if (start < 0 || end < start) throw new Error('AI返回的JSON格式不完整');
  return JSON.parse(cleaned.slice(start, end + 1));
}

/* ============================ 知识库 ============================ */

const LOCAL_CATEGORIES = {
  product: { name: '产品类知识库', description: '服务市场上架的酒店主题房与客房产品方案：帮商家讲清上新价值，引导酒店客户到服务市场采购落地。', content_types: ['专业知识','采购指南','优品推荐','优惠福利','内容互动','其他'], topics: ['宠物友好房','亲子房','影音房','舒睡房'] },
  platform: { name: '平台类知识库', description: '服务市场平台本身：入口与账号、下单流程、售后申请，让酒店客户会用、敢买。', content_types: ['功能科普','操作指南','问题解答','平台好物','旅拍合作','内容互动'], topics: ['下单流程','订单查询','售后申请','酒店用品推荐','旅拍合作'] },
  payment: { name: '支付类知识库', description: '服务市场内的支付与结算：对公支付、账单分期、免房置换、退款发票，帮助酒店客户顺利成交。', content_types: ['支付科普','付款指南','退款指南','免房置换','账单分期','风险提示'], topics: ['现金支付','对公转账','退款路径','免房置换','账单分期'] },
  campaign: { name: '活动类知识库', description: '服务市场平台活动（双11、618、酒店采购节等）：借活动节点推动酒店客户在服务市场下单。', content_types: ['优惠福利','活动预热','倒计时','爆品推荐','限时促单','活动复盘'], topics: ['双11','618','酒店采购节','开业季','暑期亲子季'] },
  insight: { name: '干货类知识库', description: '纯引流干货：酒店运营知识、常见问题与解决对策、服务改善方法与行业经验；面向酒店从业者输出实用内容，不做商品导购。', content_types: ['专业知识','运营清单','案例拆解','避坑指南','数据洞察','内容互动'], topics: ['酒店好评差评','前台常见问题','客房服务与管理','投诉处理','OTA运营','收益管理','员工服务培训'] }
};
const PERSONAS = ['酒店老板','店长','业主','总经理','收益总监','市场营销总监','酒店营销人员','酒店采购','酒店经理','销售总监','前厅经理','客房经理','财务总监','工程总监','品牌总监','投资人','酒店顾问','酒店供应商','一线销售','住客','宠物主','亲子家庭'];

let knowledge = { categories: LOCAL_CATEGORIES };
let research = '';

function renderSelectors() {
  $('category').innerHTML = Object.entries(knowledge.categories)
    .map(([key, value]) => `<option value="${key}">${value.name}</option>`).join('');
  $('persona').innerHTML = PERSONAS.map(value => `<option value="${value}">${value}</option>`).join('');
  renderContentTypes();
  renderCategoryCards();
}

function renderContentTypes() {
  const category = knowledge.categories[$('category').value] || LOCAL_CATEGORIES.product;
  $('contentType').innerHTML = category.content_types.map(value => `<option value="${value}">${value}</option>`).join('');
  renderKbPosterImages();
}

/* 知识库配图：帮助文档里的官方截图，点击选作海报参考图 */
let selectedKbImage = '';

function currentHelpImages() {
  const cat = knowledge.categories[$('category').value] || {};
  const docs = Array.isArray(cat.help_docs) ? cat.help_docs : [];
  const images = [];
  docs.forEach(doc => (doc.images || []).forEach(file => images.push({ doc: doc.title, file })));
  return images;
}

function renderKbPosterImages() {
  const box = $('kbPosterImgs');
  if (!box) return;
  const images = currentHelpImages();
  if (!images.length) {
    box.innerHTML = '<span class="hint">当前知识库分类暂无配图（平台/支付类帮助文档里有官方截图）</span>';
    return;
  }
  box.innerHTML = images.map((img, i) => `
    <button type="button" class="kb-img${selectedKbImage === img.file ? ' on' : ''}" data-i="${i}" title="${escapeHtml(img.doc)}">
      <img src="${escapeHtml(img.file)}" alt="">
    </button>`).join('');
  box.querySelectorAll('.kb-img').forEach(btn => {
    btn.onclick = () => {
      const img = images[+btn.dataset.i];
      selectedKbImage = selectedKbImage === img.file ? '' : img.file;
      renderKbPosterImages();
      $('aiPosterStatus').textContent = selectedKbImage ? `已选知识库配图作为参考：${img.doc}（可再点取消）` : '';
    };
  });
}

function renderCategoryCards() {
  $('categories').innerHTML = Object.entries(knowledge.categories).map(([key, value], index) => {
    const topics = Array.isArray(value.topics) ? value.topics : Object.keys(value.topics || {});
    const larkDocs = Array.isArray(knowledge.lark?.docs) ? knowledge.lark.docs : [];
    const larkDoc = larkDocs.find(doc => doc.key === key) || {};
    const docUrl = larkDoc.url || value.doc_url || '';
    const docLink = docUrl
      ? `<a class="cat-doc" href="${escapeHtml(docUrl)}" target="_blank" rel="noopener">📄 查看飞书文档 ↗</a>`
      : '';
    return `<article class="cat reveal" style="transition-delay:${index * 70}ms">
      <b>${escapeHtml(value.name)}</b>
      <p>${escapeHtml(value.description || '持续沉淀酒店行业可复用内容。')}</p>
      <ul>${topics.slice(0, 5).map(topic => `<li>${escapeHtml(topic)}</li>`).join('')}</ul>
      ${docLink}
    </article>`;
  }).join('');
  observeReveal();
}

renderSelectors();
$('category').addEventListener('change', renderContentTypes);

function applyKnowledge(data) {
  if (!data?.categories) return false;
  const selected = $('category').value;
  knowledge = data;
  const syncedDocs = Array.isArray(data.lark?.synced_docs)
    ? data.lark.synced_docs
    : (Array.isArray(data.lark?.docs) ? data.lark.docs : []);
  const larkDocs = syncedDocs.filter(doc => doc && doc.text && doc.text.trim());
  if (larkDocs.length) {
    knowledge.lark_docs = larkDocs;
    $('larkStatus').textContent = `飞书内容库：已同步 ${larkDocs.length} 篇${data.lark.synced_at ? ' · ' + data.lark.synced_at : ''}`;
    lsSet(LARK_CACHE_KEY, { docs: larkDocs, synced_at: data.lark.synced_at || '' });
  } else {
    const firstErr = syncedDocs.find(doc => doc && doc.error) || null;
    const errText = (firstErr && firstErr.error) || data.lark?.last_error;
    if (errText) $('larkStatus').textContent = `飞书内容库：自动同步不可用（${errText}）`;
  }
  window.__tripMallKB = {
    loaded: !!data.marketplace?.catalog,
    cats: Object.keys(data.categories).length,
    live: data.marketplace?.live || null
  };
  renderSelectors();
  if (knowledge.categories[selected]) $('category').value = selected;
  renderContentTypes();
  return true;
}

function loadKnowledge() {
  const cacheBust = 'v=' + Date.now();
  return fetch(apiUrl('/api/knowledge?' + cacheBust)).then(response => {
    if (!response.ok) throw new Error('live kb unavailable');
    return response.json();
  }).then(applyKnowledge).catch(() => {
    return fetch('knowledge_base.json?' + cacheBust).then(response => {
      if (!response.ok) throw new Error('local kb unavailable');
      return response.json();
    }).then(applyKnowledge).catch(() => {});
  });
}

/* ============================ 飞书内容库同步 ============================ */

const LARK_CACHE_KEY = 'tripMall.larkDocs';

function larkDocsConfig() {
  const docs = knowledge.lark?.docs;
  if (Array.isArray(docs) && docs.length) return docs;
  return [{ key: 'product', name: '产品类内容库', url: 'https://trip.larkenterprise.com/docx/ArYQdJsHHoDSSJxgYozci92onsf' }];
}

function applyLarkDocs(docs, syncedAt) {
  const ok = (docs || []).filter(doc => doc && doc.text && doc.text.trim());
  const failed = (docs || []).filter(doc => doc && doc.error);
  knowledge.lark_docs = ok;
  let status;
  if (!ok.length) {
    status = failed.length
      ? `飞书内容库：同步失败（${failed[0].error}）`
      : '飞书内容库：未同步';
  } else {
    const totalChars = ok.reduce((sum, doc) => sum + doc.text.length, 0);
    status = `飞书内容库：已同步 ${ok.length} 篇${syncedAt ? ' · ' + syncedAt : ''}`;
    if (totalChars >= 1000) status += `（约 ${Math.round(totalChars / 100) / 10} 千字）`;
  }
  if (failed.length) status += `；${failed.length} 篇失败`;
  $('larkStatus').textContent = status;
  lsSet(LARK_CACHE_KEY, { docs: ok, synced_at: syncedAt || '' });
  renderCategoryCards();
}

async function syncLark() {
  const btn = $('larkSyncBtn');
  const old = btn.textContent;
  btn.disabled = true;
  btn.textContent = '同步中…';
  try {
    const resp = await fetch(apiUrl('/api/lark-sync'), {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ docs: larkDocsConfig() })
    });
    const data = await resp.json().catch(() => ({}));
    if (!resp.ok) throw new Error(data.error || `同步失败（${resp.status}）`);
    applyLarkDocs(data.docs, data.synced_at);
  } catch (error) {
    $('larkStatus').textContent = `飞书内容库：同步失败（${error.message}）`;
  } finally {
    btn.textContent = old;
    btn.disabled = false;
  }
}

function initLark() {
  const cached = lsGet(LARK_CACHE_KEY);
  if (cached && Array.isArray(cached.docs)) {
    knowledge.lark_docs = cached.docs;
    $('larkStatus').textContent = `飞书内容库：已缓存 ${cached.docs.length} 篇${cached.synced_at ? ' · ' + cached.synced_at : ''}`;
  }
  if ($('larkSyncBtn')) $('larkSyncBtn').onclick = syncLark;
  syncLark();
}

function slugifyLarkName(name) {
  const s = String(name || '飞书内容库').trim();
  return s.replace(/[^\u4e00-\u9fa5a-zA-Z0-9]+/g, '-').slice(0, 24) || 'lark-manual';
}

function pasteLark() {
  const text = $('larkPasteText').value.trim();
  const status = $('larkStatus');
  if (!text) {
    status.textContent = '飞书内容库：请先粘贴文档正文再入库。';
    return;
  }
  const name = $('larkPasteName').value.trim() || '飞书内容库（手动）';
  const key = slugifyLarkName(name);
  const now = new Date().toLocaleString('zh-CN', { hour12: false });
  const doc = { key, name, text: text.slice(0, 30000), updated_at: '手动·' + now, source: 'paste' };
  const docs = Array.isArray(knowledge.lark_docs) ? knowledge.lark_docs.filter(item => item.key !== key) : [];
  docs.unshift(doc);
  knowledge.lark_docs = docs;
  lsSet(LARK_CACHE_KEY, { docs, synced_at: now });
  $('larkPasteText').value = '';
  $('larkPasteName').value = '';
  status.textContent = `飞书内容库：已入库「${name}」（约 ${Math.round(text.length / 100) / 10} 千字），生成时自动参考。`;
}

async function readClipboardLark() {
  const status = $('larkStatus');
  try {
    const text = await navigator.clipboard.readText();
    if (!text || !text.trim()) {
      status.textContent = '飞书内容库：剪贴板是空的，请先在飞书文档里 Ctrl+A / Ctrl+C 复制正文。';
      return;
    }
    $('larkPasteText').value = text.trim().slice(0, 30000);
    status.textContent = '飞书内容库：已从剪贴板读取，确认无误后点「入库并应用」。';
  } catch (error) {
    status.textContent = '飞书内容库：浏览器不允许直接读剪贴板，请在输入框里 Ctrl+V 粘贴。';
  }
}

function larkRelevant(query, maxChars = 900, maxDocs = 1) {
  const docs = Array.isArray(knowledge.lark_docs) ? knowledge.lark_docs : [];
  if (!docs.length) return '';
  const q = String(query || '');
  const keys = ['宠物', '亲子', '影音', '舒睡', '布草', '床垫', '毛巾', '牙具', '机器人', '咖啡', '采购', '优惠', '价格', '活动', '售后', '支付', '发票', '免房', '旅拍', '酒店', '客房'];
  const score = text => {
    let s = 0;
    keys.forEach(k => { if (q.includes(k) && text.includes(k)) s += 2; });
    q.split(/[\s,，。;；、]+/).filter(w => w.length >= 2).forEach(w => { if (text.includes(w)) s += 1; });
    return s;
  };
  const ranked = docs
    .map(d => ({ d, s: score((d.name || '') + ' ' + (d.text || '')) }))
    .sort((a, b) => b.s - a.s);
  const picked = ranked[0] && ranked[0].s > 0 ? ranked.slice(0, maxDocs) : docs.slice(0, maxDocs);
  return picked.map(x => `【${x.d.name || x.d.key}（更新于 ${x.d.updated_at || '—'}）】\n${String(x.d.text || '').slice(0, maxChars)}`).join('\n\n');
}

if ($('larkPasteBtn')) $('larkPasteBtn').onclick = pasteLark;
if ($('larkPasteClip')) $('larkPasteClip').onclick = readClipboardLark;

loadKnowledge();
initLark();

/* ============================ 视觉滚动 ============================ */

function observeReveal() {
  if (!('IntersectionObserver' in window)) {
    document.querySelectorAll('.reveal').forEach(el => el.classList.add('in'));
    return;
  }
  const observer = new IntersectionObserver(entries => {
    entries.forEach(entry => {
      if (entry.isIntersecting) {
        entry.target.classList.add('in');
        observer.unobserve(entry.target);
      }
    });
  }, { threshold: 0.12 });
  document.querySelectorAll('.reveal:not(.in)').forEach(el => observer.observe(el));
}
observeReveal();

const heroImg = document.querySelector('.hero-img');
const nav = $('nav');
window.addEventListener('scroll', () => {
  nav.classList.toggle('scrolled', window.scrollY > 12);
  if (heroImg) {
    heroImg.style.transform = `translateY(${Math.min(70, window.scrollY * 0.07)}px) scale(1.04)`;
  }
}, { passive: true });

const TICKER_ITEMS = ['宠物友好房','亲子房','影音房','舒睡房','双11','618','酒店采购节','免房置换','账单分期','前台50问','OTA运营','开业筹备','投诉处理','暑期亲子季','旅拍合作'];
$('tickerTrack').innerHTML = [...TICKER_ITEMS, ...TICKER_ITEMS]
  .map(item => `<span>${item}</span>`).join('');

/* ============================ 个性化学习（持久化） ============================ */

const LS = {
  profile: 'tripMall.profile',
  structure: 'tripMall.structure',
  materials: 'tripMall.materials',
  ganhuo: 'tripMall.ganhuoDocs',
  posterStyle: 'tripMall.posterStyle',
  drafts: 'tripMall.drafts',
  copyHistory: 'tripMall.history.copy',
  posterHistory: 'tripMall.history.poster'
};

function lsGet(key, fallback) {
  try {
    const raw = localStorage.getItem(key);
    return raw ? JSON.parse(raw) : fallback;
  } catch { return fallback; }
}
function lsSet(key, value) {
  try { localStorage.setItem(key, JSON.stringify(value)); return true; } catch { return false; }
}

let materials = lsGet(LS.materials, []);
let drafts = lsGet(LS.drafts, []);
let copyHistory = lsGet(LS.copyHistory, []);
let posterHistory = lsGet(LS.posterHistory, []);
let ganhuoDocs = lsGet(LS.ganhuo, []);

function renderGanhuo() {
  if ($('ganhuoCount')) $('ganhuoCount').textContent = `干货 ${ganhuoDocs.length} 条`;
  if ($('ganhuoList')) $('ganhuoList').innerHTML = ganhuoDocs.length
    ? ganhuoDocs.slice(0, 12).map(g => `<div>· ${String(g.points || '').replace(/\n/g, '；')}</div>`).join('')
    : '<div>还没有干货，粘贴链接/正文后点「学内容→干货库」。</div>';
}

$('learnGanhuoBtn').onclick = async () => {
  const url = $('learnUrl').value.trim();
  const txt = ($('learnContent') ? $('learnContent').value : '').trim();
  let content = '';
  if (url) {
    try { const data = await apiRequest('/api/extract', { url }, 30000); content = data.content; }
    catch (e) { content = txt; }
  } else { content = txt; }
  if (!content) return alert('请先粘贴链接或正文。');
  try {
    const points = await openAILikeChat(
      '你是酒店营销知识提炼助手。',
      `从下面内容提炼“干货要点/知识点/可复用观点”，作为“酒店营销·干货类知识库”。输出要点列表，每条一行、不超过30字，聚焦可复用的方法/洞察/案例/数据：\n${content.slice(0, 12000)}`,
      { maxTokens: 1200, temperature: 0.4 }
    );
    if (points && points.trim()) {
      ganhuoDocs.unshift({ date: Date.now(), source: url ? url : '正文', points: points.trim() });
      if (ganhuoDocs.length > 2000) ganhuoDocs = ganhuoDocs.slice(0, 2000);
      lsSet(LS.ganhuo, ganhuoDocs);
      renderGanhuo();
      alert('已提炼并存入「干货类知识库」，生成文案选「干货类」即可引用。');
    } else throw new Error('提炼结果为空');
  } catch (e) { alert('提炼失败：' + e.message); }
};

function renderLearnList() {
  if ($('learnCount')) $('learnCount').textContent = `已学习 ${materials.length} 份素材`;
  $('learnList').innerHTML = materials.length ? materials.map(item => `
    <div class="learn-item">
      <input type="checkbox" data-id="${item.id}" ${item.checked ? 'checked' : ''}>
      <span class="badge">${item.type}</span>
      <span class="name" title="${escapeHtml(item.content.slice(0, 200))}">${escapeHtml(item.name)}</span>
      <button class="x" data-del="${item.id}" title="删除素材">×</button>
    </div>`).join('') : '<p class="empty">还没有学习素材，上传文件或粘贴链接后会自动加入。</p>';
  $('learnList').querySelectorAll('input[type=checkbox]').forEach(input => {
    input.onchange = () => {
      const item = materials.find(m => String(m.id) === input.dataset.id);
      if (item) { item.checked = input.checked; lsSet(LS.materials, materials); profileDirty = true; }
    };
  });
  $('learnList').querySelectorAll('.x').forEach(button => {
    button.onclick = () => {
      materials = materials.filter(m => String(m.id) !== button.dataset.del);
      lsSet(LS.materials, materials);
      profileDirty = true;
      renderLearnList();
    };
  });
}

function escapeHtml(text) {
  return String(text || '').replace(/[&<>"']/g, char => ({
    '&': '&amp;', '<': '&lt;', '>': '&gt;', '"': '&quot;', "'": '&#39;'
  })[char]);
}

/* ============================ 生成进度条 ============================ */

function startProgress(barId, durationMs = 20000) {
  const bar = $(barId);
  const pct = $(barId + 'Pct');
  const fill = $(barId + 'Fill');
  const noop = { done() {}, fail() {}, stop() {} };
  if (!bar || !pct || !fill) return noop;
  bar.hidden = false;
  bar.classList.remove('done', 'fail');
  pct.textContent = '1%';
  fill.style.width = '1%';
  let progress = 1;
  let timer = null;
  let finished = false;
  const interval = 170;
  const totalTicks = Math.max(10, Math.round((durationMs || 20000) / interval));
  const stepBase = 98 / totalTicks;
  const tick = () => {
    if (finished) return;
    // 按预估时长推进：整体在 durationMs 内缓慢爬到 99%，完成时拉满
    let step = stepBase * (0.55 + Math.random() * 0.9);
    if (progress > 85) step *= 0.4;
    else if (progress > 70) step *= 0.7;
    progress = Math.min(99, progress + step);
    pct.textContent = Math.floor(progress) + '%';
    fill.style.width = Math.floor(progress) + '%';
    timer = setTimeout(tick, interval);
  };
  timer = setTimeout(tick, interval);
  return {
    done() {
      if (finished) return;
      finished = true;
      clearTimeout(timer);
      pct.textContent = '100%';
      fill.style.width = '100%';
      bar.classList.add('done');
      setTimeout(() => { bar.hidden = true; }, 1000);
    },
    fail() {
      if (finished) return;
      finished = true;
      clearTimeout(timer);
      bar.classList.add('fail');
      setTimeout(() => { bar.hidden = true; }, 1600);
    },
    stop() {
      finished = true;
      clearTimeout(timer);
      bar.hidden = true;
    }
  };
}

/* ============================ 生成历史记录 ============================ */

function saveCopyHistory(record) {
  copyHistory.unshift({
    id: Date.now(),
    time: Date.now(),
    category: '',
    product: '',
    persona: '',
    channel: '',
    content_type: '',
    needs: '',
    content: '',
    ...record
  });
  if (copyHistory.length > 500) copyHistory = copyHistory.slice(0, 500);
  while (copyHistory.length && !lsSet(LS.copyHistory, copyHistory)) copyHistory.pop();
}

function savePosterHistory(record) {
  posterHistory.unshift({
    id: Date.now(),
    time: Date.now(),
    type: 'ai-poster',
    instruction: '',
    prompt: '',
    style: '',
    engine: '',
    width: 1080,
    height: 1920,
    image: '',
    ...record
  });
  // 不设人为条数上限：尽量多保留历史。
  // localStorage 空间不够时自动淘汰最旧记录，保证历史始终可用（浏览器存储本身有限，这是唯一硬限制）
  while (posterHistory.length && !lsSet(LS.posterHistory, posterHistory)) posterHistory.pop();
}

async function posterHistoryImage(src, maxSide = 900, quality = 0.78) {
  try {
    if (!/^data:image/i.test(src)) return src;
    const image = new Image();
    image.src = src;
    await image.decode();
    const w0 = image.naturalWidth || image.width;
    const h0 = image.naturalHeight || image.height;
    const scale = Math.min(1, maxSide / Math.max(w0, h0));
    const w = Math.max(1, Math.round(w0 * scale));
    const h = Math.max(1, Math.round(h0 * scale));
    const temp = document.createElement('canvas');
    temp.width = w;
    temp.height = h;
    temp.getContext('2d').drawImage(image, 0, 0, w, h);
    return temp.toDataURL('image/jpeg', quality);
  } catch {
    return src;
  }
}

function fmtTime(ts) {
  return new Date(ts).toLocaleString('zh-CN', {
    month: '2-digit', day: '2-digit', hour: '2-digit', minute: '2-digit'
  });
}

const HISTORY_PAGE_SIZE = 10;
let historyState = { kind: 'copy', page: 0 };

function openHistory(kind) {
  historyState = { kind, page: 0 };
  $('historyDetail').hidden = true;
  $('historyList').hidden = false;
  $('historyTitle').textContent = kind === 'copy' ? '文案历史记录' : '海报历史记录';
  $('historyHint').textContent = kind === 'copy'
    ? '缩略列表：日期 · 知识库大类 · 渠道 · 主题。点击进入详情。'
    : '缩略列表：日期 · 类型 · 指令摘要。点击进入详情。';
  renderHistoryList();
  $('historyModal').hidden = false;
  const box = $('historyModal').querySelector('.modal-box');
  if (box) box.scrollTop = 0;
}

function historyData() {
  return historyState.kind === 'copy' ? copyHistory : posterHistory;
}

function historySummary(item) {
  if (historyState.kind === 'copy') {
    const catName = knowledge.categories?.[item.category]?.name || item.category || '';
    return `${fmtTime(item.time)}  ${catName || '未分类'}  ${item.channel || ''}  ${String(item.product || item.content || '').slice(0, 18)}`;
  }
  const typeLabel = item.type === 'ai-edit' ? 'AI 编辑' : '成品海报';
  return `${fmtTime(item.time)}  ${typeLabel}  ${String(item.instruction || item.style || '').slice(0, 22)}`;
}

function renderHistoryPager(total, page) {
  const pager = $('historyPager');
  const pages = Math.max(1, Math.ceil(total / HISTORY_PAGE_SIZE));
  if (pages <= 1) { pager.innerHTML = ''; return; }
  const btns = [];
  if (page > 0) btns.push(`<button type="button" data-page="${page - 1}">‹ 上一页</button>`);
  btns.push(`<span class="pager-info">${page + 1} / ${pages}</span>`);
  if (page < pages - 1) btns.push(`<button type="button" data-page="${page + 1}">下一页 ›</button>`);
  pager.innerHTML = btns.join('');
  pager.querySelectorAll('button[data-page]').forEach(btn => {
    btn.onclick = () => {
      historyState.page = +btn.dataset.page;
      renderHistoryList();
    };
  });
}

function renderHistoryList() {
  const list = $('historyList');
  const data = [...historyData()].sort((a, b) => b.time - a.time);
  const total = data.length;
  const page = Math.min(historyState.page, Math.max(0, Math.ceil(total / HISTORY_PAGE_SIZE) - 1));
  historyState.page = page;
  if (!total) {
    list.innerHTML = `<p class="history-empty">还没有${historyState.kind === 'copy' ? '文案' : '海报'}生成记录，先生成一条吧。</p>`;
    $('historyPager').innerHTML = '';
    return;
  }
  const slice = data.slice(page * HISTORY_PAGE_SIZE, (page + 1) * HISTORY_PAGE_SIZE);
  list.innerHTML = slice.map(item => {
    const isCopy = historyState.kind === 'copy';
    return `<div class="history-row" data-id="${item.id}" role="button">
      <span class="history-summary">${escapeHtml(historySummary(item))}</span>
      <span class="history-arrow">›</span>
    </div>`;
  }).join('');
  list.querySelectorAll('.history-row').forEach(row => {
    row.onclick = () => {
      const record = historyData().find(item => item.id === Number(row.dataset.id));
      if (record) openHistoryDetail(record);
    };
  });
  renderHistoryPager(total, page);
}

function openHistoryDetail(record) {
  const list = $('historyList');
  const detail = $('historyDetail');
  list.hidden = true;
  $('historyPager').innerHTML = '';
  detail.hidden = false;
  if (historyState.kind === 'copy') {
    const catName = knowledge.categories?.[record.category]?.name || record.category || '';
    detail.innerHTML = `
      <div class="history-detail-head">
        <button type="button" data-back class="alt">‹ 返回列表</button>
        <span class="history-time">${fmtTime(record.time)}</span>
        ${catName ? `<span class="badge">${escapeHtml(catName)}</span>` : ''}
        ${record.channel ? `<span class="badge">${escapeHtml(record.channel)}</span>` : ''}
        ${record.product ? `<span class="badge">${escapeHtml(record.product)}</span>` : ''}
      </div>
      <div class="history-detail-meta">
        ${record.persona ? `<div><b>视角：</b>${escapeHtml(record.persona)}</div>` : ''}
        ${record.content_type ? `<div><b>类型：</b>${escapeHtml(record.content_type)}</div>` : ''}
        ${record.needs ? `<div><b>需求：</b>${escapeHtml(record.needs)}</div>` : ''}
      </div>
      <div class="history-body">${escapeHtml(record.content)}</div>
      <textarea class="history-edit" rows="10" hidden>${escapeHtml(record.content)}</textarea>
      <div class="history-detail-actions">
        <button type="button" data-copy>复制</button>
        <button type="button" data-edit>编辑</button>
        <button type="button" class="danger" data-del>删除</button>
      </div>`;
    const body = detail.querySelector('.history-body');
    const editor = detail.querySelector('.history-edit');
    detail.querySelector('[data-copy]').onclick = async () => {
      try {
        await navigator.clipboard.writeText(record.content);
        alert('已复制到剪贴板');
      } catch {
        const ta = document.createElement('textarea');
        ta.value = record.content;
        document.body.appendChild(ta);
        ta.select();
        document.execCommand('copy');
        ta.remove();
        alert('已复制到剪贴板');
      }
    };
    detail.querySelector('[data-edit]').onclick = () => {
      editor.hidden = !editor.hidden;
      if (!editor.hidden) editor.focus();
    };
    editor.addEventListener('blur', () => {
      if (editor.value !== record.content) {
        record.content = editor.value;
        body.textContent = record.content;
        lsSet(LS.copyHistory, copyHistory);
      }
      editor.hidden = true;
    });
  } else {
    detail.innerHTML = `
      <div class="history-detail-head">
        <button type="button" data-back class="alt">‹ 返回列表</button>
        <span class="history-time">${fmtTime(record.time)}</span>
        <span class="badge">${record.type === 'ai-edit' ? 'AI 编辑' : '成品海报'}</span>
        ${record.style ? `<span class="badge">${escapeHtml(record.style)}</span>` : ''}
      </div>
      <div class="history-poster-detail">
        <img src="${record.image}" alt="海报预览">
        <div class="history-meta">
          <div><b>指令：</b><span class="clip">${escapeHtml(record.instruction)}</span></div>
          <div><b>引擎：</b>${escapeHtml(record.engine || '—')}</div>
          <div><b>尺寸：</b>${record.width}×${record.height}</div>
        </div>
      </div>
      <textarea class="history-edit" rows="4" hidden>${escapeHtml(record.instruction)}</textarea>
      <div class="history-detail-actions">
        <button type="button" data-load>继续编辑</button>
        <button type="button" data-edit>修改说明</button>
        <button type="button" class="danger" data-del>删除</button>
      </div>`;
    const editor = detail.querySelector('.history-edit');
    detail.querySelector('[data-load]').onclick = () => {
      loadPosterRecord(record);
      $('historyModal').hidden = true;
    };
    detail.querySelector('[data-edit]').onclick = () => {
      editor.hidden = !editor.hidden;
      if (!editor.hidden) editor.focus();
    };
    editor.addEventListener('blur', () => {
      if (record && editor.value !== record.instruction) {
        record.instruction = editor.value;
        lsSet(LS.posterHistory, posterHistory);
      }
      editor.hidden = true;
    });
  }
  detail.querySelector('[data-back]').onclick = () => {
    detail.hidden = true;
    list.hidden = false;
    renderHistoryPager(historyData().length, historyState.page);
  };
  detail.querySelector('[data-del]').onclick = () => {
    if (!confirm('确定删除这条历史记录吗？')) return;
    const key = historyState.kind === 'copy' ? LS.copyHistory : LS.posterHistory;
    const arr = historyState.kind === 'copy' ? copyHistory : posterHistory;
    const next = arr.filter(item => item.id !== record.id);
    if (historyState.kind === 'copy') copyHistory = next; else posterHistory = next;
    lsSet(key, next);
    detail.hidden = true;
    list.hidden = false;
    historyState.page = 0;
    renderHistoryList();
  };
}

function loadPosterRecord(record) {
  const image = new Image();
  image.onload = () => {
    // 画布自动匹配海报本身的比例/尺寸，避免用残留画布尺寸 cover 裁剪截断海报
    const iw = image.naturalWidth || image.width;
    const ih = image.naturalHeight || image.height;
    const iRatio = iw / ih;
    let w = Math.round(record.width || 0);
    let h = Math.round(record.height || 0);
    if (!(w >= 200 && h >= 200) || Math.abs((w / h) - iRatio) > 0.03) {
      if (iRatio >= 1) {
        w = 1440;
        h = Math.round(1440 / iRatio);
      } else {
        h = 1440;
        w = Math.round(1440 * iRatio);
      }
    }
    setPosterSize(w, h);
    backgroundImage = image;
    backgroundInfo = { mode: 'history', style: record.style || '历史记录' };
    objects = objects.filter(object => object.type !== 'text');
    selected = null;
    draw();
    renderLayers();
    const nav = $('posterNav');
    if (nav) {
      nav.querySelectorAll('button[data-view]').forEach(b => b.classList.remove('on'));
      const gen = nav.querySelector('[data-view="gen"]');
      if (gen) gen.classList.add('on');
    }
    document.querySelectorAll('.view').forEach(view => {
      view.hidden = view.dataset.view !== 'gen';
    });
    $('aiPosterStatus').textContent = '已从历史记录载入海报，可继续编辑、添加文案或下载。';
  };
  image.onerror = () => alert('海报图片载入失败，可能已损坏。');
  image.src = record.image;
}

$('copyHistoryBtn').onclick = () => openHistory('copy');
$('posterHistoryBtn').onclick = () => openHistory('poster');
$('historyClose').onclick = () => { $('historyModal').hidden = true; };
$('historyModal').addEventListener('click', event => {
  if (event.target === $('historyModal')) $('historyModal').hidden = true;
});

function addMaterial(item) {
  materials.unshift({
    id: Date.now(),
    name: item.name || '未命名素材',
    type: item.type || 'text',
    content: String(item.content || '').slice(0, 30000),
    checked: true,
    date: Date.now()
  });
  if (materials.length > 30) materials = materials.slice(0, 30);
  lsSet(LS.materials, materials);
  profileDirty = true;
  renderLearnList();
}

function fileToBase64(file) {
  return new Promise((resolve, reject) => {
    const reader = new FileReader();
    reader.onload = () => resolve(String(reader.result).split(',')[1]);
    reader.onerror = reject;
    reader.readAsDataURL(file);
  });
}

$('learnFileBtn').onclick = async () => {
  const file = $('learnFile').files[0];
  if (!file) return alert('先选择要解析的文件（支持 txt/md/docx/pptx/pdf/html）');
  if (file.size > 10 * 1024 * 1024) return alert('文件过大，请压缩到10MB以内（PPT/Word含图时建议先压缩）；超大型文件请使用本机 server.py 运行。');
  const ext = (file.name.split('.').pop() || '').toLowerCase();
  try {
    const data = await apiRequest('/api/extract', {
      filename: file.name,
      data_b64: await fileToBase64(file)
    }, 30000);
    addMaterial({ name: file.name, type: data.type || ext, content: data.content });
    alert(`已解析「${file.name}」，共 ${data.content.length} 字，已加入学习素材。`);
  } catch (error) {
    if (['txt', 'md', 'csv', 'json'].includes(ext)) {
      const content = await file.text();
      addMaterial({ name: file.name, type: ext, content });
      alert('已读取文本文件并加入学习素材。');
    } else {
      alert(`解析失败：${error.message}\n\n当前环境未连接后端API，docx/pptx/pdf 请在本机运行 server.py 或改用 txt/md 文本文件。`);
    }
  }
};

$('learnUrlBtn').onclick = async () => {
  const url = $('learnUrl').value.trim();
  if (!url) return alert('先粘贴要解析的链接');
  try {
    const data = await apiRequest('/api/extract', { url }, 30000);
    addMaterial({ name: url, type: 'link', content: data.content });
    alert(`已解析链接，共 ${data.content.length} 字，已加入学习素材。`);
  } catch (error) {
    try {
      const response = await fetch(url);
      if (!response.ok) throw new Error(`HTTP ${response.status}`);
      const text = await response.text();
      const cleaned = text
        .replace(/<script[\s\S]*?<\/script>/gi, ' ')
        .replace(/<style[\s\S]*?<\/style>/gi, ' ')
        .replace(/<[^>]+>/g, ' ')
        .replace(/\s+/g, ' ')
        .trim();
      if (cleaned.length < 50) throw new Error('提取内容过短');
      addMaterial({ name: url, type: 'link', content: cleaned });
      alert(`已在浏览器直接解析链接，共 ${cleaned.length} 字，已加入学习素材。`);
    } catch (fallbackError) {
      const hint = String(error.message).includes('OPENAI_API_KEY')
        ? '后端未配置 OPENAI_API_KEY，但链接解析不需要它——请刷新后重试或检查 Vercel 部署。'
        : '请确认链接可公开访问（公众号等需要登录的链接无法解析），或复制正文粘贴到“风格样本”。';
      alert(`解析链接失败：${error.message}\n\n${hint}`);
    }
  }
};

function checkedMaterialsText() {
  return materials.filter(m => m.checked)
    .map(m => `【${m.name}】\n${m.content.slice(0, 6000)}`)
    .join('\n\n')
    .slice(0, 16000);
}

let profileDirty = true;

function profileSource() {
  const source = checkedMaterialsText();
  return source
    ? source + '\n\n【手动粘贴样本】\n' + $('samples').value.slice(0, 8000)
    : $('samples').value.slice(0, 12000);
}

async function ensureProfile() {
  if (!profileDirty) return;
  const fullSource = profileSource();
  if (!fullSource.trim()) return;
  const prompt = `你是资深中文文案编辑。从以下素材中提炼“风格画像”和“文章结构画像”，让之后只凭简短提示词就能生成同风格、同结构的内容。
素材：
${fullSource.slice(0, 20000)}
请严格按以下两个分节标题输出（不要输出其他内容）：
【风格画像】包含：1)整体语气；2)高频句式与开头方式；3)常用词与口头禅；4)内容长度与信息密度；5)最忌讳的写法（避免的AI腔）。250字以内。
【文章结构画像】包含：1)开头方式与钩子；2)正文如何分段落、分几部分、每部分讲什么；3)是否用小标题/列表/加粗；4)信息呈现顺序；5)结尾方式与CTA引导。250字以内。`;
  try {
    let profile;
    if (hasByok()) {
      profile = await openAILikeChat('你是资深中文文案编辑。', prompt, { maxTokens: 1200, temperature: 0.6 });
    } else {
      try {
        if (IS_GITHUB_PAGES) throw new Error('use puter');
        profile = (await apiRequest('/api/profile', { source: fullSource }, 30000)).content;
      } catch (apiError) {
        if (IS_GITHUB_PAGES) await ensurePuterAuth();
        profile = await puterChat(prompt);
      }
    }
    const raw = profile.trim();
    const splitIdx = raw.indexOf('【文章结构画像】');
    let structure = '';
    let style = raw;
    if (splitIdx > -1) {
      structure = raw.slice(splitIdx).replace(/^【文章结构画像】\s*/, '').trim();
      style = raw.slice(0, splitIdx).replace(/^【风格画像】\s*/, '').trim();
    }
    $('profileBox').value = style;
    lsSet(LS.profile, style);
    $('structureBox').value = structure;
    lsSet(LS.structure, structure);
    profileDirty = false;
  } catch {}
}

$('learnReset').onclick = () => {
  if (!confirm('确认清空所有学习素材、风格画像、海报学习记录与草稿？')) return;
  materials = [];
  drafts = [];
  localStorage.removeItem(LS.materials);
  localStorage.removeItem(LS.profile);
  localStorage.removeItem(LS.structure);
  localStorage.removeItem(LS.posterStyle);
  localStorage.removeItem(LS.drafts);
  $('profileBox').value = '';
  $('structureBox').value = '';
  profileDirty = true;
  renderLearnList();
  renderDraftCount();
  alert('已清空学习素材与画像。');
};

$('profileBox').value = lsGet(LS.profile, '');
$('profileBox').oninput = () => { lsSet(LS.profile, $('profileBox').value); profileDirty = false; };
$('structureBox').value = lsGet(LS.structure, '');
$('structureBox').oninput = () => { lsSet(LS.structure, $('structureBox').value); };
$('samples').oninput = () => { profileDirty = true; };
renderLearnList();
renderGanhuo();

/* ============================ 联网研究 ============================ */

$('research').onclick = async event => {
  const button = event.currentTarget;
  button.textContent = '联网研究中…';
  const payload = {
    product: $('product').value,
    category_name: knowledge.categories[$('category').value].name,
    urls: []
  };
  try {
    let content;
    if (hasByok()) {
      content = await openAILikeChat(
        '你是携程酒店服务市场的研究助手（当前为自填AI，无联网能力，仅凭已有知识输出，不确定处明确注明）。',
        `请围绕酒店行业主题“${payload.product}”（服务于${payload.category_name}内容创作）输出：可验证事实、目标人群、竞品做法、社媒高互动选题、采购或运营问题、风险与数据口径。不要编造具体数据，不确定的信息要明确说明。`,
        { maxTokens: 3000 }
      );
      content = '【自填AI·无联网】\n' + content;
    } else {
      if (IS_GITHUB_PAGES) await ensurePuterAuth();
      try {
        if (IS_GITHUB_PAGES) throw new Error('使用公共AI');
        content = (await apiRequest('/api/research', payload, 20000)).content;
      } catch (apiError) {
        content = await puterChat(
          `请联网研究酒店行业主题“${payload.product}”，服务于${payload.category_name}内容创作。重点查找最新公开趋势、目标人群、竞品做法、社媒高互动选题、采购或运营问题。输出：可验证事实、来源、竞品启发、可执行选题、风险与数据口径。不要复制原文，不确定的信息要明确说明。`,
          { tools: [{ type: 'web_search' }] }
        );
      }
    }
    research = content;
    $('samples').value = `【联网研究】\n${research}\n\n${$('samples').value}`;
    profileDirty = true;
    alert('联网研究完成，结果已写入风格样本区域。');
  } catch (error) {
    alert(`联网研究失败：${error.message}`);
  } finally {
    button.textContent = '联网研究';
  }
};

$('aiLogin').onclick = async () => {
  try {
    await ensurePuterAuth();
    alert('公共AI已连接，可开始生成。');
  } catch (error) {
    alert(`连接失败：${error.message}`);
  }
};

/* ============================ 内容生成 ============================ */

const CHANNEL_RULES = {
  '社群运营': '社群运营：150-200字左右，提炼内容精华，语气活泼、有“活人感”，像真实运营者在群里自然说话，允许口语化和少量语气词，结尾自然引导互动，不喊口号、不堆砌形容词。',
  '朋友圈': '朋友圈：输出3条，每条150-250字左右，像真人发的圈，有小故事感、场景感，不硬广。',
  '小红书': '小红书：完整种草或知识型成稿，含标题、正文、话题标签，真实体验感。',
  '公众号': '公众号：输出具体标题、导语、详细正文和CTA。',
  '销售话术': '销售话术：按真实沟通场景输出，含开场、需求挖掘、异议处理、促成动作。',
  '短视频口播': '短视频口播：脚本化，含钩子开场、节奏点、结尾引导，标注画面建议。',
  '内部提案': '内部提案：结构完整，含背景、方案、预算参考、风险与下一步。'
};

const CHANNEL_FORMATS = {
  '朋友圈': '输出3条朋友圈文案：每条以「朋友圈①」「朋友圈②」「朋友圈③」开头，默认每条150-250字（若用户明确指定字数则严格按用户字数执行），分2-3个短段落，有具体场景和小故事感，结尾一句自然引导，不硬广。只输出这3条文案本身，不要输出任何其他分析或说明。',
  '社群运营': '输出1条社群运营文案：默认150-200字（若用户明确指定字数则严格按用户字数执行），像真实运营者在群里自然说话，有活人感、允许口语化和语气词，结尾自然引导互动。只输出这条文案本身。',
  '小红书': '输出1篇完整小红书笔记：标题（带emoji、15字左右）+正文（默认600-1000字，若用户明确指定字数则严格按用户字数执行，真实体验感、分小节）+结尾5个话题标签。只输出笔记本身。',
  '公众号': '输出1篇公众号文章：10-20字标题、80字内导语、正文（默认1200-2000字，若用户明确指定字数则严格按用户字数执行，分小节）、结尾CTA。',
  '销售话术': '输出销售话术：按「开场→需求挖掘→异议处理→促成」的顺序，写成能直接对客户说出口的话，标注每一段的话术目的。',
  '短视频口播': '输出短视频口播脚本：开头钩子（3秒内）+正文3-5个节奏点+结尾引导，每句标注画面建议。',
  '内部提案': '输出内部提案：背景→方案→预算参考→风险→下一步，结构完整、可直接汇报。'
};

const KNOWLEDGE_STANCE = `平台立场（最高优先级，必须严格遵守）：你是携程酒店服务市场（Hmall）的内容运营。
服务市场是酒店B2B一站式采购与服务平台：服务商/供应商把酒店经营所需的产品与服务
（主题房方案、酒店用品、布草、设施、设计、旅拍、运营服务等）上架到服务市场，
酒店客户在平台上浏览、比价、下单、支付与售后。
『上新』指产品/服务在服务市场上架，而不是酒店房型上新。
所有内容站在服务市场/商家面向酒店客户的角度，但必须按内容类型区分主次：
· 产品/主题房/酒店运营类（产品类、干货类）：以产品/方案本身为核心，讲清它为酒店创造的价值；
  可适度引用平台优势与免房置换作为采购理由（这是允许的），但不要展开六项保障、退换货、
  售后、纠纷处理等平台内容，也不要写成"服务市场平台宣传稿"。
· 平台规则/支付/活动类（平台类、支付类、活动类）：才重点展开讲解服务市场平台、六项保障、
  下单支付流程、活动优惠等。
不要把内容写成酒店经营者对住客的自我宣传（除非用户明确选择『酒店视角』）；
涉及平台规则与官方表述，以携程酒店商家管理后台官网（ebooking.ctrip.com/hmall/index）
及服务市场官方页面为准，不要凭空编造；联网搜索结果仅作事实与趋势参考，不要照搬其表述视角。`;

const INSIGHT_STANCE = `内容定位（最高优先级，必须严格遵守）：本任务只输出「纯引流干货」——面向酒店经营者的运营知识、常见问题、服务改善方法与解决对策。
禁止出现：服务市场、在售商品、主题房/舒睡房等改造方案、价格、采购、优惠券、免房置换、下单或去服务市场等任何导购内容；不要写成平台广告。
写法：站在资深酒店从业者/行业编辑的角度，用程长营公众号的营销口吻输出干货（短句钩子、数字清单/步骤体、真实做法与话术、金句收尾）。
结尾如需引导，只引导“收藏/转发/关注账号持续学习”，不引导购买。`;

const PRODUCT_BRIEF = `服务市场在售产品速览（写内容时可引用）：客房用品、酒店布草、酒店设施、智能化、
视觉设计、特色服务等品类上千个SKU；主题房改造（亲子房、宠物友好房、影音房、舒睡房等）
是设计+物资配置+运营营销的一站式方案，酒店可按需选择、一站配齐（具体价格以服务市场页面为准）。`;

/* 文案口径清洗：去掉退换货/纠纷等地掉价的措辞，避免模型引用或写出 */
function cleanMarketText(text) {
  return String(text || '')
    .replace(/7天无理由退货/g, '')
    .replace(/无理由退货/g, '')
    .replace(/退换货/g, '')
    .replace(/退货/g, '')
    .replace(/防纠纷/g, '')
    .replace(/纠纷/g, '')
    .replace(/\s{2,}/g, ' ')
    .trim();
}

/* 产品/干货内容用：只保留免房置换、集采、灵活结算等"可作采购理由"的平台支撑，
   过滤掉放心/低价/售后/退换/纠纷等平台套话，避免产品文案写成平台宣传稿 */
function platformSupportForProduct(text) {
  const lines = Array.isArray(text) ? text : String(text || '').split('\n');
  const kept = lines
    .map(l => String(l).replace(/^[·\s]+/, ''))
    .filter(l => l && !/放心|低价|售后|退换|退货|纠纷|赔付|保障/.test(l));
  const joined = kept.join('；');
  return cleanMarketText(joined) || '免房置换、一站式集采、灵活结算等平台优势（具体以服务市场页面为准）';
}

function pureInsightContext() {
  const cat = knowledge.categories?.insight || {};
  const blocks = [];
  if (ganhuoDocs.length) {
    const ghBlock = ganhuoDocs.slice(0, 30).map(g => `· ${String(g.points || '').slice(0, 600)}`).join('\n');
    const styleBlock = ganhuoDocs.slice(0, 8).map(g => {
      const s = g.style || {};
      const titles = Array.isArray(s.titles) ? s.titles.join('；') : (s.titles || '');
      const parts = [];
      if (titles) parts.push('标题范例：' + titles);
      if (s.structure) parts.push('结构：' + s.structure);
      if (s.tone) parts.push('文风：' + s.tone);
      return parts.length ? '· ' + parts.join(' ｜ ') : '';
    }).filter(Boolean).join('\n');
    blocks.push(`【纯引流干货知识库（定位：只讲酒店运营知识/常见问题/服务改善/解决对策；必须把下面的要点改写成具体步骤、清单、话术或案例细节展开，禁止只概述观点；禁止出现任何商品、主题房改造、价格、采购、优惠券或引导去服务市场下单的内容）】\n${ghBlock}`);
    if (styleBlock) blocks.push(`【程长营公众号风格样本（标题与行文请模仿：营销口吻、短句钩子、数字清单/步骤体、真实案例、金句收尾、"建议收藏/转给…"等行动号召）】\n${styleBlock}`);
  }
  const topics = Array.isArray(cat.topics) ? cat.topics.join('、') : '';
  blocks.push(`【内容定位】纯引流运营干货：${cat.description || ''}${topics ? '（选题方向：' + topics + '）' : ''}`);
  let context = cleanMarketText(blocks.join('\n\n'));
  if (context.length > 16000) context = context.slice(0, 16000);
  return context;
}

function knowledgeContext(payload) {
  if (payload.category === 'insight') return pureInsightContext();
  const cat = knowledge.categories?.[payload.category] || {};
  const mp = knowledge.marketplace || {};
  const catName = cat.name || payload.category || '';
  const topics = Array.isArray(cat.topics) ? cat.topics.join('、')
    : (cat.topics ? Object.keys(cat.topics).join('、') : '');
  const catalog = Array.isArray(mp.catalog?.categories)
    ? mp.catalog.categories.map(c => `· ${c.name}：${c.desc}（${(c.examples || []).join('；')}）`).join('\n')
    : '';
  const advantages = Array.isArray(mp.advantages?.platform_advantages)
    ? mp.advantages.platform_advantages.map(a => `· ${a}`).join('\n')
    : '';
  const guarantees = mp.advantages?.official_guarantees || '';
  const live = mp.live || {};
  const liveCats = Array.isArray(live.categories) ? live.categories : [];
  const wantsCompare = /对比|比较|分析|竞品|哪个好|哪家好|品牌推荐|选型|区别|差异|怎么选/.test(String(payload.needs || '') + String(payload.product || '') + String(payload.content_type || ''));
  // 商品关键词：把用户输入的产品/需求，命中到实时商品库最相关的三级类目
  const PRODUCT_KEYWORDS = ['洗漱','香皂','拖鞋','牙膏','牙刷','牙具','浴帽','梳子','剃须','洗发','沐浴','纸巾','一次性','耗品','客房','布草','毛巾','浴巾','床单','被套','枕芯','床垫','枕套','浴袍','吹风机','洗护','小家电','水壶','电话','儿童','宠物','亲子','影音','舒睡','智能','机器人','设备','清洁','除味','香氛','食材','咖啡','食物','饮料','客房打扫','母婴','儿童牙刷','拍摄','摄影','旅拍','影像','图文','视觉','安全','充电','餐厨','厨房','餐饮','食品','装修','建筑','建材','培训','招聘','人才','金融','贷款','软件','系统','康养','运动','农资','园艺','暖通','水电','公区','电器','卫浴','家具','窗帘','灯具','工程'];
  const userText = String(payload.product || '') + String(payload.needs || '') + String(payload.content_type || '');
  const catText = c => [c.name, c.parent, ...(c.sub_categories || []), ...(c.brands || []), ...(c.sample_products || [])].join(' ');
  const scoreCat = c => PRODUCT_KEYWORDS.reduce((s, k) => s + (userText.includes(k) && catText(c).includes(k) ? 1 : 0), 0);
  const scoredCats = liveCats.map(c => ({ c, s: scoreCat(c) })).sort((a, b) => b.s - a.s);
  const positiveCats = scoredCats.filter(x => x.s > 0);
  let chosenCats;
  if (wantsCompare) {
    chosenCats = (positiveCats.length ? positiveCats : scoredCats).slice(0, 10).map(x => x.c);
  } else if (positiveCats.length) {
    const topScore = positiveCats[0].s;
    chosenCats = positiveCats.filter(x => x.s >= topScore).slice(0, 3).map(x => x.c);
    if (!chosenCats.length) chosenCats = positiveCats.slice(0, 3).map(x => x.c);
  } else {
    chosenCats = []; // 无匹配关键词时不塞随机类目，避免带偏（如舒睡房/布草）
  }
  let matchedCats = chosenCats;
  // 商品ID匹配：一旦输入 id67395 / 67327 这类商品ID，就按该商品所属类目注入，避免关键词兜底带错类目
  const _pidx = mp.product_index || {};
  const _idText = String(payload.product || '') + ' ' + String(payload.needs || '') + ' ' + String(payload.content_type || '');
  const _foundIds = new Set();
  (_idText.match(/id\s*(\d+)/gi) || []).forEach(m => { const v = String(m).replace(/\D/g, ''); if (_pidx[v]) _foundIds.add(v); });
  (_idText.match(/\b(\d{4,6})\b/g) || []).forEach(v => { if (_pidx[v]) _foundIds.add(v); });
  const _matchedProducts = [..._foundIds].map(id => _pidx[id]).slice(0, 6);
  if (_matchedProducts.length) {
    const _wantCats = new Set(_matchedProducts.map(p => p.cat).filter(Boolean));
    const _wantPar = new Set(_matchedProducts.map(p => p.parent).filter(Boolean));
    const _catSel = liveCats.filter(c => _wantCats.has(c.name) || (_wantPar.has(c.parent) && !_wantCats.has(c.name)));
    if (_catSel.length) matchedCats = _catSel.slice(0, 4);
  }
  const focusedProduct = _matchedProducts.length > 0;
  const liveCatBlock = matchedCats.length
    ? matchedCats.slice(0, wantsCompare ? 10 : 6).map(c =>
        `· ${c.parent} / ${c.name}（cat=${c.cat}）\n` +
        `  三级分类：${(c.sub_categories || []).join('、') || '—'}\n` +
        `  代表品牌：${(c.brands || []).join('、') || '—'}` +
        (wantsCompare && c.brands?.length ? `（服务市场在售，可按需对比）` : '') + '\n' +
        `  在售代表商品：${(c.sample_products || []).join('；') || '—'}`
      ).join('\n')
    : '';
  const wantsRecommendation = /推荐|好物|精选|清单|爆款/.test(String(payload.needs || '') + String(payload.content_type || ''));
  const kw = String(payload.needs || '') + String(payload.product || '');
  const isBroadCat = !payload.category || ['product', 'platform', 'campaign', 'insight', 'payment'].includes(payload.category);
  const kwScore = p => {
    let s = 0;
    const hit = t => (p.name || '').includes(t) || (p.cat || '').includes(t) || (p.note || '').includes(t);
    PRODUCT_KEYWORDS.forEach(t => { if (kw.includes(t) && hit(t)) s += 3; });
    return s;
  };
  const flagshipBlock = Array.isArray(live.flagship_products)
    ? live.flagship_products
        .filter(p => wantsRecommendation || wantsCompare || isBroadCat || !p.cat || p.cat === payload.category || p.cat.includes(payload.category))
        .sort((a, b) => kwScore(b) - kwScore(a))
        .slice(0, (wantsRecommendation || wantsCompare) ? 24 : 12)
        .map(p => `· ${p.name}｜${p.cat || ''}｜${p.price}｜${p.sales || ''}${p.rating ? '｜' + p.rating : ''}${p.coupon ? '｜' + p.coupon : ''}${p.note ? '｜' + p.note : ''}`)
        .join('\n')
    : '';
  const couponBlock = Array.isArray(live.key_coupons)
    ? live.key_coupons.map(c => `· ¥${c.amount} ${c.threshold}｜${c.scope}${c.note ? '｜' + c.note : ''}`).join('\n')
    : '';
  const stats = live.platform_stats || {};
  const isProductFocus = ['product', 'insight'].includes(payload.category);
  const sections = [];
  if (!isProductFocus && mp.what_is) sections.push(`【服务市场是什么】${mp.what_is}`);
  if (!focusedProduct) sections.push(`【服务市场产品体系】\n${catalog || PRODUCT_BRIEF}`);
  if (!isProductFocus && guarantees) sections.push(`【官方六大服务保障】${guarantees}`);
  if (advantages) sections.push(isProductFocus
    ? `【平台支撑（可选引用，点到即止，不要把平台套话当产品卖点）】\n${platformSupportForProduct(advantages)}`
    : `【平台优势】\n${advantages}`);
  if (liveCats.length) {
    sections.push(`【服务市场实时商品库（${live.updated_at || '最近抓取'}快照）】
平台大盘：${stats.suppliers || '—'}家供应商｜年销量${stats.annual_sales_orders || '—'}单｜在售商品${stats.sku_count || '—'}种
${liveCatBlock || '（当前分类暂无明细，可参考其他分类）'}`);
  }
  // 真实在售商品 + 细分属性（抓取自服务市场商品详情页）：让生成能引用到具体香型/规格/包装/起订量等
  const detailCats = matchedCats.filter(c => c.real_products || c.detail_attrs);
  if (detailCats.length) {
    const realBlock = detailCats.slice(0, 2).map(c => {
      const attrs = c.detail_attrs || {};
      const attrLine = Object.entries(attrs)
        .map(([k, vals]) => `${k}：${(vals || []).slice(0, 8).join('、')}`)
        .join('；');
      const prods = (c.real_products || []).slice(0, 8)
        .map(p => `· ${p.name}｜¥${p.price || ''}｜${p.sale || ''}`)
        .join('\n');
      return `【${c.parent || ''}·${c.name} 真实在售与细分属性】\n${attrLine}\n${prods}`;
    }).join('\n\n');
    sections.push(realBlock);
  }
  // 商品ID匹配：输入 “id67395 / 67327” 或直接写商品ID，即命中该商品，提示词围绕它写
  const pidx = mp.product_index || {};
  const idText = String(payload.product || '') + ' ' + String(payload.needs || '') + ' ' + String(payload.content_type || '');
  const foundIds = new Set();
  (idText.match(/id\s*(\d+)/gi) || []).forEach(m => { const v = String(m).replace(/\D/g, ''); if (pidx[v]) foundIds.add(v); });
  (idText.match(/\b(\d{4,6})\b/g) || []).forEach(v => { if (pidx[v]) foundIds.add(v); });
  const matchedProducts = [...foundIds].map(id => pidx[id]).slice(0, 6);
  if (matchedProducts.length) {
    const prodBlock = matchedProducts.map(p => {
      const params = p.params ? Object.entries(p.params).map(([k, v]) => `${k} ${v}`).join('、') : '';
      return `ID ${p.id}｜[${p.parent || ''}·${p.cat || ''}] ${p.name}｜¥${p.price || ''}${p.sale ? '｜' + p.sale : ''}${params ? '\n  商品参数：' + params : ''}`;
    }).join('\n');
    sections.push(`【匹配商品（写内容请围绕这些商品、以这里的真实数据为准，不要编造品牌/价格/规格）】\n${prodBlock}`);
  }
  if (ganhuoDocs.length) {
    const ghBlock = ganhuoDocs.slice(0, 12).map(g => `· ${String(g.points || '').slice(0, 500)}`).join('\n');
    const styleBlock = ganhuoDocs.slice(0, 6).map(g => {
      const s = g.style || {};
      const titles = Array.isArray(s.titles) ? s.titles.join('；') : (s.titles || '');
      const parts = [];
      if (titles) parts.push('标题范例：' + titles);
      if (s.structure) parts.push('结构：' + s.structure);
      if (s.tone) parts.push('文风：' + s.tone);
      return parts.length ? '· ' + parts.join(' ｜ ') : '';
    }).filter(Boolean).join('\n');
    const styleHint = styleBlock
      ? `\n\n【程长营公众号风格样本（写干货类标题与正文时请模仿：营销口吻、短句钩子、数字清单/步骤体、真实案例、金句收尾、"建议收藏/转给…"等行动号召）】\n${styleBlock}`
      : '';
    sections.push(`【干货类知识库（写干货类内容时必须引用这些要点/观点/方法作为论据，并把要点改写成具体步骤、清单、话术或案例细节展开，禁止只概述观点；生成时选「干货类」即基于此产出）】\n${ghBlock}${styleHint}`);
  }
  if (flagshipBlock && !focusedProduct) sections.push(`【服务市场热销/上新好物参考】\n${flagshipBlock}`);
  if (!isProductFocus && couponBlock) sections.push(`【服务市场当前活动券参考】\n${couponBlock}`);
  if (live.update_note) sections.push(`【数据时效说明】${live.update_note}`);
  const larkDocs = Array.isArray(knowledge.lark_docs) ? knowledge.lark_docs : [];
  if (larkDocs.length) {
    sections.push(`【飞书内容库（自动同步，内容以飞书文档为准，引用时优先采用）】\n${larkDocs.map(d =>
      `· ${d.name || d.key}（更新于 ${d.updated_at || '—'}）\n${String(d.text).slice(0, 3200)}`).join('\n\n')}`);
  }
  const helpDocs = Array.isArray(cat.help_docs) ? cat.help_docs : [];
  if (helpDocs.length) {
    sections.push(`【服务市场官方帮助文档（${catName}，引用时以文档为准）】\n${helpDocs.map(d =>
      `· ${d.title}：\n${String(d.text).slice(0, 1100)}`).join('\n\n')}`);
  }
  sections.push(`【当前知识库分类】${catName}：${cat.description || ''}${topics ? '（可参考主题：' + topics + '）' : ''}`);
  if (mp.official_site) sections.push(`【官方来源】${mp.official_site}——涉及平台规则以官方页面为准`);
  // 控制注入知识的总长度：太长会显著拖慢模型、容易触发中转超时
  let context = cleanMarketText(sections.join('\n\n'));
  if (context.length > 16000) context = context.slice(0, 16000);
  return context;
}

function matchedProductInfo(payload) {
  const windowIdx = (typeof window !== 'undefined' && window.PRODUCT_INDEX) || null;
  const mp = (typeof knowledge !== 'undefined' && knowledge.marketplace) || {};
  const pidx = windowIdx || mp.product_index || {};
  const idText = String(payload.product || '') + ' ' + String(payload.needs || '') + ' ' + String(payload.content_type || '');
  const ids = new Set();
  (idText.match(/id\s*(\d+)/gi) || []).forEach(m => { const v = String(m).replace(/\D/g, ''); if (pidx[v]) ids.add(v); });
  (idText.match(/\b(\d{4,6})\b/g) || []).forEach(v => { if (pidx[v]) ids.add(v); });
  return [...ids].map(id => pidx[id]).slice(0, 3);
}

function buildFocusedSystem(payload) {
  const prods = matchedProductInfo(payload);
  if (!prods.length) return null;
  const prodBlock = prods.map(p => {
    const params = p.params ? Object.entries(p.params).map(([k, v]) => `${k}：${v}`).join('；') : '';
    return `- 【商品】${p.name}（ID ${p.id}，${p.parent || ''}·${p.cat || ''}）\n` +
      `  价格参考：¥${p.price || ''}${p.sale ? '；' + p.sale : ''}\n` +
      (params ? `  真实参数：${params}\n` : '');
  }).join('\n');
  return `你是携程酒店服务市场（TripMALL）的资深内容运营，为酒店写真实、生动、可直接发布的中文内容。
平台立场：服务市场是面向酒店客户的一站式采购平台，内容站在平台/商家角度，讲清产品为酒店创造的价值、为什么在服务市场采购更省心省力省钱；不要写成酒店对住客的自我宣传（除非用户明确要酒店视角）。
本次要宣传的商品（必须围绕以下真实信息写，严禁编造品牌/价格/规格/克重/起订量）：
${prodBlock}
写作要求：开头用钩子戳酒店采购/店长/老板的痛点 → 场景化描述 → 给出解法 → **正面引用上面商品给出的真实价格/克重/起订量/适用档次**（价格可写“参考价”，并注明“以服务市场页面为准”）→ 点出平台保障（免房置换抵采购额度、低价保证、送货到店、快速开票、先行赔付）→ 结尾给明确行动（去服务市场下单/私信领方案）。不夸大、不绝对化、不用“放心/低价/售后退货/纠纷”等掉价字眼。按所选渠道格式输出：公众号=抓眼球标题+导语+分段正文+CTA；朋友圈=3条各150-250字；小红书=标题+正文+话题标签。`;
}

function buildSystemPrompt(payload) {
  if (payload.category === 'insight') {
    return `你是携程酒店程长营的资深干货内容编辑，为酒店从业者写真实、专业、可直接发布的运营干货。\n\n${INSIGHT_STANCE}\n\n${knowledgeContext(payload)}`;
  }
  const focused = buildFocusedSystem(payload);
  if (focused) return focused;
  return `你是携程酒店服务市场（Hmall）的资深内容运营，为酒店写真实、生动、可直接发布的中文内容。\n\n${KNOWLEDGE_STANCE}\n\n${knowledgeContext(payload)}`;
}

function buildTaskPrompt(payload) {
  const wantsCompare = /对比|比较|分析|竞品|哪个好|哪家好|品牌推荐|选型|区别|差异|怎么选/.test(String(payload.needs || '') + String(payload.product || '') + String(payload.content_type || ''));
  const needsText = String(payload.needs || '');
  const wordMatch = needsText.match(/(\d{2,4})\s*(?:字|字左右|字以内|字以上|字上下)/);
  const wordRequirement = wordMatch
    ? `\n\n【字数要求（最高优先级，覆盖渠道默认字数）】用户明确指定字数：${wordMatch[1]}字左右。必须严格按此字数输出，允许±10%偏差，宁缺毋滥不凑字。`
    : '';
  return `请为以下任务输出内容：
产品/主题：${payload.product}
目标视角：${payload.persona}
发布渠道/文章类型：${payload.channel}
内容类型：${payload.content_type}
生成需求（个性化要求，务必逐一满足，含字数要求）：${needsText || '无'}
联网研究：${payload.research || '无'}
文章风格样本：${String(payload.style_samples || '').slice(0, 12000)}
风格画像（AI学习总结，生成时严格遵循其语气、句式与结构习惯）：${String(payload.profile || '').slice(0, 6000)}
文章结构画像（AI从素材学习，生成时严格遵循其结构框架：开头钩子、段落组织、小标题/列表用法、信息顺序、结尾CTA）：${String(payload.structure || '').slice(0, 4000)}
用户学习素材摘要（提炼要点融入，不要照抄原文）：${String(payload.materials || '').slice(0, 8000)}

【输出格式（必须严格遵守，逐字执行）】
${CHANNEL_FORMATS[payload.channel] || '按其使用场景输出完整成稿。'}
${wordRequirement}

【硬性要求】
1. 直接输出正文，禁止以“好的”“以下是为您准备的”“根据您的需求”等开头。
2. 禁止复述或总结用户需求；禁止空话、套话、车轱辘话凑字数——字数以用户指令为准：用户明确指定字数时严格按指定字数，未指定时按渠道默认，宁短勿水。
3. 站在服务市场/商家面向酒店客户的角度展开（除非用户明确要求酒店视角）。
4. 若用户给出已有文案或细节要求（调整细节、强调IP、强调功能、强调价格），先理解原意再改写，不丢失关键信息。
5. 内部数字写成参考值，不编造平台规则；避免“值得注意的是”“综上所述”“在这个…的时代”等AI腔。
${wantsCompare ? `6. 本任务需要品牌对比/分析：必须从【服务市场实时商品库】与【热销/上新好物参考】中引用真实在售品牌与商品名（如红杉树、尊客、恒创、悦诗兰庭、洁柔、小帅、奶龙、B.Duck、梦百合等），逐品牌说明定位、代表商品、价格区间、销量/好评与适用酒店场景；禁止用“某品牌”“部分品牌”“一些品牌”等含糊表述代替具体品牌名。若知识库中某品类缺少品牌数据，如实说明“该品类暂无明确品牌数据”，不得编造。` : ''}
7. 涉及具体价格、销量、优惠券时，标注“参考价/参考销量”，并提示以服务市场页面为准。
8. 效果类表述只做定性：提到“点评提升”“房价提升”“入住率提升”等效果时，写“助力点评提升”“带动房价提升”这类定性表达，不要给出具体百分比或数字；其余价格、销量等数字可用，但注明“参考值/参考销量”。
9. 不夸大、不过度承诺：禁止“一定”“保证”“100%”“立竿见影”“稳赚不赔”“从此无忧”等绝对化、夸张措辞；不写无法证实的承诺。
10. 不使用“放心”“低价”“售后”“退换货”“退货”“纠纷”“防纠纷”“维权”等平台套话或掉价措辞，改用具体、实在、可感知的表达（免房置换、一站式集采等可正常使用）。
${payload.category === 'insight' ? `\n11. 纯引流干货定位（干货类最高要求）：本篇是给酒店从业者看的运营干货，不是商品广告。全程禁止出现“服务市场、主题房/舒睡房等改造方案、商品推荐、价格、采购、优惠券、免房置换、下单引导”等任何导购内容；结尾如要引导，只引导收藏/转发/关注账号持续学习。` : ''}`;
}

function buildGeneratePrompt(payload) {
  return buildSystemPrompt(payload) + '\n\n' + buildTaskPrompt(payload);
}

$('generate').onclick = async event => {
  const button = event.currentTarget;
  const progress = startProgress('copyProgress');
  button.textContent = 'AI学习中…';
  await ensureProfile();
  button.textContent = 'AI生成中…';
  const payload = {
    category: $('category').value,
    product: $('product').value,
    persona: $('persona').value,
    channel: $('channel').value,
    content_type: $('contentType').value,
    needs: $('needs').value,
    research,
    style_samples: $('samples').value,
    profile: $('profileBox').value,
    structure: $('structureBox').value,
    materials: checkedMaterialsText()
  };
  const deepThink = $('deepThink').checked;
  try {
    let content;
    if (hasByok()) {
      content = await openAILikeChat(
        buildSystemPrompt(payload),
        buildTaskPrompt(payload) + (deepThink ? '\n\n【深度思考要求】先系统梳理：受众与渠道特点、素材与知识库要点、可用的真实品牌/商品/价格数据、卖点优先级与结构方案；再输出成稿。推理过程不需要展示，直接给出最终内容。' : ''),
        { maxTokens: deepThink ? 9000 : 6500, deep: deepThink }
      );
    } else {
      if (IS_GITHUB_PAGES) await ensurePuterAuth();
      try {
        if (IS_GITHUB_PAGES) throw new Error('使用公共AI');
        content = (await apiRequest('/api/generate', payload, 30000)).content;
      } catch (apiError) {
        content = await puterChat(buildGeneratePrompt(payload));
      }
    }
    $('result').textContent = content;
    lastCopy = content;
    lastCopyOriginal = content;
    $('copyEditBar').hidden = false;
    $('copyEditRevert').hidden = true;
    $('copyEditCmd').value = '';
    saveCopyHistory({
      category: payload.category,
      product: payload.product,
      persona: payload.persona,
      channel: payload.channel,
      content_type: payload.content_type,
      needs: payload.needs,
      content
    });
    progress.done();
  } catch (error) {
    $('result').textContent = `AI生成失败：${error.message}\n\n提示：Puter 免费额度可能已用完或需要登录。请点击上方「AI 设置」，填入 DeepSeek / 硅基流动 / 智谱 的免费 API Key（国内可直连），保存后即可恢复生成。`;
    progress.fail();
  } finally {
    button.textContent = '生成具体内容 →';
  }
};

/* AI 编辑已生成文案：按用户指令修改（不是手动修改） */
let lastCopy = '';
let lastCopyOriginal = '';

$('copyEditBtn').onclick = async () => {
  const cmd = $('copyEditCmd').value.trim();
  if (!lastCopy) return alert('请先生成文案');
  if (!cmd) return alert('先输入修改指令');
  const btn = $('copyEditBtn');
  btn.textContent = 'AI修改中…';
  btn.disabled = true;
  try {
    const system = '你是资深中文文案编辑。根据用户指令对原文进行修改：保留原文核心信息与平台立场，只按指令调整（语气、结构、字数、细节、卖点顺序等），不要复述指令，直接输出修改后的完整文案，不要加任何说明。';
    const user = `原文：\n${lastCopy}\n\n修改指令：${cmd}\n\n直接输出修改后的完整文案。`;
    let edited;
    if (hasByok()) {
      edited = await openAILikeChat(system, user, { maxTokens: 9000 });
    } else {
      if (IS_GITHUB_PAGES) await ensurePuterAuth();
      edited = await puterChat(system + '\n\n' + user);
    }
    $('result').textContent = edited;
    lastCopy = edited;
    $('copyEditRevert').hidden = false;
    $('copyEditCmd').value = '';
  } catch (error) {
    alert(`AI修改失败：${error.message}`);
  } finally {
    btn.textContent = '✏️ AI 修改';
    btn.disabled = false;
  }
};

$('copyEditRevert').onclick = () => {
  $('result').textContent = lastCopyOriginal;
  lastCopy = lastCopyOriginal;
  $('copyEditRevert').hidden = true;
  $('copyEditCmd').value = '';
};

/* ============================ 海报画布 ============================ */

const canvas = $('c');
const ctx = canvas.getContext('2d');
let objects = [];
let selected = null;
let backgroundImage = null;
let backgroundInfo = null;
let dragState = null;

function addObject(object) {
  snapshot();
  objects.push(object);
  selected = object;
  syncControls();
  draw();
  renderLayers();
}

function cover(image, x, y, w, h) {
  const ratio = Math.max(w / image.width, h / image.height);
  const sw = w / ratio;
  const sh = h / ratio;
  ctx.drawImage(image, (image.width - sw) / 2, (image.height - sh) / 2, sw, sh, x, y, w, h);
}

function draw() {
  const gradient = ctx.createLinearGradient(0, 0, canvas.width, canvas.height);
  gradient.addColorStop(0, '#fffdf9');
  gradient.addColorStop(1, '#dec5aa');
  ctx.fillStyle = gradient;
  ctx.fillRect(0, 0, canvas.width, canvas.height);
  if (backgroundImage) cover(backgroundImage, 0, 0, canvas.width, canvas.height);
  objects.forEach(object => {
    ctx.save();
    ctx.translate(object.x, object.y);
    ctx.rotate(object.rotation * Math.PI / 180);
    if (object.type === 'text') {
      ctx.font = `${object.weight || 700} ${object.size}px ${object.font}`;
      ctx.fillStyle = object.color;
      ctx.textAlign = 'center';
      ctx.textBaseline = 'middle';
      ctx.fillText(object.text, 0, 0);
      object.width = ctx.measureText(object.text).width;
      object.height = object.size * 1.25;
    } else {
      const width = object.width * object.scale;
      const height = object.height * object.scale;
      ctx.drawImage(object.image, -width / 2, -height / 2, width, height);
    }
    if (object === selected) {
      const b = bounds(object);
      ctx.strokeStyle = '#8c6846';
      ctx.lineWidth = 4;
      ctx.setLineDash([12, 8]);
      ctx.strokeRect(-b.width / 2, -b.height / 2, b.width, b.height);
      ctx.setLineDash([]);
    }
    ctx.restore();
  });
}

function bounds(object) {
  return {
    width: object.type === 'text' ? object.width : object.width * object.scale,
    height: object.type === 'text' ? object.height : object.height * object.scale
  };
}

function pointerPosition(event) {
  const rect = canvas.getBoundingClientRect();
  return {
    x: (event.clientX - rect.left) * canvas.width / rect.width,
    y: (event.clientY - rect.top) * canvas.height / rect.height
  };
}

function hit(object, x, y) {
  const b = bounds(object);
  return x > object.x - b.width / 2 && x < object.x + b.width / 2 &&
         y > object.y - b.height / 2 && y < object.y + b.height / 2;
}

let moved = false;
canvas.onpointerdown = event => {
  const point = pointerPosition(event);
  selected = [...objects].reverse().find(object => hit(object, point.x, point.y)) || null;
  moved = false;
  if (selected) dragState = { dx: point.x - selected.x, dy: point.y - selected.y };
  syncControls();
  draw();
  renderLayers();
};
canvas.onpointermove = event => {
  if (!dragState || !selected) return;
  const point = pointerPosition(event);
  selected.x = point.x - dragState.dx;
  selected.y = point.y - dragState.dy;
  moved = true;
  draw();
};
window.addEventListener('pointerup', () => {
  if (dragState && selected && moved) snapshot();
  dragState = null;
});
canvas.ondblclick = () => {
  if (!selected || selected.type !== 'text') return;
  const text = prompt('修改文本内容：', selected.text);
  if (text !== null && text.trim()) {
    snapshot();
    selected.text = text;
    draw();
  }
};
window.addEventListener('keydown', event => {
  const tag = (event.target.tagName || '').toLowerCase();
  if (['input', 'textarea', 'select'].includes(tag) || event.target.isContentEditable) return;
  if ((event.key === 'Delete' || event.key === 'Backspace') && selected) {
    event.preventDefault();
    deleteSelected();
  }
});

function syncControls() {
  if (!selected) return;
  const sizeVal = selected.type === 'text'
    ? Math.min(180, selected.size)
    : Math.min(180, selected.scale * 100);
  const sizeEl = $('size');
  if (sizeEl && sizeEl.value !== undefined) sizeEl.value = sizeVal;
  const rotateEl = $('rotate');
  if (rotateEl && rotateEl.value !== undefined) rotateEl.value = selected.rotation;
  if (selected.color) $('color').value = selected.color;
  if (selected.font) $('font').value = selected.font;
}

function smartTextColor() {
  try {
    const src = backgroundImage || (objects.find(o => o.type === 'image') || {}).src;
    if (!src) return '#29231e';
    const temp = document.createElement('canvas');
    temp.width = 24;
    temp.height = 24;
    const g = temp.getContext('2d');
    g.drawImage(src, 0, 0, 24, 24);
    const d = g.getImageData(0, 0, 24, 24).data;
    let sum = 0, n = 0;
    for (let i = 0; i < d.length; i += 4) {
      sum += 0.299 * d[i] + 0.587 * d[i + 1] + 0.114 * d[i + 2];
      n++;
    }
    const avg = sum / n;
    return avg > 150 ? '#29231e' : '#ffffff';
  } catch {
    return '#29231e';
  }
}

function addText(text, x, y, size = 72, color = smartTextColor(), font = 'Microsoft YaHei', weight = 700) {
  addObject({
    type: 'text', text, x, y, size, color, font, weight,
    rotation: 0, width: 400, height: size
  });
}

$('addText').onclick = () => addText($('newText').value, 540, 500, 90, $('color').value, $('font').value, 800);

$('size').oninput = event => {
  if (!selected) return;
  if (selected.type === 'text') selected.size = +event.target.value;
  else selected.scale = +event.target.value / 100;
  draw();
};
$('size').onchange = () => { if (selected) snapshot(); };
$('rotate').oninput = event => {
  if (selected) { selected.rotation = +event.target.value; draw(); }
};
$('rotate').onchange = () => { if (selected) snapshot(); };
$('color').oninput = event => {
  if (selected?.type === 'text') { selected.color = event.target.value; draw(); }
};
$('color').onchange = () => { if (selected) snapshot(); };
$('font').onchange = event => {
  if (selected?.type === 'text') { selected.font = event.target.value; draw(); snapshot(); }
};

function deleteSelected() {
  if (!selected) return;
  snapshot();
  objects = objects.filter(object => object !== selected);
  selected = null;
  draw();
  renderLayers();
}

$('delete').onclick = deleteSelected;
$('front').onclick = () => {
  if (!selected) return;
  snapshot();
  objects = objects.filter(object => object !== selected);
  objects.push(selected);
  draw();
  renderLayers();
};

function loadImageFile(file, callback) {
  if (!file) return;
  const image = new Image();
  image.onload = () => callback(image);
  image.src = URL.createObjectURL(file);
}

$('upload').onchange = event => loadImageFile(event.target.files[0], image => {
  addObject({
    type: 'image', image,
    x: 540, y: 1050,
    width: image.width, height: image.height,
    scale: Math.min(600 / image.width, 600 / image.height),
    rotation: 0
  });
  event.target.value = '';
});

/* 素材列表：点击 × 直接删除 */

function renderLayers() {
  $('layerList').innerHTML = objects.length ? objects.map((object, index) => {
    const label = object.type === 'text'
      ? (object.text || '文本').slice(0, 14)
      : '图片素材';
    return `<div class="layer-item ${object === selected ? 'on' : ''}" data-index="${index}">
      <span class="badge">${object.type === 'text' ? '文' : '图'}</span>
      <span class="name">${escapeHtml(label)}</span>
      <button class="x" data-del="${index}" title="直接删除该素材">×</button>
    </div>`;
  }).join('') : '<p class="empty">画布为空，添加文本、贴纸或图片后显示在这里。</p>';
  $('layerList').querySelectorAll('.layer-item').forEach(row => {
    row.onclick = event => {
      if (event.target.classList.contains('x')) return;
      selected = objects[+row.dataset.index] || null;
      syncControls();
      draw();
      renderLayers();
    };
  });
  $('layerList').querySelectorAll('.x').forEach(button => {
    button.onclick = () => {
      snapshot();
      objects = objects.filter((_, index) => index !== +button.dataset.del);
      selected = null;
      draw();
      renderLayers();
    };
  });
}

/* ============================ 撤销 / 重做 / 草稿 ============================ */

let historyStack = [];
let historyPos = -1;

function cloneState() {
  return {
    objects: objects.map(object => ({ ...object })),
    backgroundImage,
    backgroundInfo: backgroundInfo ? { ...backgroundInfo } : null,
    canvasW: canvas.width,
    canvasH: canvas.height
  };
}

function snapshot() {
  historyStack = historyStack.slice(0, historyPos + 1);
  historyStack.push(cloneState());
  if (historyStack.length > 40) historyStack.shift();
  historyPos = historyStack.length - 1;
  updateHistoryButtons();
}

function restoreState(state) {
  canvas.width = state.canvasW || 1080;
  canvas.height = state.canvasH || 1920;
  objects = state.objects.map(object => ({ ...object }));
  backgroundImage = state.backgroundImage;
  backgroundInfo = state.backgroundInfo ? { ...state.backgroundInfo } : null;
  selected = null;
  $('posterWidth').value = canvas.width;
  $('posterHeight').value = canvas.height;
  draw();
  renderLayers();
  updateHistoryButtons();
}

function updateHistoryButtons() {
  $('undo').disabled = historyPos <= 0;
  $('redo').disabled = historyPos >= historyStack.length - 1;
}

$('undo').onclick = () => {
  if (historyPos <= 0) return;
  historyPos--;
  restoreState(historyStack[historyPos]);
};
$('redo').onclick = () => {
  if (historyPos >= historyStack.length - 1) return;
  historyPos++;
  restoreState(historyStack[historyPos]);
};

function serializeImage(image) {
  const temp = document.createElement('canvas');
  temp.width = image.naturalWidth || image.width;
  temp.height = image.naturalHeight || image.height;
  temp.getContext('2d').drawImage(image, 0, 0);
  return temp.toDataURL('image/png');
}

function imageFromDataURL(url) {
  return new Promise((resolve, reject) => {
    const image = new Image();
    image.onload = () => resolve(image);
    image.onerror = reject;
    image.src = url;
  });
}

function renderDraftCount() {
  $('draftCount').textContent = drafts.length;
}

$('saveDraft').onclick = () => {
  if (!objects.length && !backgroundImage) return alert('画布为空，先添加内容再保存草稿。');
  const data = {
    objects: objects.map(object => object.type === 'image'
      ? { ...object, imageData: serializeImage(object.image) }
      : { ...object }),
    backgroundImage: backgroundImage ? serializeImage(backgroundImage) : null,
    backgroundInfo
  };
  drafts.unshift({
    id: Date.now(),
    name: `${$('newText').value || '未命名海报'} ${new Date().toLocaleTimeString('zh-CN', { hour: '2-digit', minute: '2-digit' })}`,
    date: Date.now(),
    data
  });
  if (drafts.length > 15) drafts = drafts.slice(0, 15);
  lsSet(LS.drafts, drafts);
  renderDraftCount();
  alert('已保存草稿，可在“我的草稿”中恢复继续编辑。');
};

function renderDraftList() {
  $('draftList').innerHTML = drafts.length ? drafts.map(draft => `
    <div class="draft-item">
      <span class="name">${escapeHtml(draft.name)}</span>
      <span class="time">${new Date(draft.date).toLocaleString('zh-CN')}</span>
      <button data-restore="${draft.id}">恢复</button>
      <button class="x" data-del="${draft.id}" title="删除草稿">×</button>
    </div>`).join('') : '<p class="empty">还没有草稿。排版到一半时点击“存为草稿”，下次直接恢复。</p>';
  $('draftList').querySelectorAll('[data-restore]').forEach(button => {
    button.onclick = () => restoreDraft(+button.dataset.restore);
  });
  $('draftList').querySelectorAll('[data-del]').forEach(button => {
    button.onclick = () => {
      drafts = drafts.filter(draft => draft.id !== +button.dataset.del);
      lsSet(LS.drafts, drafts);
      renderDraftCount();
      renderDraftList();
    };
  });
}

async function restoreDraft(id) {
  const draft = drafts.find(item => item.id === id);
  if (!draft) return;
  try {
    const data = draft.data;
    const nextObjects = [];
    for (const object of data.objects) {
      if (object.type === 'image' && object.imageData) {
        nextObjects.push({ ...object, image: await imageFromDataURL(object.imageData) });
      } else {
        nextObjects.push({ ...object });
      }
    }
    snapshot();
    objects = nextObjects;
    backgroundImage = data.backgroundImage ? await imageFromDataURL(data.backgroundImage) : null;
    backgroundInfo = data.backgroundInfo ? { ...data.backgroundInfo } : null;
    selected = null;
    draw();
    renderLayers();
    $('draftModal').hidden = true;
    alert('草稿已恢复。');
  } catch (error) {
    alert(`恢复草稿失败：${error.message}`);
  }
}

$('openDrafts').onclick = () => {
  renderDraftList();
  $('draftModal').hidden = false;
};
$('closeDrafts').onclick = () => { $('draftModal').hidden = true; };
$('clearDrafts').onclick = () => {
  if (!confirm('确认清空所有草稿？')) return;
  drafts = [];
  lsSet(LS.drafts, drafts);
  renderDraftCount();
  renderDraftList();
};
renderDraftCount();

/* 海报功能导航：点击导航块切换对应功能页 */
const posterNav = $('posterNav');
if (posterNav) {
  posterNav.querySelectorAll('button[data-view]').forEach(button => {
    button.onclick = () => {
      posterNav.querySelectorAll('button[data-view]').forEach(b => b.classList.remove('on'));
      button.classList.add('on');
      document.querySelectorAll('#poster .view').forEach(view => {
        view.hidden = view.dataset.view !== button.dataset.view;
      });
    };
  });
}

/* AI 成品海报：指令 + 参考图 → 一键生成成品海报 */

function parseInstructionSize(text) {
  const t = String(text || '');
  let m = t.match(/(\d{3,4})\s*[xX×*]\s*(\d{3,4})/);
  if (m) {
    const w = Math.min(4096, Math.max(200, +m[1]));
    const h = Math.min(4096, Math.max(200, +m[2]));
    return { w, h, ratio: w / h, label: w > h ? '横版' : (w < h ? '竖版' : '方形') };
  }
  m = t.match(/(\d+)\s*:\s*(\d+)/);
  if (m) {
    const a = +m[1];
    const b = +m[2];
    if (a > 0 && b > 0) return { ratio: a / b, label: a > b ? '横版' : (a < b ? '竖版' : '方形') };
  }
  if (/超长图|超长|长图|长条图/.test(t)) return { ratio: 1 / 2.2, label: '竖版长图' };
  if (/竖版|9:16|垂直|纵向/.test(t)) return { ratio: 9 / 16, label: '竖版' };
  if (/横版|16:9|水平|横向/.test(t)) return { ratio: 16 / 9, label: '横版' };
  if (/方形|正方|1:1/.test(t)) return { ratio: 1, label: '方形' };
  return null;
}

/* 按历史实际生成耗时动态预估进度条时长：第二次起进度条与实际等待时间基本同步 */
const imageGenDurations = [];

function estimateImageDuration() {
  if (!imageGenDurations.length) return 50000;
  const avg = imageGenDurations.reduce((a, b) => a + b, 0) / imageGenDurations.length;
  return Math.min(240000, Math.max(30000, Math.round(avg * 1.2)));
}

function recordImageDuration(ms) {
  imageGenDurations.push(ms);
  if (imageGenDurations.length > 5) imageGenDurations.shift();
}

/* 每张海报独立：生成结束后清空参考图（上传文件 + 知识库配图），
   避免上一次的参考图"残留记忆"影响下一次生成 */
function clearPosterRefs() {
  selectedKbImage = '';
  const ref = $('aiPosterRef');
  if (ref) ref.value = '';
  const grid = $('kbPosterImgs');
  if (grid) grid.querySelectorAll('.kb-img.on').forEach(el => el.classList.remove('on'));
}

/* 选好参考图后立即提示，避免"以为传了参考图其实没挂上" */
const aiPosterRefInput = $('aiPosterRef');
if (aiPosterRefInput) {
  aiPosterRefInput.addEventListener('change', () => {
    const files = Array.from(aiPosterRefInput.files || []).slice(0, 3);
    const status = $('aiPosterStatus');
    if (status) status.textContent = files.length
      ? `已选择 ${files.length} 张参考图：${files.map((f, i) => `图${['一','二','三'][i] || i + 1}=${f.name}`).join('，')}（指令里可用「图一/图二/图三」分别引用）`
      : '';
  });
}

$('aiPosterBtn').onclick = async event => {
  const button = event.currentTarget;
  const t0 = Date.now();
  const progress = startProgress('aiPosterProgress', estimateImageDuration());
  const files = Array.from($('aiPosterRef').files || []).slice(0, 3);
  const cmd = $('aiPosterCmd').value.trim();
  const extraText = $('aiPosterText').value.trim();
  // 海报只使用海报区自己的输入（指令/补充文字/参考图），无风格下拉、无任何自动注入。
  // 不再自动带入主界面的产品/需求字段，避免"没写却生成相关内容"的乱生成。
  const instruction = cmd;
  const hasRef = files.length > 0 || !!selectedKbImage;
  let psize = posterSizeInfo();
  const instSize = parseInstructionSize(instruction);
  if (instSize) {
    if (instSize.w && instSize.h) {
      setPosterSize(instSize.w, instSize.h);
    } else if (instSize.ratio) {
      // 画布直接按成品尺寸来，避免出图后再缩放导致下载偏小
      const maxSide = instSize.ratio === 1 ? 1440 : 1920;
      const w = instSize.ratio >= 1 ? maxSide : Math.round(maxSide * instSize.ratio);
      const h = instSize.ratio >= 1 ? Math.round(maxSide / instSize.ratio) : maxSide;
      setPosterSize(w, h);
    }
    psize = posterSizeInfo();
  } else if (hasRef && !instSize) {
    // 有参考图且指令未指定尺寸：先按参考图本身比例定画布（参考图优先），再按文字量自动拉长
    const refSize = await referenceNaturalSize(files[0] || selectedKbImage);
    if (refSize && refSize.w > 0 && refSize.h > 0) {
      const r = refSize.w / refSize.h;
      if (r >= 1) {
        setPosterSize(1920, Math.round(1920 / r));
      } else {
        setPosterSize(Math.round(1920 * r), 1920);
      }
    }
    const charCount = extraText.length + instruction.length;
    if (charCount > 350) {
      setPosterSize(Math.round(1920 * (1 / 2.2)), 1920); // 1:2.2 长图
    } else if (charCount > 180) {
      setPosterSize(Math.round(1920 * (9 / 16)), 1920); // 9:16 竖版
    }
    psize = posterSizeInfo();
  }
  const gcd = (a, b) => (b ? gcd(b, a % b) : a);
  const ratioText = `${psize.w / gcd(psize.w, psize.h)}:${psize.h / gcd(psize.w, psize.h)}`;
  const assetTextBlock = extraText
    ? `\n【需要排版展示的文字】必须完整放进画面，由你排版，一条都不能少、不能截断、不能改写：\n${extraText}`
    : '';
  let prompt;
  if (hasRef) {
    // 参考图优先模式（支持多张）：参考图是唯一设计基准，用户指令可分别引用图一/图二/图三。
    // 不再附带任何可能与参考图冲突的约束（不预设配色、不禁止装饰元素等），
    // 避免模型收到矛盾指令后自由发挥出与参考图无关的海报。
    const lengthLine = extraText.length > 60
      ? '若文字较多，海报整体可沿参考图风格纵向自然延伸拉长，确保所有文字完整放下，延伸后仍是同一套版式与视觉语言。'
      : '';
    const refCount = files.length + (selectedKbImage ? 1 : 0);
    const refHint = (files.length + (selectedKbImage ? 1 : 0)) > 1
      ? '参考图按顺序为图一、图二、图三；用户要求中的「图一/图二/图三」即依次指代这些图，请严格按编号取用对应图片的要素。'
      : '提供的参考图为图一。';
    prompt = `请以提供的 ${refCount} 张参考图作为整体风格与质感的灵感来源，围绕本次内容设计出一张既贴合参考图气质、又像全新作品的海报。${refHint}
1. 充分吸收参考图的配色、字体气质、构图节奏、装饰风格与整体氛围，作为主要设计语言；但不必逐像素复刻，可根据本次内容的多少与重点，合理调整版式、布局与元素，让成片更完整、更耐看、更有新意；
2. 用户明确指定某张图（如"按图一的排版""底图参考图二""logo 用图三"）时，以该张图对应的要素为准；未明确指定的图仅作风格/要素参考；只按下面的用户要求替换/补充内容与文字，其余部分在参考风格基础上自然发挥，确保整体协调、不偏离参考图的设计气质；
3. 画面比例默认与图一（或用户指定的基准图）一致；用户明确要求的方向或比例优先。${lengthLine}
用户要求：${instruction || '延续参考图的设计风格，做一张干净、有质感的成品海报'}${assetTextBlock}
质量要求：中文文字准确、无错别字、无乱码；所有文字完整显示、不超出边缘、不被截断；画面铺满整张图，四周无白边、白框或留白；整体具备商业海报的高质感，观感自然、不生硬。`;
  } else {
    // 无参考图：纯文字生成，保留必要的防乱码/防白边约束
    prompt = `请生成一张${psize.label}${ratioText}的酒店营销海报成品图，输出比例严格为${ratioText}。
用户指令（请严格执行）：${instruction}${assetTextBlock}
硬性要求：画面铺满整张图，四周无白边、白框、留白或空隙；图片内中文文字准确、无错别字、无乱码；所有文字完整显示、不得超出边缘或被截断；标题醒目、卖点清晰、信息层级分明、商业海报质感。只呈现指令明确要求的内容：指令未提到的配色（尤其是橘金/香槟/金色系）、卡通动物贴纸、动物插画或装饰元素一律不得出现；若指令未指定配色，使用干净自然、贴合主题的配色，不预设任何固定色调。`;
  }
  const aspectKey = psize.ratio > 1.1 ? '16:9' : (psize.ratio < 0.9 ? '9:16' : 'square');
  const genOpts = {
    aspect: aspectKey,
    size: psize.api,
    onStatus: (s) => {
      const el = $('aiPosterStatus');
      if (el) el.textContent = `AI 生成中（${s}）…`;
    }
  };
  button.textContent = 'AI生成中…';
  const refNote = (files.length || selectedKbImage) ? `（附${files.length + (selectedKbImage ? 1 : 0)}张参考图）` : '';
  $('aiPosterStatus').textContent = `正在按指令生成：${instruction.slice(0, 50)}${instruction.length > 50 ? '…' : ''}${refNote}`;
  let generatedOk = false;
  try {
    if (!hasByokImage()) {
      $('aiPosterStatus').textContent = imageConfigError();
      progress.stop();
      return;
    }
    if (!instruction) {
      progress.stop();
      $('aiPosterStatus').textContent = '请先在海报区填写生成指令（主界面的产品/需求不会自动带入海报）。';
      return;
    }
    let src;
    const imgCfg = getImageConfig();
    // 参考图优先：一旦带了参考图，就绝不降级成纯文字生成，
    // 否则模型会自由发挥出与参考图无关的海报。
    const refRefuse = '已停止生成，未降级为纯文字模式（避免产出与参考图无关的海报）；请检查图片服务商是否支持参考图编辑，或重新上传参考图后重试';
    // 支持 1-3 张参考图：依次为图一/图二/图三，指令里可用「图一/图二/图三」分别引用
    const refLabels = ['图一', '图二', '图三'];
    let refs = [];
    try {
      for (let i = 0; i < files.length; i++) {
        const resized = await resizeImageFile(files[i], 1280, { forceJpeg: true, quality: 0.85 });
        refs.push({ label: refLabels[i] || '图' + (i + 1), dataUrl: resized.dataUrl });
      }
      if (selectedKbImage && refs.length < 3) {
        const kbResp = await fetch(selectedKbImage);
        const kbBlob = await kbResp.blob();
        const kbFile = new File([kbBlob], 'kb.png', { type: kbBlob.type || 'image/png' });
        const resized = await resizeImageFile(kbFile, 1280, { forceJpeg: true, quality: 0.85 });
        refs.push({ label: refLabels[refs.length] || '图' + (refs.length + 1), dataUrl: resized.dataUrl });
      }
    } catch (buildError) {
      throw new Error(`参考图读取失败：${buildError.message}，请重新选择参考图后再试。`);
    }
    if (refs.length) {
      try {
        src = await openAILikeImage(prompt, { ...genOpts, references: refs.map(r => r.dataUrl), strictRef: true });
      } catch (refError) {
        throw new Error(`参考图生成失败：${refError.message}（${refRefuse}）`);
      }
    } else {
      src = await openAILikeImage(prompt, genOpts);
    }
    const image = new Image();
    image.src = src;
    await image.decode();
    // 生成图与画布比例不一致时自动匹配画布，避免 cover 裁剪截断文字
    const imgRatio = (image.naturalWidth || image.width) / (image.naturalHeight || image.height);
    const canvasRatio = canvas.width / canvas.height;
    if (Math.abs(imgRatio - canvasRatio) > 0.03) {
      if (canvas.width >= canvas.height) {
        setPosterSize(canvas.width, Math.round(canvas.width / imgRatio));
      } else {
        setPosterSize(Math.round(canvas.height * imgRatio), canvas.height);
      }
    }
    snapshot();
    backgroundImage = image;
    backgroundInfo = { mode: 'ai-poster' };
    objects = objects.filter(object => object.type !== 'text');
    selected = null;
    draw();
    renderLayers();
    savePosterHistory({
      type: 'ai-poster',
      instruction,
      prompt,
      engine: `${imgCfg.model}${hasRef ? '·参考图编辑' : ''}`,
      width: canvas.width,
      height: canvas.height,
      image: await posterHistoryImage(src)
    });
    generatedOk = true;
    progress.done();
    $('aiPosterStatus').textContent = hasRef
      ? `成品海报已生成（已按参考图编辑，引擎：${imgCfg.model}）。画布已更新为成品海报，可直接下载或微调。`
      : `成品海报已生成（本次为纯文字生成，未附参考图；若要参考图请先上传或点选知识库配图）。画布已更新为成品海报，可直接下载或微调。`;
  } catch (error) {
    $('aiPosterStatus').textContent = `生成失败：${error.message}`;
    progress.fail();
  } finally {
    recordImageDuration(Date.now() - t0);
    button.textContent = '🪄 AI 生成成品海报';
    // 生成成功才清空参考图，避免残留影响下一张；
    // 生成失败时保留参考图，方便用户检查配置后直接重试
    if (generatedOk) clearPosterRefs();
  }
};

/* 编辑 AI 海报：把当前画布海报作为参考图，按指令修改 */
$('aiEditBtn').onclick = async event => {
  const button = event.currentTarget;
  const t0 = Date.now();
  const progress = startProgress('aiEditProgress', estimateImageDuration());
  const cmd = $('aiEditCmd').value.trim();
  if (!cmd) {
    progress.stop();
    return alert('先输入编辑指令');
  }
  if (!hasByokImage()) {
    $('aiEditStatus').textContent = imageConfigError();
    progress.stop();
    return;
  }
  const imgCfg = getImageConfig();
  if (imgCfg.provider !== 'dashscope' && imgCfg.provider !== 'qianwen') {
    $('aiEditStatus').textContent = '编辑需要参考图能力：请把图片服务商设为「阿里云百炼」或「千问AI平台 Token Plan（月付套餐）」（qwen-image-3.0 / qwen-image-3.0-pro）。';
    progress.stop();
    return;
  }
  button.textContent = '编辑中…';
  $('aiEditStatus').textContent = '';
  try {
    // 参考图压缩到 1280 以内：保证清晰度的同时降低中转体积与耗时，避免超出 Vercel 60s 上限
    const maxSide = 1280;
    const scale = Math.min(1, maxSide / Math.max(canvas.width, canvas.height));
    const temp = document.createElement('canvas');
    temp.width = Math.round(canvas.width * scale);
    temp.height = Math.round(canvas.height * scale);
    temp.getContext('2d').drawImage(canvas, 0, 0, temp.width, temp.height);
    const reference = temp.toDataURL('image/jpeg', 0.92);
    const psize = posterSizeInfo();
    const aspectKey = psize.ratio > 1.1 ? '16:9' : (psize.ratio < 0.9 ? '9:16' : 'square');
    // AI 编辑完全 auto：尺寸/比例不写死在提示词里，由编辑指令和参考图共同决定；
    // 指令若要求改变方向、比例或尺寸（如"改成横版长图"），模型按指令调整，画布随后自动匹配
    const prompt = `请基于这张海报进行编辑，严格执行用户指令：${cmd}。指令未要求改动的部分保持与参考海报一致；若指令要求改变方向、比例或尺寸，则按指令调整；输出画面铺满整张图，四周无白边、白框、留白或空隙；中文文字准确、无错别字、无乱码，商业海报质感。`;
    const src = await openAILikeImage(prompt, { aspect: aspectKey, reference });
    const image = new Image();
    image.src = src;
    await image.decode();
    const imgRatio = (image.naturalWidth || image.width) / (image.naturalHeight || image.height);
    const canvasRatio = canvas.width / canvas.height;
    if (Math.abs(imgRatio - canvasRatio) > 0.03) {
      if (canvas.width >= canvas.height) {
        setPosterSize(canvas.width, Math.round(canvas.width / imgRatio));
      } else {
        setPosterSize(Math.round(canvas.height * imgRatio), canvas.height);
      }
    }
    snapshot();
    backgroundImage = image;
    backgroundInfo = { mode: 'ai-edit' };
    objects = objects.filter(object => object.type !== 'text');
    selected = null;
    draw();
    renderLayers();
    savePosterHistory({
      type: 'ai-edit',
      instruction: cmd,
      prompt,
      style: 'AI 编辑',
      engine: `${imgCfg.model}·参考图编辑`,
      width: canvas.width,
      height: canvas.height,
      image: await posterHistoryImage(src)
    });
    progress.done();
    $('aiEditStatus').textContent = `编辑完成（引擎：${imgCfg.model}·参考图编辑）。画布已更新为最新海报。`;
  } catch (error) {
    $('aiEditStatus').textContent = `编辑失败：${error.message}`;
    progress.fail();
  } finally {
    recordImageDuration(Date.now() - t0);
    button.textContent = '✏️ 按指令编辑当前海报';
  }
};

/* ============================ 海报AI学习 ============================ */

function referenceNaturalSize(fileOrUrl) {
  return new Promise(resolve => {
    const img = new Image();
    let url = '';
    const finish = value => {
      if (url) URL.revokeObjectURL(url);
      resolve(value);
    };
    img.onload = () => finish({ w: img.naturalWidth || img.width, h: img.naturalHeight || img.height });
    img.onerror = () => finish(null);
    if (typeof File !== 'undefined' && fileOrUrl instanceof File) {
      url = URL.createObjectURL(fileOrUrl);
      img.src = url;
    } else if (fileOrUrl) {
      img.src = fileOrUrl;
    } else {
      finish(null);
    }
    setTimeout(() => finish(null), 8000);
  });
}

function resizeImageFile(file, maxSide, { forceJpeg = false, quality = 0.9 } = {}) {
  return new Promise((resolve, reject) => {
    loadImageFile(file, image => {
      const scale = Math.min(1, maxSide / Math.max(image.width, image.height));
      const width = Math.round(image.width * scale);
      const height = Math.round(image.height * scale);
      const temp = document.createElement('canvas');
      temp.width = width;
      temp.height = height;
      temp.getContext('2d').drawImage(image, 0, 0, width, height);
      const mime = forceJpeg ? 'image/jpeg' : (file.type.includes('png') ? 'image/png' : 'image/jpeg');
      resolve({ dataUrl: temp.toDataURL(mime, quality), mime });
    });
  });
}

/* ============================ 海报尺寸 / 下载 ============================ */

function posterSizeInfo() {
  const w = canvas.width;
  const h = canvas.height;
  const ratio = w / h;
  const label = ratio > 1.15 ? '横版' : (ratio < 0.87 ? '竖版' : '方形');
  const scale = Math.min(1, 2048 / Math.max(w, h));
  return { w, h, ratio, label, api: `${Math.round(w * scale)}*${Math.round(h * scale)}` };
}

function setPosterSize(width, height) {
  const w = Math.min(4096, Math.max(200, Math.round(width)));
  const h = Math.min(4096, Math.max(200, Math.round(height)));
  const ratioX = w / canvas.width;
  const ratioY = h / canvas.height;
  const s = Math.min(ratioX, ratioY);
  snapshot();
  canvas.width = w;
  canvas.height = h;
  objects = objects.map(object => {
    const next = { ...object, x: object.x * ratioX, y: object.y * ratioY };
    if (object.type === 'text') {
      next.size = object.size * s;
      next.width = (object.width || 400) * ratioX;
      next.height = (object.height || object.size) * s;
    } else {
      next.scale = (object.scale || 1) * s;
    }
    return next;
  });
  selected = null;
  draw();
  renderLayers();
  updateHistoryButtons();
  $('posterWidth').value = w;
  $('posterHeight').value = h;
  const status = $('sizeStatus');
  if (status) status.textContent = `画布已调整为 ${w}×${h}（${posterSizeInfo().label}）。后续生成与下载都按这个尺寸。`;
}

$('applySize').onclick = () => {
  const w = parseInt($('posterWidth').value, 10);
  const h = parseInt($('posterHeight').value, 10);
  if (!w || !h || w < 200 || w > 4096 || h < 200 || h > 4096) {
    $('sizeStatus').textContent = '宽高需在 200–4096 像素之间。';
    return;
  }
  setPosterSize(w, h);
};
$('sizePresets').querySelectorAll('button').forEach(button => {
  button.onclick = () => setPosterSize(+button.dataset.w, +button.dataset.h);
});

$('download').onclick = () => {
  selected = null;
  draw();
  const anchor = document.createElement('a');
  anchor.download = `TripMALL营销海报_${canvas.width}x${canvas.height}.png`;
  anchor.href = canvas.toDataURL('image/png');
  anchor.click();
};

/* ============================ 视频生成 ============================ */

/* 视频功能导航：三个功能页切换（限定在 #video 内，避免影响海报视图） */
const videoNav = $('videoNav');
if (videoNav) {
  videoNav.querySelectorAll('button[data-view]').forEach(button => {
    button.onclick = () => {
      videoNav.querySelectorAll('button[data-view]').forEach(b => b.classList.remove('on'));
      button.classList.add('on');
      document.querySelectorAll('#video .view').forEach(view => {
        view.hidden = view.dataset.view !== button.dataset.view;
      });
    };
  });
}

/* 视频任务专用慢速进度条：视频通常 1–5 分钟，别像文案那样几十秒就走完 */
function startVideoProgress(barId) {
  const bar = $(barId);
  const pct = $(barId + 'Pct');
  const fill = $(barId + 'Fill');
  const noop = { done() {}, fail() {}, stop() {} };
  if (!bar || !pct || !fill) return noop;
  bar.hidden = false;
  bar.classList.remove('done', 'fail');
  pct.textContent = '1%';
  fill.style.width = '1%';
  let progress = 1;
  let timer = null;
  let finished = false;
  const tick = () => {
    if (finished) return;
    let step;
    if (progress < 30) step = 0.2 + Math.random() * 0.35;
    else if (progress < 70) step = 0.1 + Math.random() * 0.18;
    else if (progress < 90) step = 0.05 + Math.random() * 0.09;
    else step = 0.02;
    progress = Math.min(94, progress + step);
    pct.textContent = Math.floor(progress) + '%';
    fill.style.width = Math.floor(progress) + '%';
    timer = setTimeout(tick, 500);
  };
  timer = setTimeout(tick, 500);
  return {
    done() {
      if (finished) return;
      finished = true;
      clearTimeout(timer);
      pct.textContent = '100%';
      fill.style.width = '100%';
      bar.classList.add('done');
      setTimeout(() => { bar.hidden = true; }, 1000);
    },
    fail() {
      if (finished) return;
      finished = true;
      clearTimeout(timer);
      bar.classList.add('fail');
      setTimeout(() => { bar.hidden = true; }, 1600);
    },
    stop() {
      finished = true;
      clearTimeout(timer);
      bar.hidden = true;
    }
  };
}

function readFileAsDataURL(file) {
  return new Promise((resolve, reject) => {
    const reader = new FileReader();
    reader.onload = () => resolve(reader.result);
    reader.onerror = () => reject(new Error('文件读取失败'));
    reader.readAsDataURL(file);
  });
}

function videoConfigError() {
  if (!hasByokImage()) return imageConfigError();
  const imgCfg = getImageConfig();
  if (imgCfg.provider !== 'qianwen') {
    return '视频生成需要千问AI平台 Token Plan（阿里云月付套餐）：请在「AI 设置 → 图片生成」把图片服务商选为「千问AI平台 Token Plan（月付套餐）」，并填 sk-sp- 开头的 Key。';
  }
  return '';
}

async function relayVideoCreate(cfg, body) {
  if (!API_BASE) throw new Error('Token Plan 视频接口需要服务端中转，请在部署环境（github.io 线上页面）使用');
  const resp = await fetch(apiUrl('/api/token-plan-video-create'), {
    method: 'POST',
    headers: { 'Content-Type': 'application/json' },
    body: JSON.stringify(Object.assign({ apiKey: cfg.key }, body))
  });
  const data = await resp.json().catch(() => ({}));
  if (!resp.ok) throw new Error(data.error || `视频任务创建失败（${resp.status}）`);
  if (!data.task_id) throw new Error('视频任务未返回任务 ID，请稍后重试');
  return data;
}

async function relayVideoGet(cfg, taskId) {
  if (!API_BASE) throw new Error('Token Plan 视频接口需要服务端中转，请在部署环境（github.io 线上页面）使用');
  const resp = await fetch(apiUrl('/api/token-plan-video-get'), {
    method: 'POST',
    headers: { 'Content-Type': 'application/json' },
    body: JSON.stringify({ apiKey: cfg.key, task_id: taskId })
  });
  const data = await resp.json().catch(() => ({}));
  if (!resp.ok) throw new Error(data.error || `视频状态查询失败（${resp.status}）`);
  return data;
}

/* 轮询视频任务（每 15 秒一次，最长 10 分钟） */
async function pollVideoTask(cfg, taskId, statusEl) {
  const deadline = Date.now() + 10 * 60 * 1000;
  const labels = { PENDING: '排队中，请稍候…', RUNNING: '生成中，通常需要 1–5 分钟…' };
  while (Date.now() < deadline) {
    await new Promise(resolve => setTimeout(resolve, 15000));
    const data = await relayVideoGet(cfg, taskId);
    if (statusEl && labels[data.task_status]) statusEl.textContent = labels[data.task_status];
    if (data.task_status === 'SUCCEEDED') return data;
    if (data.task_status === 'FAILED') throw new Error(data.message || '视频生成失败，请重试或调整指令');
  }
  throw new Error('视频生成超时（10 分钟），任务仍在后台运行，稍后可重试');
}

function showVideoPreview(url) {
  const box = $('videoPreviewBox');
  box.hidden = false;
  $('videoPreview').src = url;
  $('videoDownload').href = url;
}

function clearVideoPreview() {
  const video = $('videoPreview');
  video.pause();
  video.removeAttribute('src');
  video.load();
  $('videoPreviewBox').hidden = true;
}
if ($('videoPreviewClose')) $('videoPreviewClose').onclick = clearVideoPreview;

async function runVideoTask(kind, options, ui) {
  const progress = startVideoProgress(ui.progressId);
  const status = $(ui.statusId);
  const button = ui.button;
  status.textContent = '';
  const configError = videoConfigError();
  if (configError) {
    status.textContent = configError;
    progress.stop();
    return;
  }
  const cfg = getImageConfig();
  button.textContent = ui.busyLabel || '生成中…';
  try {
    const task = await relayVideoCreate(cfg, {
      kind,
      prompt: options.prompt || '',
      media: options.media || [],
      resolution: options.resolution || '720P',
      ratio: options.ratio || '',
      duration: options.duration || 5,
      sound_control: options.sound || ''
    });
    status.textContent = '任务已提交，排队中…';
    const result = await pollVideoTask(cfg, task.task_id, status);
    if (!result.video_url) throw new Error('任务完成但未返回视频地址，请稍后重试');
    showVideoPreview(result.video_url);
    status.textContent = '视频生成完成，已在上方预览，可点击下载。';
    progress.done();
  } catch (error) {
    status.textContent = `生成失败：${error.message}`;
    progress.fail();
  } finally {
    button.textContent = ui.idleLabel || '生成视频';
  }
}

function videoCommonParams(prefix) {
  const ratioEl = $(prefix + 'Ratio');
  const durationEl = $(prefix + 'Duration');
  return {
    resolution: $(prefix + 'Res').value,
    ratio: ratioEl ? ratioEl.value : '',
    duration: durationEl ? parseInt(durationEl.value, 10) : 5
  };
}

/* —— 图/文生视频 —— */
if ($('videoFirstFrame')) $('videoFirstFrame').onchange = async event => {
  const file = event.target.files && event.target.files[0];
  const box = $('videoFirstFramePreview');
  if (!file) {
    box.hidden = true;
    box.innerHTML = '';
    return;
  }
  try {
    const { dataUrl } = await resizeImageFile(file, 1024);
    box.innerHTML = `<img src="${dataUrl}" alt="首帧预览">`;
    box.hidden = false;
  } catch {
    box.hidden = true;
  }
};

if ($('videoT2vBtn')) $('videoT2vBtn').onclick = async event => {
  const button = event.currentTarget;
  let prompt = $('videoT2vPrompt').value.trim();
  const file = $('videoFirstFrame').files[0];
  const status = $('videoT2vStatus');
  let media = [];
  if (file) {
    try {
      const { dataUrl } = await resizeImageFile(file, 1024);
      media = [{ type: 'first_frame', url: dataUrl }];
    } catch {
      status.textContent = '首帧图片读取失败，请换一张图';
      return;
    }
  }
  if (!prompt && !media.length) {
    status.textContent = '请先输入视频描述（或上传首帧图片后只写运动描述）。';
    return;
  }
  const larkBg = larkRelevant(`${prompt} ${$('product').value || ''}`, 700, 1);
  if (larkBg) prompt += `\n\n【背景知识（仅作内容参考，不要朗读或把这些文字显示在画面里）】\n${larkBg}`;
  const kind = media.length ? 'i2v' : 't2v';
  await runVideoTask(kind, { prompt, media, ...videoCommonParams('videoT2v') }, {
    progressId: 'videoT2vProgress',
    statusId: 'videoT2vStatus',
    button,
    idleLabel: '🎬 生成视频',
    busyLabel: '生成中…'
  });
};

/* —— 参考生视频 —— */
const videoRefs = [];
function addVideoRef(src) {
  if (videoRefs.length >= 9) return;
  videoRefs.push(src);
  renderVideoRefs();
}
function removeVideoRef(index) {
  videoRefs.splice(index, 1);
  renderVideoRefs();
}
function renderVideoRefs() {
  const list = $('videoRefList');
  if (!list) return;
  if (!videoRefs.length) {
    list.innerHTML = '';
    return;
  }
  list.innerHTML = videoRefs.map((src, index) => `
    <div class="ref-thumb">
      <img src="${src}" alt="参考图 ${index + 1}">
      <span>${index + 1}</span>
      <button type="button" data-remove="${index}" title="删除">✕</button>
    </div>`).join('');
  list.querySelectorAll('[data-remove]').forEach(btn => {
    btn.onclick = () => removeVideoRef(+btn.dataset.remove);
  });
}

if ($('videoRefFiles')) $('videoRefFiles').onchange = async event => {
  const files = Array.from(event.target.files || []).slice(0, 9 - videoRefs.length);
  for (const file of files) {
    try {
      const { dataUrl } = await resizeImageFile(file, 1024);
      addVideoRef(dataUrl);
    } catch { /* 忽略损坏图片 */ }
  }
  event.target.value = '';
};

if ($('videoRefUrlBtn')) $('videoRefUrlBtn').onclick = async () => {
  const url = $('videoRefUrl').value.trim();
  if (!url) return alert('先粘贴链接');
  const btn = $('videoRefUrlBtn');
  const status = $('videoRefStatus');
  btn.textContent = '解析中…';
  status.textContent = '';
  try {
    const resp = await fetch(apiUrl('/api/token-plan-video-refs'), {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ url })
    });
    const data = await resp.json().catch(() => ({}));
    if (!resp.ok) throw new Error(data.error || `解析失败（${resp.status}）`);
    const images = (data.images || []).slice(0, 9 - videoRefs.length);
    if (!images.length) throw new Error('未提取到可用图片，请直接上传参考图');
    images.forEach(src => addVideoRef(src));
    status.textContent = `已从链接提取 ${images.length} 张参考图，可直接生成。`;
  } catch (error) {
    status.textContent = `链接解析失败：${error.message}`;
  } finally {
    btn.textContent = '解析链接';
  }
};

if ($('videoRefBtn')) $('videoRefBtn').onclick = async event => {
  const button = event.currentTarget;
  let prompt = $('videoRefPrompt').value.trim();
  const status = $('videoRefStatus');
  if (!prompt) {
    status.textContent = '请先输入视频描述（用 [Image 1]、[Image 2] 指代参考图）。';
    return;
  }
  if (!videoRefs.length) {
    status.textContent = '请先上传参考图或解析链接提取图片。';
    return;
  }
  const larkBg = larkRelevant(`${prompt} ${$('product').value || ''}`, 700, 1);
  if (larkBg) prompt += `\n\n【背景知识（仅作内容参考，不要朗读或把这些文字显示在画面里）】\n${larkBg}`;
  const media = videoRefs.map(url => ({ type: 'reference_image', url }));
  await runVideoTask('r2v', { prompt, media, ...videoCommonParams('videoRef') }, {
    progressId: 'videoRefProgress',
    statusId: 'videoRefStatus',
    button,
    idleLabel: '🖼 生成视频',
    busyLabel: '生成中…'
  });
};

/* —— 视频编辑 —— */
if ($('videoEditBtn')) $('videoEditBtn').onclick = async event => {
  const button = event.currentTarget;
  const prompt = $('videoEditPrompt').value.trim();
  const status = $('videoEditStatus');
  if (!prompt) {
    status.textContent = '请先输入编辑指令。';
    return;
  }
  const file = $('videoEditFile').files[0];
  const videoUrl = $('videoEditUrl').value.trim();
  if (!file && !videoUrl) {
    status.textContent = '请上传待编辑视频，或粘贴公网视频链接。';
    return;
  }
  if (file && file.size > 2.5 * 1024 * 1024) {
    status.textContent = '视频文件超过 2.5MB（中转接口限制），请压缩/截短后再上传，或粘贴公网视频链接。';
    return;
  }
  const media = [];
  try {
    if (file) media.push({ type: 'video', url: await readFileAsDataURL(file) });
    else media.push({ type: 'video', url: videoUrl });
    const refs = Array.from($('videoEditRefs').files || []).slice(0, 5);
    for (const ref of refs) {
      const { dataUrl } = await resizeImageFile(ref, 1024);
      media.push({ type: 'reference_image', url: dataUrl });
    }
  } catch {
    status.textContent = '文件读取失败，请重试。';
    return;
  }
  await runVideoTask('edit', {
    prompt,
    media,
    resolution: $('videoEditRes').value,
    sound: $('videoEditSound').value
  }, {
    progressId: 'videoEditProgress',
    statusId: 'videoEditStatus',
    button,
    idleLabel: '✂️ 编辑视频',
    busyLabel: '编辑中…'
  });
};

/* ============================ 初始化 ============================ */

updateHistoryButtons();
draw();
